package com.game.util;

import com.alibaba.fastjson.JSONObject;

import java.util.HashMap;
import java.util.Map;

/**
 * Created by Administrator on 2019-03-05.
 */
public class Constant {

    /***
    public static final String NPC_MAP = "{\n" +
            "\tname: \"首页\",\n" +
            "\t//地图名称text: Array(\"本页包含你的账号和密码信息\",\n" +
            "\t\"新手村\",\n" +
            "\t\"开始江湖\"),\n" +
            "\t//描述判定npc: Array(),\n" +
            "\t//npcdirection: Array(//可去路径{\n" +
            "\t\tname: this.enx,\n" +
            "\t\ttext: \"开始江湖冒险\"\n" +
            "\t},\n" +
            "\t{\n" +
            "\t\tname: \"江湖大厅论坛\",\n" +
            "\t\ttext: \"论坛\"\n" +
            "\t},\n" +
            "\t{\n" +
            "\t\tname: \"长安客栈\",\n" +
            "\t\ttext: \"长安客栈\"\n" +
            "\t})\n" +
            "},\n" +
            "{\n" +
            "\tname: \"新手村广场\",\n" +
            "\t//地图名称text: Array(\"欢迎你来到风云变幻的江湖\",\n" +
            "\t\"北：镜湖(挣钱) ↑\",\n" +
            "\t\"西：长安客栈(江湖起点) ←\"),\n" +
            "\t//描述判定npc: Array(\"武林信使\"),\n" +
            "\t//npcdirection: Array(//可去路径{\n" +
            "\t\tname: \"镜湖\",\n" +
            "\t\ttext: \"北：镜湖(挣钱) ↑\"\n" +
            "\t},\n" +
            "\t{\n" +
            "\t\tname: \"长安客栈\",\n" +
            "\t\ttext: \"西：长安客栈(江湖起点) ←\"\n" +
            "\t},\n" +
            "\t{\n" +
            "\t\tname: \"新手村夺宝擂台\",\n" +
            "\t\ttext: \"东：夺宝擂台(PK场) →\"\n" +
            "\t},\n" +
            "\t{\n" +
            "\t\tname: \"江湖聚义厅\",\n" +
            "\t\ttext: \"南：江湖聚义厅 ↓\"\n" +
            "\t})\n" +
            "},\n" +
            "{\n" +
            "\tname: \"镜湖\",\n" +
            "\t//地图名称text: Array(\"这里可以钓鱼挣钱\",\n" +
            "\t\"还可以搜索地上捡钱\"),\n" +
            "\t//描述判定npc: Array(),\n" +
            "\t//npcdirection: Array(//可去路径{\n" +
            "\t\tname: \"新手村当铺\",\n" +
            "\t\ttext: \"北：当铺(存物品) ↑\"\n" +
            "\t},\n" +
            "\t{\n" +
            "\t\tname: \"新手村商店\",\n" +
            "\t\ttext: \"西：商店(买东西)\"\n" +
            "\t},\n" +
            "\t{\n" +
            "\t\tname: \"新手村钱庄\",\n" +
            "\t\ttext: \"东：钱庄(存取钱) →\"\n" +
            "\t},\n" +
            "\t{\n" +
            "\t\tname: \"长安客栈\",\n" +
            "\t\ttext: \"返回长安客栈\"\n" +
            "\t},\n" +
            "\t{\n" +
            "\t\tname: \"新手村广场\",\n" +
            "\t\ttext: \"南：新手村广场 ↓\"\n" +
            "\t})\n" +
            "},\n" +
            "{\n" +
            "\tname: \"新手村当铺\",\n" +
            "\t//地图名称text: Array(\"这里可以存放东西\",\n" +
            "\t\"且不收手续费\",\n" +
            "\t\"南：镜湖(挣钱) ↓\"),\n" +
            "\t//描述判定npc: Array(\"春花(任务)\",\n" +
            "\t\"梅剑\"),\n" +
            "\t//npcdirection: Array(//可去路径{\n" +
            "\t\tname: \"长安客栈\",\n" +
            "\t\ttext: \"返回长安客栈\"\n" +
            "\t},\n" +
            "\t{\n" +
            "\t\tname: \"镜湖\",\n" +
            "\t\ttext: \"南：镜湖(挣钱) ↓\"\n" +
            "\t})\n" +
            "},\n" +
            "{\n" +
            "\tname: \"新手村商店\",\n" +
            "\t//地图名称text: Array(\"这里可以买卖东西\",\n" +
            "\t\"东：镜湖(挣钱) →\"),\n" +
            "\t//描述判定npc: Array(\"竹剑\"),\n" +
            "\t//npcdirection: Array(//可去路径{\n" +
            "\t\tname: \"长安客栈\",\n" +
            "\t\ttext: \"返回长安客栈\"\n" +
            "\t},\n" +
            "\t{\n" +
            "\t\tname: \"镜湖\",\n" +
            "\t\ttext: \"东：镜湖(挣钱) →\"\n" +
            "\t})\n" +
            "},\n" +
            "{\n" +
            "\tname: \"新手村钱庄\",\n" +
            "\t//地图名称text: Array(\"这里可以存取钱\",\n" +
            "\t\"西：镜湖(挣钱)\"),\n" +
            "\t//描述判定npc: Array(\"包不同\"),\n" +
            "\t//npcdirection: Array(//可去路径{\n" +
            "\t\tname: \"首页\",\n" +
            "\t\ttext: \"返回首页\"\n" +
            "\t},\n" +
            "\t{\n" +
            "\t\tname: \"镜湖\",\n" +
            "\t\ttext: \"西：镜湖(挣钱) ←\"\n" +
            "\t})\n" +
            "},\n" +
            "{\n" +
            "\tname: \"江湖聚义厅\",\n" +
            "\t//地图名称text: Array(\"江湖豪杰相会于此\",\n" +
            "\t\"在这里你可以申请成为新人的师傅\"),\n" +
            "\t//描述判定npc: Array(),\n" +
            "\t//npcdirection: Array(//可去路径{\n" +
            "\t\tname: \"新手村广场\",\n" +
            "\t\ttext: \"北：新手村广场 ↑\"\n" +
            "\t},\n" +
            "\t{\n" +
            "\t\tname: \"江湖公告栏\",\n" +
            "\t\ttext: \"西：江湖公告栏 ←\"\n" +
            "\t},\n" +
            "\t{\n" +
            "\t\tname: \"新手村武馆\",\n" +
            "\t\ttext: \"东：武馆(学艺) →\"\n" +
            "\t},\n" +
            "\t{\n" +
            "\t\tname: \"江湖聊天室\",\n" +
            "\t\ttext: \"南：江湖聊天室 ↓\"\n" +
            "\t})\n" +
            "},\n" +
            "{\n" +
            "\tname: \"新手村武馆\",\n" +
            "\t//地图名称text: Array(\"这里可以找钟灵学习武艺\"),\n" +
            "\t//描述判定npc: Array(\"钟灵\"),\n" +
            "\t//npcdirection: Array(//可去路径{\n" +
            "\t\tname: \"江湖聚义厅\",\n" +
            "\t\ttext: \"西：江湖聚义厅 ←\"\n" +
            "\t})\n" +
            "},\n" +
            "{\n" +
            "\tname: \"江湖公告栏\",\n" +
            "\t//地图名称text: Array(\"这里空无一人，只剩一幅牌匾高挂在墙上\"),\n" +
            "\t//描述判定npc: Array(),\n" +
            "\t//npcdirection: Array(//可去路径{\n" +
            "\t\tname: \"江湖聚义厅\",\n" +
            "\t\ttext: \"东：江湖聚义厅 →\"\n" +
            "\t})\n" +
            "},\n" +
            "{\n" +
            "\tname: \"江湖聊天室\",\n" +
            "\t//地图名称text: Array(\"这是江湖人士聚集的地方，大家可以畅所欲言\"),\n" +
            "\t//描述判定npc: Array(),\n" +
            "\t//npcdirection: Array(//可去路径{\n" +
            "\t\tname: \"江湖聚义厅\",\n" +
            "\t\ttext: \"北：江湖聚义厅 ↑\"\n" +
            "\t})\n" +
            "},\n" +
            "{\n" +
            "\tname: \"长安客栈\",\n" +
            "\t//地图名称text: Array(\"长安客栈是江湖人物出没的地方\"),\n" +
            "\t//描述判定npc: Array(\"小丽(任务)\",\n" +
            "\t\"江湖百晓生\",\n" +
            "\t\"少林清法比丘\",\n" +
            "\t\"五岳剑派柳如烟\",\n" +
            "\t\"魔教无名乞丐\",\n" +
            "\t\"日月神教见钱开\",\n" +
            "\t\"丐帮裘万家\",\n" +
            "\t\"唐门唐方\"),\n" +
            "\t//npcdirection: Array(//可去路径{\n" +
            "\t\tname: \"长安福威镖局\",\n" +
            "\t\ttext: \"北：福威镖局(挂机)\"\n" +
            "\t},\n" +
            "\t{\n" +
            "\t\tname: \"朱雀大街\",\n" +
            "\t\ttext: \"西：朱雀大街\"\n" +
            "\t},\n" +
            "\t{\n" +
            "\t\tname: \"新手村广场\",\n" +
            "\t\ttext: \"东：新手村广场\"\n" +
            "\t},\n" +
            "\t{\n" +
            "\t\tname: \"长安竹林入口\",\n" +
            "\t\ttext: \"南：竹林入口(打怪)\"\n" +
            "\t})\n" +
            "},\n" +
            "{\n" +
            "\tname: \"福威镖局\",\n" +
            "\t//地图名称text: Array(\"加入镖局后，可以点卯\",\n" +
            "\t\"南：长安客栈(江湖起点) ↓\"),\n" +
            "\t//描述判定npc: Array(\"镖局总管\"),\n" +
            "\t//npcdirection: Array(//可去路径{\n" +
            "\t\tname: \"镖局中堂\",\n" +
            "\t\ttext: \"北：镖局中堂(捡东西) ↑\"\n" +
            "\t},\n" +
            "\t{\n" +
            "\t\tname: \"长安客栈\",\n" +
            "\t\ttext: \"南：长安客栈(江湖起点) ↓\"\n" +
            "\t})\n" +
            "},\n" +
            "{\n" +
            "\tname: \"镖局中堂\",\n" +
            "\t//地图名称text: Array(\"这里有镖局为趟子手、镖师、镖头们准备的一些常用物品\",\n" +
            "\t\"南：福威镖局(挂机) ↓\"),\n" +
            "\t//描述判定npc: Array(\"梅剑\"),\n" +
            "\t//npcdirection: Array(//可去路径{\n" +
            "\t\tname: \"镖局后堂\",\n" +
            "\t\ttext: \"北：镖局后堂(秘密) ↑\"\n" +
            "\t},\n" +
            "\t{\n" +
            "\t\tname: \"福威镖局\",\n" +
            "\t\ttext: \"南：福威镖局(挂机) ↓\"\n" +
            "\t})\n" +
            "},\n" +
            "{\n" +
            "\tname: \"镖局后堂\",\n" +
            "\t//地图名称text: Array(\"这是一间空荡荡的房间，但你隐约觉得这里似乎充满了秘密\",\n" +
            "\t\"南：镖局中堂(捡东西) ↓\"),\n" +
            "\t//描述判定npc: Array(),\n" +
            "\t//npcdirection: Array(//可去路径{\n" +
            "\t\tname: \"大门紧闭\",\n" +
            "\t\ttext: \"北：（大门紧闭）\"\n" +
            "\t},\n" +
            "\t{\n" +
            "\t\tname: \"镖局中堂\",\n" +
            "\t\ttext: \"南：镖局中堂(捡东西) ↓\"\n" +
            "\t},\n" +
            "\t{\n" +
            "\t\tname: \"长安客栈\",\n" +
            "\t\ttext: \"返回长安客栈\"\n" +
            "\t})\n" +
            "},\n" +
            "{\n" +
            "\tname: \"长安竹林入口\",\n" +
            "\t//地图名称text: Array(\"最近长安不怎么太平，竹林里聚集了一些不法之徒\"),\n" +
            "\t//描述判定npc: Array(\"小地痞\",\n" +
            "\t\"地痞头目\",\n" +
            "\t\"地痞\"),\n" +
            "\t//npcdirection: Array(//可去路径{\n" +
            "\t\tname: \"长安客栈\",\n" +
            "\t\ttext: \"北：长安客栈(江湖起点) ↑\"\n" +
            "\t},\n" +
            "\t{\n" +
            "\t\tname: \"长安竹林中心\",\n" +
            "\t\ttext: \"南：竹林中心(打怪) ↓\"\n" +
            "\t})\n" +
            "},\n" +
            "{\n" +
            "\tname: \"长安竹林中心\",\n" +
            "\t//地图名称text: Array(\"这里是竹林中心，一群贼眉鼠眼的人正在窃窃私语\"),\n" +
            "\t//描述判定npc: Array(\"飞贼\",\n" +
            "\t\"蒙面飞贼\",\n" +
            "\t\"飞贼头目\"),\n" +
            "\t//npcdirection: Array(//可去路径{\n" +
            "\t\tname: \"长安竹林入口\",\n" +
            "\t\ttext: \"北：竹林入口(打怪) ↑\"\n" +
            "\t},\n" +
            "\t{\n" +
            "\t\tname: \"长安竹林深处\",\n" +
            "\t\ttext: \"南：竹林深处(打怪) ↓\"\n" +
            "\t})\n" +
            "},\n" +
            "{\n" +
            "\tname: \"长安竹林深处\",\n" +
            "\t//地图名称text: Array(\"你走到了竹林深处，里面聚集了不少江湖人士\"),\n" +
            "\t//描述判定npc: Array(\"强盗\",\n" +
            "\t\"蒙面强盗\",\n" +
            "\t\"强盗头目\"),\n" +
            "\t//npcdirection: Array(//可去路径{\n" +
            "\t\tname: \"长安竹林中心\",\n" +
            "\t\ttext: \"南：竹林中心(打怪) ↓\"\n" +
            "\t})\n" +
            "},\n" +
            "{\n" +
            "\tname: \"新手村夺宝擂台\",\n" +
            "\t//地图名称text: Array(\"这里是江湖人士切磋武艺的地方\",\n" +
            "\t\"北：桃园 ↑\",\n" +
            "\t\"西：新手村广场 ←\"),\n" +
            "\t//描述判定npc: Array(\"打手\",\n" +
            "\t\"职业打手\",\n" +
            "\t\"春丽\"),\n" +
            "\t//npcdirection: Array(//可去路径{\n" +
            "\t\tname: \"新手村桃园\",\n" +
            "\t\ttext: \"北：桃园 ↑\"\n" +
            "\t},\n" +
            "\t{\n" +
            "\t\tname: \"新手村广场\",\n" +
            "\t\ttext: \"西：新手村广场\"\n" +
            "\t},\n" +
            "\t{\n" +
            "\t\tname: \"新手村冥思房\",\n" +
            "\t\ttext: \"东：冥思房 →\"\n" +
            "\t},\n" +
            "\t{\n" +
            "\t\tname: \"天龙八部群芳楼\",\n" +
            "\t\ttext: \"南：群芳楼 ↓\"\n" +
            "\t})\n" +
            "},\n" +
            "{\n" +
            "\tname: \"新手村桃园\",\n" +
            "\t//地图名称text: Array(\"这里是桃园\",\n" +
            "\t\"这里可以与肝胆相照的好友结拜为义兄弟\",\n" +
            "\t\"北：洞房 ↑\",\n" +
            "\t\"南：夺宝擂台(PK场) ↓\"),\n" +
            "\t//描述判定npc: Array(),\n" +
            "\t//npcdirection: Array(//可去路径{\n" +
            "\t\tname: \"新手村洞房\",\n" +
            "\t\ttext: \"北：洞房 ↑\"\n" +
            "\t},\n" +
            "\t{\n" +
            "\t\tname: \"长安客栈\",\n" +
            "\t\ttext: \"返回长安客栈\"\n" +
            "\t},\n" +
            "\t{\n" +
            "\t\tname: \"新手村夺宝擂台\",\n" +
            "\t\ttext: \"南：夺宝擂台(PK场) ↓\"\n" +
            "\t})\n" +
            "},\n" +
            "{\n" +
            "\tname: \"新手村洞房\",\n" +
            "\t//地图名称text: Array(\"这里是洞房\",\n" +
            "\t\"可以在这里和情投意合的心上人结为夫妻\",\n" +
            "\t\"南：桃园 ↓\"),\n" +
            "\t//描述判定npc: Array(),\n" +
            "\t//npcdirection: Array(//可去路径{\n" +
            "\t\tname: \"新手村桃园\",\n" +
            "\t\ttext: \"南：桃园 ↓\"\n" +
            "\t})\n" +
            "},\n" +
            "{\n" +
            "\tname: \"新手村冥思房\",\n" +
            "\t//地图名称text: Array(\"一间静悄悄的屋子\",\n" +
            "\t\"在这里你可以冥思武学的精要\",\n" +
            "\t\"西：夺宝擂台(PK场) ←\"),\n" +
            "\t//描述判定npc: Array(\"道长\"),\n" +
            "\t//npcdirection: Array(//可去路径{\n" +
            "\t\tname: \"长安客栈\",\n" +
            "\t\ttext: \"返回长安客栈\"\n" +
            "\t},\n" +
            "\t{\n" +
            "\t\tname: \"新手村夺宝擂台\",\n" +
            "\t\ttext: \"西：夺宝擂台(PK场) ← ↑\"\n" +
            "\t})\n" +
            "},\n" +
            "{\n" +
            "\tname: \"天龙八部群芳楼\",\n" +
            "\t//地图名称text: Array(\"这里有最贵的酒\",\n" +
            "\t\"北：夺宝擂台(PK场) ↑\",\n" +
            "\t\"南：不眠阁 ↓\"),\n" +
            "\t//描述判定npc: Array(\"康敏\",\n" +
            "\t\"丫环\"),\n" +
            "\t//npcdirection: Array(//可去路径{\n" +
            "\t\tname: \"新手村夺宝擂台\",\n" +
            "\t\ttext: \"北：夺宝擂台(PK场) ↑\"\n" +
            "\t},\n" +
            "\t{\n" +
            "\t\tname: \"不眠阁\",\n" +
            "\t\ttext: \"南：不眠阁 ↓\"\n" +
            "\t})\n" +
            "},\n" +
            "{\n" +
            "\tname: \"不眠阁\",\n" +
            "\t//地图名称text: Array(\"厅中一大台，酒肴已设\",\n" +
            "\t\"北：群芳楼 \",\n" +
            "\t\"阵阵娇笑之声从房间传来\"),\n" +
            "\t//描述判定npc: Array(\"梦姑\",\n" +
            "\t\"丫环\"),\n" +
            "\t//npcdirection: Array(//可去路径{\n" +
            "\t\tname: \"天龙八部群芳楼\",\n" +
            "\t\ttext: \"北：群芳楼 \"\n" +
            "\t},\n" +
            "\t{\n" +
            "\t\tname: \"湖上花\",\n" +
            "\t\ttext: \"南：湖上花 ↓\"\n" +
            "\t})\n" +
            "},\n" +
            "{\n" +
            "\tname: \"湖上花\",\n" +
            "\t//地图名称text: Array(\"湖上花，天水浸灵芽\",\n" +
            "\t\"浅蕊水边匀玉粉\",\n" +
            "\t\"浓苞天外剪明霞\"),\n" +
            "\t//描述判定npc: Array(\"阿碧\",\n" +
            "\t\"丫环\"),\n" +
            "\t//npcdirection: Array(//可去路径{\n" +
            "\t\tname: \"不眠阁\",\n" +
            "\t\ttext: \"北：不眠阁 ↑\"\n" +
            "\t},\n" +
            "\t{\n" +
            "\t\tname: \"湖上草\",\n" +
            "\t\ttext: \"南：湖上草 ↓\"\n" +
            "\t})\n" +
            "},\n" +
            "{\n" +
            "\tname: \"湖上草\",\n" +
            "\t//地图名称text: Array(\"湖上草，碧翠浪通津\",\n" +
            "\t\"修带不为歌舞缓\",\n" +
            "\t\"浓铺堪作醉人茵\"),\n" +
            "\t//描述判定npc: Array(\"刀白凤\",\n" +
            "\t\"丫环\"),\n" +
            "\t//npcdirection: Array(//可去路径{\n" +
            "\t\tname: \"湖上花\",\n" +
            "\t\ttext: \"北：湖上花 ↑\"\n" +
            "\t},\n" +
            "\t{\n" +
            "\t\tname: \"湖上女\",\n" +
            "\t\ttext: \"南：湖上女 ↓\"\n" +
            "\t})\n" +
            "},\n" +
            "{\n" +
            "\tname: \"湖上女\",\n" +
            "\t//地图名称text: Array(\"湖上女，精选正轻盈\",\n" +
            "\t\"犹恨乍离金殿侣\",\n" +
            "\t\"相将尽是采莲人\"),\n" +
            "\t//描述判定npc: Array(\"甘宝宝\",\n" +
            "\t\"丫环\"),\n" +
            "\t//npcdirection: Array(//可去路径{\n" +
            "\t\tname: \"湖上草\",\n" +
            "\t\ttext: \"北：湖上草 ↑\"\n" +
            "\t},\n" +
            "\t{\n" +
            "\t\tname: \"湖上酒\",\n" +
            "\t\ttext: \"南：湖上酒 ↓\"\n" +
            "\t})\n" +
            "},\n" +
            "{\n" +
            "\tname: \"湖上酒\",\n" +
            "\t//地图名称text: Array(\"湖上酒，终日助清欢\",\n" +
            "\t\"檀板轻声银甲缓\",\n" +
            "\t\"醅浮香米玉蛆寒\"),\n" +
            "\t//描述判定npc: Array(\"王夫人\",\n" +
            "\t\"丫环\"),\n" +
            "\t//npcdirection: Array(//可去路径{\n" +
            "\t\tname: \"湖上女\",\n" +
            "\t\ttext: \"北：湖上女 ↑\"\n" +
            "\t},\n" +
            "\t{\n" +
            "\t\tname: \"湖上月\",\n" +
            "\t\ttext: \"南：湖上月 ↓\"\n" +
            "\t})\n" +
            "},\n" +
            "{\n" +
            "\tname: \"湖上月\",\n" +
            "\t//地图名称text: Array(\"湖上月，偏照列仙家\",\n" +
            "\t\"水浸寒光铺枕簟\",\n" +
            "\t\"浪摇晴影走金蛇\"),\n" +
            "\t//描述判定npc: Array(\"木婉清\",\n" +
            "\t\"丫环\"),\n" +
            "\t//npcdirection: Array(//可去路径{\n" +
            "\t\tname: \"湖上酒\",\n" +
            "\t\ttext: \"北：湖上酒 ↑\"\n" +
            "\t},\n" +
            "\t{\n" +
            "\t\tname: \"湖上雪\",\n" +
            "\t\ttext: \"南：湖上雪 ↓\"\n" +
            "\t})\n" +
            "},\n" +
            "{\n" +
            "\tname: \"湖上雪\",\n" +
            "\t//地图名称text: Array(\"湖上雪，风急堕还多\",\n" +
            "\t\"轻片有时敲竹户\",\n" +
            "\t\"素华无韵入澄波\"),\n" +
            "\t//描述判定npc: Array(\"王语嫣\",\n" +
            "\t\"丫环\"),\n" +
            "\t//npcdirection: Array(//可去路径{\n" +
            "\t\tname: \"湖上月\",\n" +
            "\t\ttext: \"北：湖上月 ↑\"\n" +
            "\t},\n" +
            "\t{\n" +
            "\t\tname: \"湖上水\",\n" +
            "\t\ttext: \"南：湖上水 ↓\"\n" +
            "\t})\n" +
            "},\n" +
            "{\n" +
            "\tname: \"湖上水\",\n" +
            "\t//地图名称text: Array(\"湖上水，流绕禁园中\",\n" +
            "\t\"斜日暖摇清翠动\",\n" +
            "\t\"落花香暖众纹红\"),\n" +
            "\t//描述判定npc: Array(\"阿紫\",\n" +
            "\t\"丫环\"),\n" +
            "\t//npcdirection: Array(//可去路径{\n" +
            "\t\tname: \"湖上雪\",\n" +
            "\t\ttext: \"北：湖上雪 ↑\"\n" +
            "\t},\n" +
            "\t{\n" +
            "\t\tname: \"湖上柳\",\n" +
            "\t\ttext: \"南：湖上柳 ↓\"\n" +
            "\t})\n" +
            "},\n" +
            "{\n" +
            "\tname: \"湖上柳\",\n" +
            "\t//地图名称text: Array(\"湖上柳，烟里不胜催\",\n" +
            "\t\"宿雾洗开明媚眼\",\n" +
            "\t\"北：湖上水\"),\n" +
            "\t//描述判定npc: Array(\"阿朱\"),\n" +
            "\t//npcdirection: Array(//可去路径{\n" +
            "\t\tname: \"湖上水\",\n" +
            "\t\ttext: \"北：湖上水 ↑\"\n" +
            "\t})\n" +
            "},\n" +
            "{\n" +
            "\tname: \"朱雀大街\",\n" +
            "\t//地图名称text: Array(\"你走在一条繁忙的街道\"),\n" +
            "\t//描述判定npc: Array(\"春花\",\n" +
            "\t\"苦力\",\n" +
            "\t\"林得财\"),\n" +
            "\t//npcdirection: Array(//可去路径{\n" +
            "\t\tname: \"长安城广场\",\n" +
            "\t\ttext: \"北：长安城广场 ↑\"\n" +
            "\t},\n" +
            "\t{\n" +
            "\t\tname: \"江湖大厅论坛\",\n" +
            "\t\ttext: \"西：江湖大厅论坛 ←\"\n" +
            "\t},\n" +
            "\t{\n" +
            "\t\tname: \"长安客栈\",\n" +
            "\t\ttext: \"东：长安客栈(江湖起点) →\"\n" +
            "\t},\n" +
            "\t{\n" +
            "\t\tname: \"朱雀南街\",\n" +
            "\t\ttext: \"南：朱雀南街 ↓\"\n" +
            "\t})\n" +
            "},\n" +
            "{\n" +
            "\tname: \"江湖大厅论坛\",\n" +
            "\t//地图名称text: Array(\"这里是江湖人士议事的地方\",\n" +
            "\t\"严禁不文明留言\",\n" +
            "\t\"人身攻击等行为\"),\n" +
            "\t//描述判定npc: Array(\"铁游夏\"),\n" +
            "\t//npcdirection: Array(//可去路径{\n" +
            "\t\tname: \"江湖黑市\",\n" +
            "\t\ttext: \"北：江湖黑市 ↑\"\n" +
            "\t},\n" +
            "\t{\n" +
            "\t\tname: \"夺宝风云馆\",\n" +
            "\t\ttext: \"西：夺宝风云馆 ←\"\n" +
            "\t},\n" +
            "\t{\n" +
            "\t\tname: \"朱雀大街\",\n" +
            "\t\ttext: \"东：朱雀大街 →\"\n" +
            "\t},\n" +
            "\t{\n" +
            "\t\tname: \"返回首页\",\n" +
            "\t\ttext: \"返回首页\"\n" +
            "\t},\n" +
            "\t{\n" +
            "\t\tname: \"心法黑市\",\n" +
            "\t\ttext: \"南：心法黑市 ↓\"\n" +
            "\t})\n" +
            "},\n" +
            "{\n" +
            "\tname: \"江湖黑市\",\n" +
            "\t//地图名称text: Array(\"这里大家可以购买别的侠客的物品\",\n" +
            "\t\"南：江湖大厅论坛 ↓\"),\n" +
            "\t//描述判定npc: Array(),\n" +
            "\t//npcdirection: Array(//可去路径{\n" +
            "\t\tname: \"长安客栈\",\n" +
            "\t\ttext: \"返回长安客栈\"\n" +
            "\t},\n" +
            "\t{\n" +
            "\t\tname: \"江湖大厅论坛\",\n" +
            "\t\ttext: \"南：江湖大厅论坛 ↓\"\n" +
            "\t})\n" +
            "},\n" +
            "{\n" +
            "\tname: \"心法黑市\",\n" +
            "\t//地图名称text: Array(\"这里大家可以自由买卖自己的武功心法\",\n" +
            "\t\"南：静修斋 ↓\"),\n" +
            "\t//描述判定npc: Array(),\n" +
            "\t//npcdirection: Array(//可去路径{\n" +
            "\t\tname: \"江湖黑市\",\n" +
            "\t\ttext: \"北：江湖黑市 ↑\"\n" +
            "\t},\n" +
            "\t{\n" +
            "\t\tname: \"长安客栈\",\n" +
            "\t\ttext: \"返回长安客栈\"\n" +
            "\t},\n" +
            "\t{\n" +
            "\t\tname: \"静修斋\",\n" +
            "\t\ttext: \"南：静修斋 ↓\"\n" +
            "\t})\n" +
            "},\n" +
            "{\n" +
            "\tname: \"朱雀南街\",\n" +
            "\t//地图名称text: Array(\"一条繁忙的街道\",\n" +
            "\t\"北：朱雀大街 ↑\"),\n" +
            "\t//描述判定npc: Array(\"林得宝\",\n" +
            "\t\"全冠清\",\n" +
            "\t\"苦力\",\n" +
            "\t\"游人\"),\n" +
            "\t//npcdirection: Array(//可去路径{\n" +
            "\t\tname: \"长安客栈\",\n" +
            "\t\ttext: \"返回长安客栈\"\n" +
            "\t},\n" +
            "\t{\n" +
            "\t\tname: \"朱雀大街\",\n" +
            "\t\ttext: \"北：朱雀大街 ↑\"\n" +
            "\t},\n" +
            "\t{\n" +
            "\t\tname: \"时间之门\",\n" +
            "\t\ttext: \"东：时间之门 →\"\n" +
            "\t},\n" +
            "\t{\n" +
            "\t\tname: \"朱雀门\",\n" +
            "\t\ttext: \"南：朱雀门 ↓\"\n" +
            "\t})\n" +
            "},\n" +
            "{\n" +
            "\tname: \"静修斋\",\n" +
            "\t//地图名称text: Array(\"一位鹤发童颜的老人在屋子中间翻阅着古书\",\n" +
            "\t\"北：心法黑市 ↑\"),\n" +
            "\t//描述判定npc: Array(\"神秘老人\"),\n" +
            "\t//npcdirection: Array(//可去路径{\n" +
            "\t\tname: \"心法黑市\",\n" +
            "\t\ttext: \"北：心法黑市 ↑\"\n" +
            "\t})\n" +
            "},\n" +
            "{\n" +
            "\tname: \"长安城广场\",\n" +
            "\t//地图名称text: Array(\"这里是京城的中心\",\n" +
            "\t\"北：玄武大街\",\n" +
            "\t\"南：朱雀大街\"),\n" +
            "\t//描述判定npc: Array(\"春游女孩\",\n" +
            "\t\"李白\",\n" +
            "\t\"段正淳\"),\n" +
            "\t//npcdirection: Array(//可去路径{\n" +
            "\t\tname: \"长安客栈\",\n" +
            "\t\ttext: \"返回长安客栈\"\n" +
            "\t},\n" +
            "\t{\n" +
            "\t\tname: \"玄武大街\",\n" +
            "\t\ttext: \"北：玄武大街 ↑\"\n" +
            "\t},\n" +
            "\t{\n" +
            "\t\tname: \"白虎大街\",\n" +
            "\t\ttext: \"西：白虎大街 ←\"\n" +
            "\t},\n" +
            "\t{\n" +
            "\t\tname: \"青龙大街\",\n" +
            "\t\ttext: \"东：青龙大街 →\"\n" +
            "\t},\n" +
            "\t{\n" +
            "\t\tname: \"朱雀大街\",\n" +
            "\t\ttext: \"南：朱雀大街 ↓\"\n" +
            "\t})\n" +
            "},\n" +
            "{\n" +
            "\tname: \"玄武大街\",\n" +
            "\t//地图名称text: Array(\"南：长安城广场 ↓\",\n" +
            "\t\"西：时空隧道 ←\",\n" +
            "\t\"东：烟雨楼\"),\n" +
            "\t//描述判定npc: Array(\"空空儿\",\n" +
            "\t\"醉汉\",\n" +
            "\t\"春游女孩\",\n" +
            "\t\"乞丐\"),\n" +
            "\t//npcdirection: Array(//可去路径{\n" +
            "\t\tname: \"长安客栈\",\n" +
            "\t\ttext: \"返回长安客栈\"\n" +
            "\t},\n" +
            "\t{\n" +
            "\t\tname: \"玄武北街\",\n" +
            "\t\ttext: \"北：玄武北街 ↑\"\n" +
            "\t},\n" +
            "\t{\n" +
            "\t\tname: \"时空隧道\",\n" +
            "\t\ttext: \"西：时空隧道 ←\"\n" +
            "\t},\n" +
            "\t{\n" +
            "\t\tname: \"烟雨楼\",\n" +
            "\t\ttext: \"东：烟雨楼 →\"\n" +
            "\t},\n" +
            "\t{\n" +
            "\t\tname: \"长安城广场\",\n" +
            "\t\ttext: \"南：长安城广场 ↓\"\n" +
            "\t})\n" +
            "},\n" +
            "{\n" +
            "\tname: \"时空隧道\",\n" +
            "\t//地图名称text: Array(\"在这里，你可以选择回到从前\",\n" +
            "\t\"北：集气门\",\n" +
            "\t\"东：玄武大街\"),\n" +
            "\t//描述判定npc: Array(),\n" +
            "\t//npcdirection: Array(//可去路径{\n" +
            "\t\tname: \"集气门\",\n" +
            "\t\ttext: \"北：集气门 ↑\"\n" +
            "\t},\n" +
            "\t{\n" +
            "\t\tname: \"玄武大街\",\n" +
            "\t\ttext: \"东：玄武大街 →\"\n" +
            "\t})\n" +
            "},\n" +
            "{\n" +
            "\tname: \"集气门\",\n" +
            "\t//地图名称text: Array(\"这是通往夺宝神殿的必经之路\",\n" +
            "\t\"北：夺宝神殿\",\n" +
            "\t\"南：时空隧道\"),\n" +
            "\t//描述判定npc: Array(),\n" +
            "\t//npcdirection: Array(//可去路径{\n" +
            "\t\tname: \"夺宝神殿\",\n" +
            "\t\ttext: \"北：夺宝神殿 ↑\"\n" +
            "\t},\n" +
            "\t{\n" +
            "\t\tname: \"时空隧道\",\n" +
            "\t\ttext: \"南：时空隧道 ↓\"\n" +
            "\t})\n" +
            "},\n" +
            "{\n" +
            "\tname: \"夺宝神殿\",\n" +
            "\t//地图名称text: Array(\"这里就是传说中的夺宝神殿\",\n" +
            "\t\"南：集气门\"),\n" +
            "\t//描述判定npc: Array(),\n" +
            "\t//npcdirection: Array(//可去路径{\n" +
            "\t\tname: \"集气门\",\n" +
            "\t\ttext: \"南：集气门 ↓\"\n" +
            "\t})\n" +
            "},\n" +
            "{\n" +
            "\tname: \"玄武北街\",\n" +
            "\t//地图名称text: Array(\"北：玄武门 ↑\",\n" +
            "\t\"西：长安药铺 ←\",\n" +
            "\t\"这里是玄武北街\"),\n" +
            "\t//描述判定npc: Array(\"游人\",\n" +
            "\t\"花花公子\"),\n" +
            "\t//npcdirection: Array(//可去路径{\n" +
            "\t\tname: \"长安客栈\",\n" +
            "\t\ttext: \"返回长安客栈\"\n" +
            "\t},\n" +
            "\t{\n" +
            "\t\tname: \"玄武门\",\n" +
            "\t\ttext: \"北：玄武门 ↑\"\n" +
            "\t},\n" +
            "\t{\n" +
            "\t\tname: \"长安药铺\",\n" +
            "\t\ttext: \"西：长安药铺 ←\"\n" +
            "\t},\n" +
            "\t{\n" +
            "\t\tname: \"长安铁匠铺\",\n" +
            "\t\ttext: \"东：长安铁匠铺 →\"\n" +
            "\t},\n" +
            "\t{\n" +
            "\t\tname: \"玄武大街\",\n" +
            "\t\ttext: \"南：玄武大街 ↓\"\n" +
            "\t})\n" +
            "},\n" +
            "{\n" +
            "\tname: \"长安药铺\",\n" +
            "\t//地图名称text: Array(\"这是一家药铺\",\n" +
            "\t\"一股浓浓的药味扑鼻而来\",\n" +
            "\t\"东：玄武北街 →\"),\n" +
            "\t//描述判定npc: Array(\"平一指\"),\n" +
            "\t//npcdirection: Array(//可去路径{\n" +
            "\t\tname: \"玄武北街\",\n" +
            "\t\ttext: \"东：玄武北街 →\"\n" +
            "\t})\n" +
            "},\n" +
            "{\n" +
            "\tname: \"长安铁匠铺\",\n" +
            "\t//地图名称text: Array(\"这里可以修理破损的装备\",\n" +
            "\t\"西：练武场 ←\"),\n" +
            "\t//描述判定npc: Array(\"铁匠\"),\n" +
            "\t//npcdirection: Array(//可去路径{\n" +
            "\t\tname: \"长安练武场\",\n" +
            "\t\ttext: \"西：练武场 ←\"\n" +
            "\t})\n" +
            "},\n" +
            "{\n" +
            "\tname: \"玄武门\",\n" +
            "\t//地图名称text: Array(\"这里是京城的北门\",\n" +
            "\t\"南：练武场 ↓\"),\n" +
            "\t//描述判定npc: Array(\"守城武将\",\n" +
            "\t\"守城小兵\"),\n" +
            "\t//npcdirection: Array(//可去路径{\n" +
            "\t\tname: \"长安北驿道[1]\",\n" +
            "\t\ttext: \"北：驿道 ↑\"\n" +
            "\t},\n" +
            "\t{\n" +
            "\t\tname: \"长安练武场\",\n" +
            "\t\ttext: \"南：练武场 ↓\"\n" +
            "\t})\n" +
            "},\n" +
            "{\n" +
            "\tname: \"长安北驿道[1]\",\n" +
            "\t//地图名称text: Array(\"北：渭水南岸 ↑\",\n" +
            "\t\"南：玄武门\"),\n" +
            "\t//描述判定npc: Array(\"地保\",\n" +
            "\t\"行人\",\n" +
            "\t\"游人\"),\n" +
            "\t//npcdirection: Array(//可去路径{\n" +
            "\t\tname: \"渭水南岸\",\n" +
            "\t\ttext: \"北：渭水南岸 ↑\"\n" +
            "\t},\n" +
            "\t{\n" +
            "\t\tname: \"长安北树林[1]\",\n" +
            "\t\ttext: \"东：树林 →\"\n" +
            "\t},\n" +
            "\t{\n" +
            "\t\tname: \"玄武门\",\n" +
            "\t\ttext: \"南：玄武门 ↓\"\n" +
            "\t})\n" +
            "},\n" +
            "{\n" +
            "\tname: \"长安北树林[1]\",\n" +
            "\t//地图名称text: Array(\"一片阴森的树林\",\n" +
            "\t\"北：树林深处 ↑\",\n" +
            "\t\"西：驿道 ←\"),\n" +
            "\t//描述判定npc: Array(\"看林老人\"),\n" +
            "\t//npcdirection: Array(//可去路径{\n" +
            "\t\tname: \"长安北树林深处\",\n" +
            "\t\ttext: \"北：树林深处 ↑\"\n" +
            "\t},\n" +
            "\t{\n" +
            "\t\tname: \"长安北驿道[1]\",\n" +
            "\t\ttext: \"西：驿道 ←\"\n" +
            "\t})\n" +
            "},\n" +
            "{\n" +
            "\tname: \"长安北树林深处\",\n" +
            "\t//地图名称text: Array(\"这里是树林深处\",\n" +
            "\t\"远处传来几声狼嗷\",\n" +
            "\t\"南：树林\"),\n" +
            "\t//描述判定npc: Array(\"灰狼\",\n" +
            "\t\"白狼\"),\n" +
            "\t//npcdirection: Array(//可去路径{\n" +
            "\t\tname: \"长安北树林[1]\",\n" +
            "\t\ttext: \"南：树林 ↓\"\n" +
            "\t})\n" +
            "},\n" +
            "{\n" +
            "\tname: \"渭水南岸\",\n" +
            "\t//地图名称text: Array(\"这里是渭水南岸\",\n" +
            "\t\"河面上来来往往的船只很多\",\n" +
            "\t\"南：驿道\"),\n" +
            "\t//描述判定npc: Array(\"游人\",\n" +
            "\t\"乞丐\",\n" +
            "\t\"艄公\"),\n" +
            "\t//npcdirection: Array(//可去路径{\n" +
            "\t\tname: \"长安北大道\",\n" +
            "\t\ttext: \"北：大道 ↑\"\n" +
            "\t},\n" +
            "\t{\n" +
            "\t\tname: \"长安北驿道[1]\",\n" +
            "\t\ttext: \"南：驿道 ↓\"\n" +
            "\t})\n" +
            "},\n" +
            "{\n" +
            "\tname: \"长安北大道\",\n" +
            "\t//地图名称text: Array(\"一条宽阔的大道\",\n" +
            "\t\"北：长安王王城 ↑\"),\n" +
            "\t//描述判定npc: Array(),\n" +
            "\t//npcdirection: Array(//可去路径{\n" +
            "\t\tname: \"长安王王城\",\n" +
            "\t\ttext: \"北：长安王王城 ↑\"\n" +
            "\t},\n" +
            "\t{\n" +
            "\t\tname: \"长安北大马路\",\n" +
            "\t\ttext: \"西：大马路 ←\"\n" +
            "\t},\n" +
            "\t{\n" +
            "\t\tname: \"渭水南岸\",\n" +
            "\t\ttext: \"南：渭水南岸 ↓\"\n" +
            "\t})\n" +
            "},\n" +
            "{\n" +
            "\tname: \"长安北大马路\",\n" +
            "\t//地图名称text: Array(\"一条宽广的大马路\",\n" +
            "\t\"东：大道 →\",\n" +
            "\t\"南：关内侯邸 ↓\"),\n" +
            "\t//描述判定npc: Array(\"机关人\"),\n" +
            "\t//npcdirection: Array(//可去路径{\n" +
            "\t\tname: \"长安北大道\",\n" +
            "\t\ttext: \"东：大道 →\"\n" +
            "\t},\n" +
            "\t{\n" +
            "\t\tname: \"关内侯邸\",\n" +
            "\t\ttext: \"南：关内侯邸 ↓\"\n" +
            "\t})\n" +
            "},\n" +
            "{\n" +
            "\tname: \"关内侯邸\",\n" +
            "\t//地图名称text: Array(\"这里是关内侯的宅邸\",\n" +
            "\t\"北：大马路 ↑\",\n" +
            "\t\"南：关内侯邸 ↓\"),\n" +
            "\t//描述判定npc: Array(\"家丁\"),\n" +
            "\t//npcdirection: Array(//可去路径{\n" +
            "\t\tname: \"长安北大马路\",\n" +
            "\t\ttext: \"北：大马路 ↑\"\n" +
            "\t},\n" +
            "\t{\n" +
            "\t\tname: \"关内侯家宅\",\n" +
            "\t\ttext: \"南：（大门紧闭）\"\n" +
            "\t})\n" +
            "},\n" +
            "{\n" +
            "\tname: \"长安王王城\",\n" +
            "\t//地图名称text: Array(\"这里就是长安王的王城了\",\n" +
            "\t\"北：王城大门 ↑\",\n" +
            "\t\"南：关内侯邸 ↓\"),\n" +
            "\t//描述判定npc: Array(\"王城侍卫\"),\n" +
            "\t//npcdirection: Array(//可去路径{\n" +
            "\t\tname: \"王城大门\",\n" +
            "\t\ttext: \"北：王城大门 ↑\"\n" +
            "\t},\n" +
            "\t{\n" +
            "\t\tname: \"长安北大道\",\n" +
            "\t\ttext: \"南：大道 ↓\"\n" +
            "\t})\n" +
            "},\n" +
            "{\n" +
            "\tname: \"王城大门\",\n" +
            "\t//地图名称text: Array(\"这里是王城大门\",\n" +
            "\t\"北：（大门紧闭）\",\n" +
            "\t\"南：长安王王城 ↓\"),\n" +
            "\t//描述判定npc: Array(\"初级铁人\",\n" +
            "\t\"中级铁人\",\n" +
            "\t\"高级铁人\"),\n" +
            "\t//npcdirection: Array(//可去路径{\n" +
            "\t\tname: \"王城大殿\",\n" +
            "\t\ttext: \"北：（大门紧闭）\"\n" +
            "\t},\n" +
            "\t{\n" +
            "\t\tname: \"西城墙下\",\n" +
            "\t\ttext: \"西：西城墙下 ←\"\n" +
            "\t},\n" +
            "\t{\n" +
            "\t\tname: \"东城墙下\",\n" +
            "\t\ttext: \"东：东城墙下 →\"\n" +
            "\t},\n" +
            "\t{\n" +
            "\t\tname: \"长安王王城\",\n" +
            "\t\ttext: \"南：长安王王城 ↓\"\n" +
            "\t})\n" +
            "},\n" +
            "{\n" +
            "\tname: \"西城墙下\",\n" +
            "\t//地图名称text: Array(\"王城大门的西段城墙脚下\",\n" +
            "\t\"东：王城大门 →\"),\n" +
            "\t//描述判定npc: Array(\"初级银人\",\n" +
            "\t\"中级银人\",\n" +
            "\t\"高级银人\"),\n" +
            "\t//npcdirection: Array(//可去路径{\n" +
            "\t\tname: \"王城大门\",\n" +
            "\t\ttext: \"东：王城大门 →\"\n" +
            "\t})\n" +
            "},\n" +
            "{\n" +
            "\tname: \"东城墙下\",\n" +
            "\t//地图名称text: Array(\"王城大门的东段城墙脚下\",\n" +
            "\t\"西：王城大门 ←\"),\n" +
            "\t//描述判定npc: Array(\"初级铜人\",\n" +
            "\t\"中级铜人\",\n" +
            "\t\"高级铜人\"),\n" +
            "\t//npcdirection: Array(//可去路径{\n" +
            "\t\tname: \"王城大门\",\n" +
            "\t\ttext: \"西：王城大门 ←\"\n" +
            "\t})\n" +
            "},\n" +
            "{\n" +
            "\tname: \"白虎大街\",\n" +
            "\t//地图名称text: Array(\"你走在一条宽阔的石板大街上\",\n" +
            "\t\"北：相记钱庄 ↑\",\n" +
            "\t\"南：阿绣当铺 ↓\"),\n" +
            "\t//描述判定npc: Array(\"守城小兵\",\n" +
            "\t\"花花公子\",\n" +
            "\t\"流氓头\",\n" +
            "\t\"流氓\"),\n" +
            "\t//npcdirection: Array(//可去路径{\n" +
            "\t\tname: \"相记钱庄\",\n" +
            "\t\ttext: \"北：相记钱庄 ↑\"\n" +
            "\t},\n" +
            "\t{\n" +
            "\t\tname: \"白虎门\",\n" +
            "\t\ttext: \"西：白虎门 ←\"\n" +
            "\t},\n" +
            "\t{\n" +
            "\t\tname: \"长安城广场\",\n" +
            "\t\ttext: \"东：长安城广场 →\"\n" +
            "\t},\n" +
            "\t{\n" +
            "\t\tname: \"阿绣当铺\",\n" +
            "\t\ttext: \"南：阿绣当铺 ↓\"\n" +
            "\t})\n" +
            "},\n" +
            "{\n" +
            "\tname: \"相记钱庄\",\n" +
            "\t//地图名称text: Array(\"这是一家老字号的钱庄\",\n" +
            "\t\"相老板是山西人\",\n" +
            "\t\"南：白虎大街\"),\n" +
            "\t//描述判定npc: Array(\"相国福\",\n" +
            "\t\"段延庆\"),\n" +
            "\t//npcdirection: Array(//可去路径{\n" +
            "\t\tname: \"白虎大街\",\n" +
            "\t\ttext: \"南：白虎大街 ↓\"\n" +
            "\t})\n" +
            "},\n" +
            "{\n" +
            "\tname: \"阿绣当铺\",\n" +
            "\t//地图名称text: Array(\"这是长安城里最大的一家当铺了\",\n" +
            "\t\"素来以买卖公平着称\",\n" +
            "\t\"北：白虎大街\"),\n" +
            "\t//描述判定npc: Array(\"阿绣\",\n" +
            "\t\"恶霸\"),\n" +
            "\t//npcdirection: Array(//可去路径{\n" +
            "\t\tname: \"白虎大街\",\n" +
            "\t\ttext: \"北：白虎大街 ↑\"\n" +
            "\t})\n" +
            "},\n" +
            "{\n" +
            "\tname: \"白虎门\",\n" +
            "\t//地图名称text: Array(\"这是京城的西门\",\n" +
            "\t\"西：驿道\",\n" +
            "\t\"东：白虎大街 →\"),\n" +
            "\t//描述判定npc: Array(\"守城武将\",\n" +
            "\t\"守城小兵\"),\n" +
            "\t//npcdirection: Array(//可去路径{\n" +
            "\t\tname: \"长安西驿道[1]\",\n" +
            "\t\ttext: \"西：驿道 ←\"\n" +
            "\t},\n" +
            "\t{\n" +
            "\t\tname: \"白虎大街\",\n" +
            "\t\ttext: \"东：白虎大街 →\"\n" +
            "\t})\n" +
            "},\n" +
            "{\n" +
            "\tname: \"长安西驿道[1]\",\n" +
            "\t//地图名称text: Array(\"西：咸阳\",\n" +
            "\t\"东：白虎门\",\n" +
            "\t\"南：山路 ↓\"),\n" +
            "\t//描述判定npc: Array(\"蒙面人\"),\n" +
            "\t//npcdirection: Array(//可去路径{\n" +
            "\t\tname: \"咸阳\",\n" +
            "\t\ttext: \"西：咸阳 ←\"\n" +
            "\t},\n" +
            "\t{\n" +
            "\t\tname: \"白虎门\",\n" +
            "\t\ttext: \"东：白虎门 →\"\n" +
            "\t},\n" +
            "\t{\n" +
            "\t\tname: \"长安西山路[1]\",\n" +
            "\t\ttext: \"南：山路 ↓\"\n" +
            "\t})\n" +
            "},\n" +
            "{\n" +
            "\tname: \"长安西山路[1]\",\n" +
            "\t//地图名称text: Array(\"你走在一条山路上\",\n" +
            "\t\"北：驿道\",\n" +
            "\t\"南：山路\"),\n" +
            "\t//描述判定npc: Array(\"游人\"),\n" +
            "\t//npcdirection: Array(//可去路径{\n" +
            "\t\tname: \"长安西驿道[1]\",\n" +
            "\t\ttext: \"北：驿道 ↑\"\n" +
            "\t},\n" +
            "\t{\n" +
            "\t\tname: \"长安西山路[2]\",\n" +
            "\t\ttext: \"南：山路 ↓\"\n" +
            "\t})\n" +
            "},\n" +
            "{\n" +
            "\tname: \"长安西山路[2]\",\n" +
            "\t//地图名称text: Array(\"山路旁美景不断\",\n" +
            "\t\"北：山路\",\n" +
            "\t\"南：山顶 ↓\"),\n" +
            "\t//描述判定npc: Array(\"春游女孩\",\n" +
            "\t\"游人\"),\n" +
            "\t//npcdirection: Array(//可去路径{\n" +
            "\t\tname: \"长安西山路[1]\",\n" +
            "\t\ttext: \"北：山路 ↑\"\n" +
            "\t},\n" +
            "\t{\n" +
            "\t\tname: \"长安西山顶\",\n" +
            "\t\ttext: \"南：山顶 ↓\"\n" +
            "\t})\n" +
            "},\n" +
            "{\n" +
            "\tname: \"长安西山顶\",\n" +
            "\t//地图名称text: Array(\"你来到了山顶，一阵山风吹来\",\n" +
            "\t\"你顿时觉得心旷神怡\",\n" +
            "\t\"北：山路\"),\n" +
            "\t//描述判定npc: Array(\"道人\",\n" +
            "\t\"游人\"),\n" +
            "\t//npcdirection: Array(//可去路径{\n" +
            "\t\tname: \"长安西山路[2]\",\n" +
            "\t\ttext: \"北：山路 ↑\"\n" +
            "\t})\n" +
            "},\n" +
            "{\n" +
            "\tname: \"咸阳\",\n" +
            "\t//地图名称text: Array(\"这里是古都咸阳\",\n" +
            "\t\"如今只剩下残垣断壁\",\n" +
            "\t\"西：临洮 ←\"),\n" +
            "\t//描述判定npc: Array(\"蓑笠客\"),\n" +
            "\t//npcdirection: Array(//可去路径{\n" +
            "\t\tname: \"临洮\",\n" +
            "\t\ttext: \"西：临洮 ←\"\n" +
            "\t},\n" +
            "\t{\n" +
            "\t\tname: \"长安西驿道[1]\",\n" +
            "\t\ttext: \"东：驿道 →\"\n" +
            "\t})\n" +
            "},\n" +
            "{\n" +
            "\tname: \"临洮\",\n" +
            "\t//地图名称text: Array(\"一条驿道静静的向远方延伸\",\n" +
            "\t\"北：出塞古道 ↑\",\n" +
            "\t\"东：咸阳 →\"),\n" +
            "\t//描述判定npc: Array(),\n" +
            "\t//npcdirection: Array(//可去路径{\n" +
            "\t\tname: \"出塞古道[1]\",\n" +
            "\t\ttext: \"北：出塞古道 ↑\"\n" +
            "\t},\n" +
            "\t{\n" +
            "\t\tname: \"咸阳西驿道\",\n" +
            "\t\ttext: \"西：驿道 ←\"\n" +
            "\t},\n" +
            "\t{\n" +
            "\t\tname: \"咸阳\",\n" +
            "\t\ttext: \"东：咸阳 →\"\n" +
            "\t})\n" +
            "},\n" +
            "{\n" +
            "\tname: \"出塞古道[1]\",\n" +
            "\t//地图名称text: Array(\"一条通往塞外的古道\",\n" +
            "\t\"北：出塞古道 ↑\",\n" +
            "\t\"南：临洮 ↓\"),\n" +
            "\t//描述判定npc: Array(),\n" +
            "\t//npcdirection: Array(//可去路径{\n" +
            "\t\tname: \"出塞古道[2]\",\n" +
            "\t\ttext: \"北：出塞古道 ↑\"\n" +
            "\t},\n" +
            "\t{\n" +
            "\t\tname: \"临洮\",\n" +
            "\t\ttext: \"南：临洮 ↓\"\n" +
            "\t})\n" +
            "},\n" +
            "{\n" +
            "\tname: \"出塞古道[2]\",\n" +
            "\t//地图名称text: Array(\"一条通往塞外的古道\",\n" +
            "\t\"北：银川 ↑\",\n" +
            "\t\"南：出塞古道 ↓\"),\n" +
            "\t//描述判定npc: Array(),\n" +
            "\t//npcdirection: Array(//可去路径{\n" +
            "\t\tname: \"银川\",\n" +
            "\t\ttext: \"北：银川 ↑\"\n" +
            "\t},\n" +
            "\t{\n" +
            "\t\tname: \"出塞古道[1]\",\n" +
            "\t\ttext: \"南：出塞古道 ↓\"\n" +
            "\t})\n" +
            "},\n" +
            "{\n" +
            "\tname: \"银川\",\n" +
            "\t//地图名称text: Array(\"这里就是银川了\",\n" +
            "\t\"西：西夏皇宫 ←\",\n" +
            "\t\"北：塞外古道 ↑\",\n" +
            "\t\"南：出塞古道 ↓\"),\n" +
            "\t//描述判定npc: Array(),\n" +
            "\t//npcdirection: Array(//可去路径{\n" +
            "\t\tname: \"塞外古道\",\n" +
            "\t\ttext: \"北：塞外古道 ↑\"\n" +
            "\t},\n" +
            "\t{\n" +
            "\t\tname: \"西夏皇宫\",\n" +
            "\t\ttext: \"西：西夏皇宫 ←\"\n" +
            "\t},\n" +
            "\t{\n" +
            "\t\tname: \"出塞古道[2]\",\n" +
            "\t\ttext: \"南：出塞古道 ↓\"\n" +
            "\t})\n" +
            "},\n" +
            "{\n" +
            "\tname: \"西夏皇宫\",\n" +
            "\t//地图名称text: Array(\"这里是西夏皇宫\",\n" +
            "\t\"北：皇宫北廊 ↑\",\n" +
            "\t\"西：西夏后宫 ←\",\n" +
            "\t\"东：银川 →\"),\n" +
            "\t//描述判定npc: Array(\"一等一品堂高手\",\n" +
            "\t\"二等一品堂高手\",\n" +
            "\t\"三等一品堂高手\"),\n" +
            "\t//npcdirection: Array(//可去路径{\n" +
            "\t\tname: \"皇宫北廊\",\n" +
            "\t\ttext: \"北：皇宫北廊 ↑\"\n" +
            "\t},\n" +
            "\t{\n" +
            "\t\tname: \"西夏后宫\",\n" +
            "\t\ttext: \"西：西夏后宫 ←\"\n" +
            "\t},\n" +
            "\t{\n" +
            "\t\tname: \"银川\",\n" +
            "\t\ttext: \"东：银川 →\"\n" +
            "\t},\n" +
            "\t{\n" +
            "\t\tname: \"皇宫南廊\",\n" +
            "\t\ttext: \"南：皇宫南廊 ↓\"\n" +
            "\t})\n" +
            "},\n" +
            "{\n" +
            "\tname: \"皇宫北廊\",\n" +
            "\t//地图名称text: Array(\"皇宫北部一处长长的走廊\",\n" +
            "\t\"南：西夏皇宫 ↓\"),\n" +
            "\t//描述判定npc: Array(\"一等御前侍卫\",\n" +
            "\t\"二等御前侍卫\",\n" +
            "\t\"三等御前侍卫\"),\n" +
            "\t//npcdirection: Array(//可去路径{\n" +
            "\t\tname: \"西夏皇宫\",\n" +
            "\t\ttext: \"南：西夏皇宫 ↓\"\n" +
            "\t})\n" +
            "},\n" +
            "{\n" +
            "\tname: \"西夏后宫\",\n" +
            "\t//地图名称text: Array(\"这里是西夏后宫\",\n" +
            "\t\"东：西夏皇宫 →\"),\n" +
            "\t//描述判定npc: Array(\"天山童姥\",\n" +
            "\t\"李秋水\",\n" +
            "\t\"李沧海\"),\n" +
            "\t//npcdirection: Array(//可去路径{\n" +
            "\t\tname: \"西夏皇宫\",\n" +
            "\t\ttext: \"东：西夏皇宫 →\"\n" +
            "\t})\n" +
            "},\n" +
            "{\n" +
            "\tname: \"皇宫南廊\",\n" +
            "\t//地图名称text: Array(\"皇宫南部一处长长的走廊\",\n" +
            "\t\"北：西夏皇宫 ↑\"),\n" +
            "\t//描述判定npc: Array(\"一等御前侍卫\",\n" +
            "\t\"二等御前侍卫\",\n" +
            "\t\"三等御前侍卫\"),\n" +
            "\t//npcdirection: Array(//可去路径{\n" +
            "\t\tname: \"西夏皇宫\",\n" +
            "\t\ttext: \"北：西夏皇宫 ↑\"\n" +
            "\t})\n" +
            "},\n" +
            "{\n" +
            "\tname: \"塞外古道\",\n" +
            "\t//地图名称text: Array(\"这里已经是塞外的\",\n" +
            "\t\"一条古道静静地通向远方\"),\n" +
            "\t//描述判定npc: Array(\"天山童姥\",\n" +
            "\t\"李秋水\",\n" +
            "\t\"李沧海\"),\n" +
            "\t//npcdirection: Array(//可去路径{\n" +
            "\t\tname: \"草原[1]\",\n" +
            "\t\ttext: \"北：草原 ↑\"\n" +
            "\t},\n" +
            "\t{\n" +
            "\t\tname: \"银川\",\n" +
            "\t\ttext: \"南：银川 ↓\"\n" +
            "\t})\n" +
            "},\n" +
            "{\n" +
            "\tname: \"草原[1]\",\n" +
            "\t//地图名称text: Array(\"这里是塞外，一望无际的大草原\",\n" +
            "\t\"北：沙漠 ↑\",\n" +
            "\t\"南：塞外古道 ↓\"),\n" +
            "\t//描述判定npc: Array(\"张丹枫\",\n" +
            "\t\"云蕾\"),\n" +
            "\t//npcdirection: Array(//可去路径{\n" +
            "\t\tname: \"沙漠[1]\",\n" +
            "\t\ttext: \"北：沙漠 ↑\"\n" +
            "\t},\n" +
            "\t{\n" +
            "\t\tname: \"草原[2]\",\n" +
            "\t\ttext: \"西：草原 ←\"\n" +
            "\t},\n" +
            "\t{\n" +
            "\t\tname: \"草原[3]\",\n" +
            "\t\ttext: \"东：草原 →\"\n" +
            "\t},\n" +
            "\t{\n" +
            "\t\tname: \"塞外古道\",\n" +
            "\t\ttext: \"南：塞外古道 ↓\"\n" +
            "\t})\n" +
            "},\n" +
            "{\n" +
            "\tname: \"草原[2]\",\n" +
            "\t//地图名称text: Array(\"这里是塞外，一望无际的大草原\",\n" +
            "\t\"东：草原 →\"),\n" +
            "\t//描述判定npc: Array(),\n" +
            "\t//npcdirection: Array(//可去路径{\n" +
            "\t\tname: \"草原[1]\",\n" +
            "\t\ttext: \"东：草原 →\"\n" +
            "\t})\n" +
            "},\n" +
            "{\n" +
            "\tname: \"草原[3]\",\n" +
            "\t//地图名称text: Array(\"这里是塞外，一望无际的大草原\",\n" +
            "\t\"西：草原 ←\"),\n" +
            "\t//描述判定npc: Array(),\n" +
            "\t//npcdirection: Array(//可去路径{\n" +
            "\t\tname: \"草原[1]\",\n" +
            "\t\ttext: \"西：草原 ←\"\n" +
            "\t})\n" +
            "},\n" +
            "{\n" +
            "\tname: \"沙漠[1]\",\n" +
            "\t//地图名称text: Array(\"这里是漠北，无边无际的沙漠连绵不绝\",\n" +
            "\t\"北：沙漠 ↑\",\n" +
            "\t\"南：草原 ↓\"),\n" +
            "\t//描述判定npc: Array(\"孟华\",\n" +
            "\t\"齐世杰\",\n" +
            "\t\"宇文雷\",\n" +
            "\t\"杨炎\"),\n" +
            "\t//npcdirection: Array(//可去路径{\n" +
            "\t\tname: \"沙漠[2]\",\n" +
            "\t\ttext: \"北：沙漠 ↑\"\n" +
            "\t},\n" +
            "\t{\n" +
            "\t\tname: \"沙漠[3]\",\n" +
            "\t\ttext: \"西：沙漠 ←\"\n" +
            "\t},\n" +
            "\t{\n" +
            "\t\tname: \"沙漠[4]\",\n" +
            "\t\ttext: \"东：沙漠 →\"\n" +
            "\t},\n" +
            "\t{\n" +
            "\t\tname: \"草原[1]\",\n" +
            "\t\ttext: \"南：草原 ↓\"\n" +
            "\t})\n" +
            "},\n" +
            "{\n" +
            "\tname: \"沙漠[2]\",\n" +
            "\t//地图名称text: Array(\"这里是漠北，无边无际的沙漠连绵不绝\",\n" +
            "\t\"南：沙漠 ↓\"),\n" +
            "\t//描述判定npc: Array(\"三等怯薛军精锐\"),\n" +
            "\t//npcdirection: Array(//可去路径{\n" +
            "\t\tname: \"沙漠[1]\",\n" +
            "\t\ttext: \"南：沙漠 ↓\"\n" +
            "\t})\n" +
            "},\n" +
            "{\n" +
            "\tname: \"沙漠[3]\",\n" +
            "\t//地图名称text: Array(\"这里是漠北，无边无际的沙漠连绵不绝\",\n" +
            "\t\"东：沙漠 →\"),\n" +
            "\t//描述判定npc: Array(\"一等怯薛军精锐\"),\n" +
            "\t//npcdirection: Array(//可去路径{\n" +
            "\t\tname: \"沙漠[1]\",\n" +
            "\t\ttext: \"东：沙漠 →\"\n" +
            "\t})\n" +
            "},\n" +
            "{\n" +
            "\tname: \"沙漠[4]\",\n" +
            "\t//地图名称text: Array(\"这里是漠北，无边无际的沙漠连绵不绝\",\n" +
            "\t\"西：沙漠 ←\"),\n" +
            "\t//描述判定npc: Array(\"二等怯薛军精锐\"),\n" +
            "\t//npcdirection: Array(//可去路径{\n" +
            "\t\tname: \"沙漠[1]\",\n" +
            "\t\ttext: \"西：沙漠 ←\"\n" +
            "\t})\n" +
            "},\n" +
            "{\n" +
            "\tname: \"咸阳西驿道\",\n" +
            "\t//地图名称text: Array(\"西：兰州街道\",\n" +
            "\t\"东：临洮 →\"),\n" +
            "\t//描述判定npc: Array(),\n" +
            "\t//npcdirection: Array(//可去路径{\n" +
            "\t\tname: \"兰州街道[1]\",\n" +
            "\t\ttext: \"西：兰州街道 ←\"\n" +
            "\t},\n" +
            "\t{\n" +
            "\t\tname: \"临洮\",\n" +
            "\t\ttext: \"东：临洮 →\"\n" +
            "\t})\n" +
            "},\n" +
            "{\n" +
            "\tname: \"兰州街道[1]\",\n" +
            "\t//地图名称text: Array(\"这里是十字路口的东侧\",\n" +
            "\t\"北：怡红院\",\n" +
            "\t\"南：钱庄\"),\n" +
            "\t//描述判定npc: Array(\"阿紫\"),\n" +
            "\t//npcdirection: Array(//可去路径{\n" +
            "\t\tname: \"兰州怡红院\",\n" +
            "\t\ttext: \"北：怡红院 ↑\"\n" +
            "\t},\n" +
            "\t{\n" +
            "\t\tname: \"兰州十字路口\",\n" +
            "\t\ttext: \"西：十字路口 ←\"\n" +
            "\t},\n" +
            "\t{\n" +
            "\t\tname: \"咸阳西驿道[2]\",\n" +
            "\t\ttext: \"东：驿道 →\"\n" +
            "\t},\n" +
            "\t{\n" +
            "\t\tname: \"兰州钱庄\",\n" +
            "\t\ttext: \"南：钱庄 ↓\"\n" +
            "\t})\n" +
            "},\n" +
            "{\n" +
            "\tname: \"兰州怡红院\",\n" +
            "\t//地图名称text: Array(\"这是怡红院的姑娘们陪客人们饮酒品茗\",\n" +
            "\t\"吟诗作赋的地方，甚是幽雅\",\n" +
            "\t\"南：兰州街道\"),\n" +
            "\t//描述判定npc: Array(),\n" +
            "\t//npcdirection: Array(//可去路径{\n" +
            "\t\tname: \"兰州街道[1]\",\n" +
            "\t\ttext: \"南：兰州街道 ↓\"\n" +
            "\t})\n" +
            "},\n" +
            "{\n" +
            "\tname: \"兰州钱庄\",\n" +
            "\t//地图名称text: Array(\"一家简陋的钱庄\",\n" +
            "\t\"在这里打劫真是再好不过了\",\n" +
            "\t\"北：兰州街道\"),\n" +
            "\t//描述判定npc: Array(\"教众\"),\n" +
            "\t//npcdirection: Array(//可去路径{\n" +
            "\t\tname: \"兰州街道[1]\",\n" +
            "\t\ttext: \"北：兰州街道 ↑\"\n" +
            "\t})\n" +
            "},\n" +
            "{\n" +
            "\tname: \"兰州十字路口\",\n" +
            "\t//地图名称text: Array(\"兰州镇的两条青石路在这里交叉\",\n" +
            "\t\"北：南市场\",\n" +
            "\t\"东：兰州街道\"),\n" +
            "\t//描述判定npc: Array(\"教众\"),\n" +
            "\t//npcdirection: Array(//可去路径{\n" +
            "\t\tname: \"兰州南市场\",\n" +
            "\t\ttext: \"北：南市场 ↑\"\n" +
            "\t},\n" +
            "\t{\n" +
            "\t\tname: \"兰州街道[2]\",\n" +
            "\t\ttext: \"西：街道 ←\"\n" +
            "\t},\n" +
            "\t{\n" +
            "\t\tname: \"兰州街道[1]\",\n" +
            "\t\ttext: \"东：兰州街道 →\"\n" +
            "\t},\n" +
            "\t{\n" +
            "\t\tname: \"兰州街道[3]\",\n" +
            "\t\ttext: \"南：街道 ↓\"\n" +
            "\t})\n" +
            "},\n" +
            "{\n" +
            "\tname: \"兰州南市场\",\n" +
            "\t//地图名称text: Array(\"这里是兰州镇的南市场\",\n" +
            "\t\"西面是杂货铺\",\n" +
            "\t\"南：十字路口\"),\n" +
            "\t//描述判定npc: Array(\"掌旗手\"),\n" +
            "\t//npcdirection: Array(//可去路径{\n" +
            "\t\tname: \"北市场\",\n" +
            "\t\ttext: \"北：北市场 ↑\"\n" +
            "\t},\n" +
            "\t{\n" +
            "\t\tname: \"兰州杂货铺\",\n" +
            "\t\ttext: \"西：杂货铺 ←\"\n" +
            "\t},\n" +
            "\t{\n" +
            "\t\tname: \"兰州十字路口\",\n" +
            "\t\ttext: \"南：十字路口 ↓\"\n" +
            "\t})\n" +
            "},\n" +
            "{\n" +
            "\tname: \"兰州杂货铺\",\n" +
            "\t//地图名称text: Array(\"你现在正站在杂货铺里\",\n" +
            "\t\"靠近门口的地方有一块乌木雕成的招牌\",\n" +
            "\t\"东：南市场\"),\n" +
            "\t//描述判定npc: Array(\"天山派弟子梦玉楼\"),\n" +
            "\t//npcdirection: Array(//可去路径{\n" +
            "\t\tname: \"兰州南市场\",\n" +
            "\t\ttext: \"东：南市场 →\"\n" +
            "\t})\n" +
            "},\n" +
            "{\n" +
            "\tname: \"北市场\",\n" +
            "\t//地图名称text: Array(\"这里是兰州镇的北市场\",\n" +
            "\t\"北：黑松堡乡间小路 ↑\",\n" +
            "\t\"东：当铺 →\"),\n" +
            "\t//描述判定npc: Array(\"教众\"),\n" +
            "\t//npcdirection: Array(//可去路径{\n" +
            "\t\tname: \"黑松堡乡间小路[1]\",\n" +
            "\t\ttext: \"北：黑松堡乡间小路 ↑\"\n" +
            "\t},\n" +
            "\t{\n" +
            "\t\tname: \"兰州当铺\",\n" +
            "\t\ttext: \"东：当铺 →\"\n" +
            "\t},\n" +
            "\t{\n" +
            "\t\tname: \"兰州南市场\",\n" +
            "\t\ttext: \"南：南市场 ↓\"\n" +
            "\t})\n" +
            "},\n" +
            "{\n" +
            "\tname: \"兰州当铺\",\n" +
            "\t//地图名称text: Array(\"一家当铺，生意显得有点冷清\",\n" +
            "\t\"西：北市场 ←\"),\n" +
            "\t//描述判定npc: Array(\"令狐霄\"),\n" +
            "\t//npcdirection: Array(//可去路径{\n" +
            "\t\tname: \"北市场\",\n" +
            "\t\ttext: \"西：北市场 ←\"\n" +
            "\t})\n" +
            "},\n" +
            "{\n" +
            "\tname: \"黑松堡乡间小路[1]\",\n" +
            "\t//地图名称text: Array(\"这是一条从小镇通出来的黄土小路\",\n" +
            "\t\"北：乡间小路 ↑\",\n" +
            "\t\"南：北市场 ↓\"),\n" +
            "\t//描述判定npc: Array(\"卖花小姑娘\"),\n" +
            "\t//npcdirection: Array(//可去路径{\n" +
            "\t\tname: \"黑松堡乡间小路[2]\",\n" +
            "\t\ttext: \"北：乡间小路 ↑\"\n" +
            "\t},\n" +
            "\t{\n" +
            "\t\tname: \"北市场\",\n" +
            "\t\ttext: \"南：北市场 ↓\"\n" +
            "\t})\n" +
            "},\n" +
            "{\n" +
            "\tname: \"黑松堡乡间小路[2]\",\n" +
            "\t//地图名称text: Array(\"这是一条从小镇通出来的黄土小路\",\n" +
            "\t\"北：三叉路口 ↑\",\n" +
            "\t\"南：黑松堡乡间小路 ↓\"),\n" +
            "\t//描述判定npc: Array(),\n" +
            "\t//npcdirection: Array(//可去路径{\n" +
            "\t\tname: \"黑松堡三叉路口\",\n" +
            "\t\ttext: \"北：三叉路口 ↑\"\n" +
            "\t},\n" +
            "\t{\n" +
            "\t\tname: \"黑松堡乡间小路[1]\",\n" +
            "\t\ttext: \"南：黑松堡乡间小路 ↓\"\n" +
            "\t})\n" +
            "},\n" +
            "{\n" +
            "\tname: \"黑松堡三叉路口\",\n" +
            "\t//地图名称text: Array(\"东北方向是一个小小的住家\",\n" +
            "\t\"北：山脚乡田 ↑\",\n" +
            "\t\"东：青石小路 →\"),\n" +
            "\t//描述判定npc: Array(),\n" +
            "\t//npcdirection: Array(//可去路径{\n" +
            "\t\tname: \"黑松山脚乡田\",\n" +
            "\t\ttext: \"北：山脚乡田 ↑\"\n" +
            "\t},\n" +
            "\t{\n" +
            "\t\tname: \"黑松青石小路\",\n" +
            "\t\ttext: \"东：青石小路 →\"\n" +
            "\t},\n" +
            "\t{\n" +
            "\t\tname: \"黑松堡乡间小路[2]\",\n" +
            "\t\ttext: \"南：乡间小路 ↓\"\n" +
            "\t})\n" +
            "},\n" +
            "{\n" +
            "\tname: \"黑松青石小路\",\n" +
            "\t//地图名称text: Array(\"小屋就在你的东北方向\",\n" +
            "\t\"北：翠绿小草坪 ↑\",\n" +
            "\t\"西：三叉路口 ←\"),\n" +
            "\t//描述判定npc: Array(),\n" +
            "\t//npcdirection: Array(//可去路径{\n" +
            "\t\tname: \"翠绿小草坪\",\n" +
            "\t\ttext: \"北：翠绿小草坪 ↑\"\n" +
            "\t},\n" +
            "\t{\n" +
            "\t\tname: \"黑松堡三叉路口\",\n" +
            "\t\ttext: \"西：三叉路口 ←\"\n" +
            "\t})\n" +
            "},\n" +
            "{\n" +
            "\tname: \"翠绿小草坪\",\n" +
            "\t//地图名称text: Array(\"小草坪修剪的很整齐\",\n" +
            "\t\"东：刘家小房 →\",\n" +
            "\t\"南：青石小路 ↓\"),\n" +
            "\t//描述判定npc: Array(),\n" +
            "\t//npcdirection: Array(//可去路径{\n" +
            "\t\tname: \"刘家小房\",\n" +
            "\t\ttext: \"东：刘家小房 →\"\n" +
            "\t},\n" +
            "\t{\n" +
            "\t\tname: \"黑松青石小路\",\n" +
            "\t\ttext: \"南：青石小路 ↓\"\n" +
            "\t})\n" +
            "},\n" +
            "{\n" +
            "\tname: \"刘家小房\",\n" +
            "\t//地图名称text: Array(\"木屋的后面是一个精巧的花园\",\n" +
            "\t\"北：花园 ↑\",\n" +
            "\t\"西：翠绿小草坪 ←\"),\n" +
            "\t//描述判定npc: Array(),\n" +
            "\t//npcdirection: Array(//可去路径{\n" +
            "\t\tname: \"刘家花园\",\n" +
            "\t\ttext: \"北：花园 ↑\"\n" +
            "\t},\n" +
            "\t{\n" +
            "\t\tname: \"翠绿小草坪\",\n" +
            "\t\ttext: \"西：翠绿小草坪 ←\"\n" +
            "\t},\n" +
            "\t{\n" +
            "\t\tname: \"刘家厨房\",\n" +
            "\t\ttext: \"南：厨房 ↓\"\n" +
            "\t})\n" +
            "},\n" +
            "{\n" +
            "\tname: \"刘家花园\",\n" +
            "\t//地图名称text: Array(\"这是刘老汉的小花园\",\n" +
            "\t\"有很多人在剪花\",\n" +
            "\t\"南：刘家小房 ↓\"),\n" +
            "\t//描述判定npc: Array(),\n" +
            "\t//npcdirection: Array(//可去路径{\n" +
            "\t\tname: \"刘家小房\",\n" +
            "\t\ttext: \"南：刘家小房 ↓\"\n" +
            "\t})\n" +
            "},\n" +
            "{\n" +
            "\tname: \"刘家厨房\",\n" +
            "\t//地图名称text: Array(\"这是一个简陋的小厨房\",\n" +
            "\t\"墙上挂满了风干了的卤肉\",\n" +
            "\t\"北：刘家小房 ↑\"),\n" +
            "\t//描述判定npc: Array(\"采花妞\"),\n" +
            "\t//npcdirection: Array(//可去路径{\n" +
            "\t\tname: \"刘家小房\",\n" +
            "\t\ttext: \"北：刘家小房 ↑\"\n" +
            "\t})\n" +
            "},\n" +
            "{\n" +
            "\tname: \"黑松山脚乡田\",\n" +
            "\t//地图名称text: Array(\"你的两侧是茂盛的稻田\",\n" +
            "\t\"北：黑松山脚 ↑\",\n" +
            "\t\"南：三叉路口 ↓\"),\n" +
            "\t//描述判定npc: Array(),\n" +
            "\t//npcdirection: Array(//可去路径{\n" +
            "\t\tname: \"黑松山脚\",\n" +
            "\t\ttext: \"北：黑松山脚 ↑\"\n" +
            "\t},\n" +
            "\t{\n" +
            "\t\tname: \"黑松堡三叉路口\",\n" +
            "\t\ttext: \"南：三叉路口 ↓\"\n" +
            "\t})\n" +
            "},\n" +
            "{\n" +
            "\tname: \"黑松山脚\",\n" +
            "\t//地图名称text: Array(\"一座高而险的山峰耸立在你面前\",\n" +
            "\t\"北：黑松山 ↑\",\n" +
            "\t\"南：山脚乡田 ↓\"),\n" +
            "\t//描述判定npc: Array(\"刘老农\"),\n" +
            "\t//npcdirection: Array(//可去路径{\n" +
            "\t\tname: \"黑松山\",\n" +
            "\t\ttext: \"北：黑松山 ↑\"\n" +
            "\t},\n" +
            "\t{\n" +
            "\t\tname: \"黑松山脚乡田\",\n" +
            "\t\ttext: \"南：山脚乡田 ↓\"\n" +
            "\t})\n" +
            "},\n" +
            "{\n" +
            "\tname: \"黑松山\",\n" +
            "\t//地图名称text: Array(\"小路向着东边不断的伸展\",\n" +
            "\t\"东：黑松山腰 →\",\n" +
            "\t\"南：黑松山脚 ↓\"),\n" +
            "\t//描述判定npc: Array(\"青衣家丁\"),\n" +
            "\t//npcdirection: Array(//可去路径{\n" +
            "\t\tname: \"黑松山腰\",\n" +
            "\t\ttext: \"东：黑松山腰 →\"\n" +
            "\t},\n" +
            "\t{\n" +
            "\t\tname: \"黑松山脚\",\n" +
            "\t\ttext: \"南：黑松山脚 ↓\"\n" +
            "\t})\n" +
            "},\n" +
            "{\n" +
            "\tname: \"黑松山腰\",\n" +
            "\t//地图名称text: Array(\"你正在艰难的走在唯一通往山顶的小路上\",\n" +
            "\t\"北：黑松山顶 ↑\",\n" +
            "\t\"西：黑松山 ←\"),\n" +
            "\t//描述判定npc: Array(),\n" +
            "\t//npcdirection: Array(//可去路径{\n" +
            "\t\tname: \"黑松山顶\",\n" +
            "\t\ttext: \"北：黑松山顶 ↑\"\n" +
            "\t},\n" +
            "\t{\n" +
            "\t\tname: \"黑松山\",\n" +
            "\t\ttext: \"西：黑松山 ←\"\n" +
            "\t})\n" +
            "},\n" +
            "{\n" +
            "\tname: \"黑松山顶\",\n" +
            "\t//地图名称text: Array(\"你依稀的看到乡村里的袅袅炊烟\",\n" +
            "\t\"东：铁索桥 →\",\n" +
            "\t\"南：黑松山腰 ↓\"),\n" +
            "\t//描述判定npc: Array(\"蓝衣家丁\"),\n" +
            "\t//npcdirection: Array(//可去路径{\n" +
            "\t\tname: \"黑松铁索桥\",\n" +
            "\t\ttext: \"东：铁索桥 →\"\n" +
            "\t},\n" +
            "\t{\n" +
            "\t\tname: \"黑松山腰\",\n" +
            "\t\ttext: \"南：黑松山腰 ↓\"\n" +
            "\t})\n" +
            "},\n" +
            "{\n" +
            "\tname: \"黑松铁索桥\",\n" +
            "\t//地图名称text: Array(\"山顶强劲的风吹得铁索桥左右晃动\",\n" +
            "\t\"西：黑松山顶 ←\",\n" +
            "\t\"东：花岗石街 →\"),\n" +
            "\t//描述判定npc: Array(\"紫衣家丁\"),\n" +
            "\t//npcdirection: Array(//可去路径{\n" +
            "\t\tname: \"黑松山顶\",\n" +
            "\t\ttext: \"西：黑松山顶 ←\"\n" +
            "\t},\n" +
            "\t{\n" +
            "\t\tname: \"黑松花岗石街\",\n" +
            "\t\ttext: \"东：花岗石街 →\"\n" +
            "\t})\n" +
            "},\n" +
            "{\n" +
            "\tname: \"黑松花岗石街\",\n" +
            "\t//地图名称text: Array(\"这是通往城堡的石街\",\n" +
            "\t\"北：黑松淳于 ↑\",\n" +
            "\t\"西：铁索桥 ←\"),\n" +
            "\t//描述判定npc: Array(),\n" +
            "\t//npcdirection: Array(//可去路径{\n" +
            "\t\tname: \"黑松淳于\",\n" +
            "\t\ttext: \"北：黑松淳于 ↑\"\n" +
            "\t},\n" +
            "\t{\n" +
            "\t\tname: \"黑松铁索桥\",\n" +
            "\t\ttext: \"西：铁索桥 ←\"\n" +
            "\t})\n" +
            "},\n" +
            "{\n" +
            "\tname: \"黑松淳于\",\n" +
            "\t//地图名称text: Array(\"你站立在一座宏伟的城堡之前\",\n" +
            "\t\"西：黑松堡西侧 ←\",\n" +
            "\t\"东：黑松堡东侧 →\"),\n" +
            "\t//描述判定npc: Array(),\n" +
            "\t//npcdirection: Array(//可去路径{\n" +
            "\t\tname: \"黑松堡西侧\",\n" +
            "\t\ttext: \"西：黑松堡西侧 ←\"\n" +
            "\t},\n" +
            "\t{\n" +
            "\t\tname: \"黑松堡东侧\",\n" +
            "\t\ttext: \"东：黑松堡东侧 →\"\n" +
            "\t},\n" +
            "\t{\n" +
            "\t\tname: \"黑松花岗石街\",\n" +
            "\t\ttext: \"南：花岗石街 ↓\"\n" +
            "\t})\n" +
            "},\n" +
            "{\n" +
            "\tname: \"黑松堡西侧\",\n" +
            "\t//地图名称text: Array(\"黑松城堡的西侧\",\n" +
            "\t\"北：卧室 ↑\",\n" +
            "\t\"东：黑松淳于 →\"),\n" +
            "\t//描述判定npc: Array(),\n" +
            "\t//npcdirection: Array(//可去路径{\n" +
            "\t\tname: \"黑松卧室\",\n" +
            "\t\ttext: \"北：卧室 ↑\"\n" +
            "\t},\n" +
            "\t{\n" +
            "\t\tname: \"黑松淳于\",\n" +
            "\t\ttext: \"东：黑松淳于 →\"\n" +
            "\t})\n" +
            "},\n" +
            "{\n" +
            "\tname: \"黑松卧室\",\n" +
            "\t//地图名称text: Array(\"这是淳于堡主起居的地方\",\n" +
            "\t\"北：阳台 ↑\",\n" +
            "\t\"南：黑松堡西侧 ↓\"),\n" +
            "\t//描述判定npc: Array(),\n" +
            "\t//npcdirection: Array(//可去路径{\n" +
            "\t\tname: \"黑松阳台\",\n" +
            "\t\ttext: \"北：阳台 ↑\"\n" +
            "\t},\n" +
            "\t{\n" +
            "\t\tname: \"黑松堡西侧\",\n" +
            "\t\ttext: \"南：黑松堡西侧 ↓\"\n" +
            "\t})\n" +
            "},\n" +
            "{\n" +
            "\tname: \"黑松阳台\",\n" +
            "\t//地图名称text: Array(\"这是一个小小的阳台\",\n" +
            "\t\"强劲的山风吹在你身上\",\n" +
            "\t\"南：卧室 ↓\"),\n" +
            "\t//描述判定npc: Array(),\n" +
            "\t//npcdirection: Array(//可去路径{\n" +
            "\t\tname: \"黑松卧室\",\n" +
            "\t\ttext: \"南：卧室 ↓\"\n" +
            "\t})\n" +
            "},\n" +
            "{\n" +
            "\tname: \"黑松堡东侧\",\n" +
            "\t//地图名称text: Array(\"黑松城堡的东侧\",\n" +
            "\t\"西：黑松淳于 ←\",\n" +
            "\t\"南：黑松阁正厅 ↓\"),\n" +
            "\t//描述判定npc: Array(),\n" +
            "\t//npcdirection: Array(//可去路径{\n" +
            "\t\tname: \"黑松淳于\",\n" +
            "\t\ttext: \"西：黑松淳于 ←\"\n" +
            "\t},\n" +
            "\t{\n" +
            "\t\tname: \"黑松阁正厅\",\n" +
            "\t\ttext: \"南：黑松阁正厅 ↓\"\n" +
            "\t})\n" +
            "},\n" +
            "{\n" +
            "\tname: \"黑松阁正厅\",\n" +
            "\t//地图名称text: Array(\"黑松阁正厅完全是用檀香木打造的\",\n" +
            "\t\"西：黑松阁西厅 ←\",\n" +
            "\t\"南：地牢 ↓\"),\n" +
            "\t//描述判定npc: Array(),\n" +
            "\t//npcdirection: Array(//可去路径{\n" +
            "\t\tname: \"黑松堡东侧\",\n" +
            "\t\ttext: \"北：黑松堡东侧 ↑\"\n" +
            "\t},\n" +
            "\t{\n" +
            "\t\tname: \"黑松阁西厅\",\n" +
            "\t\ttext: \"西：黑松阁西厅 ←\"\n" +
            "\t},\n" +
            "\t{\n" +
            "\t\tname: \"黑松阁东厅\",\n" +
            "\t\ttext: \"东：黑松阁东厅 →\"\n" +
            "\t},\n" +
            "\t{\n" +
            "\t\tname: \"黑松地牢[1]\",\n" +
            "\t\ttext: \"南：地牢 ↓\"\n" +
            "\t})\n" +
            "},\n" +
            "{\n" +
            "\tname: \"黑松阁西厅\",\n" +
            "\t//地图名称text: Array(\"这是黑松堡主淳于怀太迎宾的西厅\",\n" +
            "\t\"北：北花园 ↑\",\n" +
            "\t\"西：西花园 ←\"),\n" +
            "\t//描述判定npc: Array(),\n" +
            "\t//npcdirection: Array(//可去路径{\n" +
            "\t\tname: \"黑松北花园\",\n" +
            "\t\ttext: \"北：北花园 ↑\"\n" +
            "\t},\n" +
            "\t{\n" +
            "\t\tname: \"黑松西花园\",\n" +
            "\t\ttext: \"西：西花园 ←\"\n" +
            "\t},\n" +
            "\t{\n" +
            "\t\tname: \"黑松阁正厅\",\n" +
            "\t\ttext: \"东：黑松阁正厅 →\"\n" +
            "\t},\n" +
            "\t{\n" +
            "\t\tname: \"黑松储藏室\",\n" +
            "\t\ttext: \"南：储藏室 ↓\"\n" +
            "\t})\n" +
            "},\n" +
            "{\n" +
            "\tname: \"黑松北花园\",\n" +
            "\t//地图名称text: Array(\"你站在黑松城堡的北花园里\",\n" +
            "\t\"再往南则是雄伟的黑松阁\",\n" +
            "\t\"南：黑松阁西厅 ↓\"),\n" +
            "\t//描述判定npc: Array(),\n" +
            "\t//npcdirection: Array(//可去路径{\n" +
            "\t\tname: \"黑松阁西厅\",\n" +
            "\t\ttext: \"南：黑松阁西厅 ↓\"\n" +
            "\t})\n" +
            "},\n" +
            "{\n" +
            "\tname: \"黑松西花园\",\n" +
            "\t//地图名称text: Array(\"你站在黑松城堡的西花园里\",\n" +
            "\t\"再往东则是雄伟的黑松阁\",\n" +
            "\t\"东：黑松阁西厅 →\"),\n" +
            "\t//描述判定npc: Array(),\n" +
            "\t//npcdirection: Array(//可去路径{\n" +
            "\t\tname: \"黑松阁西厅\",\n" +
            "\t\ttext: \"东：黑松阁西厅 →\"\n" +
            "\t})\n" +
            "},\n" +
            "{\n" +
            "\tname: \"黑松储藏室\",\n" +
            "\t//地图名称text: Array(\"一个小小的储藏室\",\n" +
            "\t\"四壁上布满了灰尘\",\n" +
            "\t\"北：黑松阁西厅 ↑\"),\n" +
            "\t//描述判定npc: Array(),\n" +
            "\t//npcdirection: Array(//可去路径{\n" +
            "\t\tname: \"黑松阁西厅\",\n" +
            "\t\ttext: \"北：黑松阁西厅 ↑\"\n" +
            "\t})\n" +
            "},\n" +
            "{\n" +
            "\tname: \"黑松阁东厅\",\n" +
            "\t//地图名称text: Array(\"这是黑松堡主淳于怀太迎宾的东厅\",\n" +
            "\t\"西：黑松阁正厅 ←\",\n" +
            "\t\"南：膳房 ↓\"),\n" +
            "\t//描述判定npc: Array(),\n" +
            "\t//npcdirection: Array(//可去路径{\n" +
            "\t\tname: \"黑松阁正厅\",\n" +
            "\t\ttext: \"西：黑松阁正厅 ←\"\n" +
            "\t},\n" +
            "\t{\n" +
            "\t\tname: \"黑松东花园\",\n" +
            "\t\ttext: \"东：东花园 →\"\n" +
            "\t},\n" +
            "\t{\n" +
            "\t\tname: \"黑松膳房\",\n" +
            "\t\ttext: \"南：膳房 ↓\"\n" +
            "\t})\n" +
            "},\n" +
            "{\n" +
            "\tname: \"黑松膳房\",\n" +
            "\t//地图名称text: Array(\"这是淳于堡主的用膳房\",\n" +
            "\t\"你似乎听到你的肚子\",\n" +
            "\t\"北：黑松阁东厅 ↑\"),\n" +
            "\t//描述判定npc: Array(),\n" +
            "\t//npcdirection: Array(//可去路径{\n" +
            "\t\tname: \"黑松阁东厅\",\n" +
            "\t\ttext: \"北：黑松阁东厅 ↑\"\n" +
            "\t})\n" +
            "},\n" +
            "{\n" +
            "\tname: \"黑松东花园\",\n" +
            "\t//地图名称text: Array(\"你站在黑松城堡的东花园里\",\n" +
            "\t\"西：黑松阁东厅 ←\",\n" +
            "\t\"南：南花园 ↓\"),\n" +
            "\t//描述判定npc: Array(),\n" +
            "\t//npcdirection: Array(//可去路径{\n" +
            "\t\tname: \"黑松阁东厅\",\n" +
            "\t\ttext: \"西：黑松阁东厅 ←\"\n" +
            "\t},\n" +
            "\t{\n" +
            "\t\tname: \"黑松南花园\",\n" +
            "\t\ttext: \"南：南花园 ↓\"\n" +
            "\t})\n" +
            "},\n" +
            "{\n" +
            "\tname: \"黑松南花园\",\n" +
            "\t//地图名称text: Array(\"你站在黑松城堡的南花园里\",\n" +
            "\t\"再往北则是雄伟的黑松阁\",\n" +
            "\t\"北：东花园 ↑\"),\n" +
            "\t//描述判定npc: Array(),\n" +
            "\t//npcdirection: Array(//可去路径{\n" +
            "\t\tname: \"黑松南花园\",\n" +
            "\t\ttext: \"北：东花园 ↑\"\n" +
            "\t})\n" +
            "},\n" +
            "{\n" +
            "\tname: \"黑松地牢[1]\",\n" +
            "\t//地图名称text: Array(\"几乎伸手不见五指\",\n" +
            "\t\"北：黑松阁正厅 ↑\",\n" +
            "\t\"南：地牢 ↓\"),\n" +
            "\t//描述判定npc: Array(\"紫衣家丁\"),\n" +
            "\t//npcdirection: Array(//可去路径{\n" +
            "\t\tname: \"黑松阁正厅\",\n" +
            "\t\ttext: \"北：黑松阁正厅 ↑\"\n" +
            "\t},\n" +
            "\t{\n" +
            "\t\tname: \"黑松地牢[2]\",\n" +
            "\t\ttext: \"南：地牢 ↓\"\n" +
            "\t})\n" +
            "},\n" +
            "{\n" +
            "\tname: \"黑松地牢[2]\",\n" +
            "\t//地图名称text: Array(\"唯一的光亮来自墙上忽明忽暗的松油灯\",\n" +
            "\t\"北：地牢 ↑\",\n" +
            "\t\"东：地牢 →\"),\n" +
            "\t//描述判定npc: Array(\"紫衣家丁\"),\n" +
            "\t//npcdirection: Array(//可去路径{\n" +
            "\t\tname: \"黑松地牢[1]\",\n" +
            "\t\ttext: \"北：地牢 ↑\"\n" +
            "\t},\n" +
            "\t{\n" +
            "\t\tname: \"黑松地牢[3]\",\n" +
            "\t\ttext: \"东：地牢 →\"\n" +
            "\t},\n" +
            "\t{\n" +
            "\t\tname: \"黑松地牢[4]\",\n" +
            "\t\ttext: \"南：地牢 ↓\"\n" +
            "\t})\n" +
            "},\n" +
            "{\n" +
            "\tname: \"黑松地牢[3]\",\n" +
            "\t//地图名称text: Array(\"散发出阵阵腥气\",\n" +
            "\t\"西：地牢 ←\",\n" +
            "\t\"南：刑房 ↓\"),\n" +
            "\t//描述判定npc: Array(\"紫衣家丁\"),\n" +
            "\t//npcdirection: Array(//可去路径{\n" +
            "\t\tname: \"黑松地牢[2]\",\n" +
            "\t\ttext: \"西：地牢 ←\"\n" +
            "\t},\n" +
            "\t{\n" +
            "\t\tname: \"黑松刑房\",\n" +
            "\t\ttext: \"南：刑房 ↓\"\n" +
            "\t})\n" +
            "},\n" +
            "{\n" +
            "\tname: \"黑松刑房\",\n" +
            "\t//地图名称text: Array(\"墙上挂满了各式各样的邢具\",\n" +
            "\t\"北：地牢 ↑\",\n" +
            "\t\"南：密室 ↓\"),\n" +
            "\t//描述判定npc: Array(\"淳于怀太\"),\n" +
            "\t//npcdirection: Array(//可去路径{\n" +
            "\t\tname: \"黑松地牢[3]\",\n" +
            "\t\ttext: \"北：地牢 ↑\"\n" +
            "\t},\n" +
            "\t{\n" +
            "\t\tname: \"黑松密室\",\n" +
            "\t\ttext: \"南：密室 ↓\"\n" +
            "\t})\n" +
            "},\n" +
            "{\n" +
            "\tname: \"黑松密室\",\n" +
            "\t//地图名称text: Array(\"一间房间\",\n" +
            "\t\"不知道里面埋藏着多少秘密\",\n" +
            "\t\"北：刑房 ↑\"),\n" +
            "\t//描述判定npc: Array(\"小娟\"),\n" +
            "\t//npcdirection: Array(//可去路径{\n" +
            "\t\tname: \"黑松刑房\",\n" +
            "\t\ttext: \"北：刑房 ↑\"\n" +
            "\t})\n" +
            "},\n" +
            "{\n" +
            "\tname: \"黑松地牢[4]\",\n" +
            "\t//地图名称text: Array(\"不断传来的哀嚎声在死沉的地牢里回荡\",\n" +
            "\t\"令人毛骨耸然\",\n" +
            "\t\"北：地牢 ↑\"),\n" +
            "\t//描述判定npc: Array(\"紫衣家丁\"),\n" +
            "\t//npcdirection: Array(//可去路径{\n" +
            "\t\tname: \"黑松地牢[2]\",\n" +
            "\t\ttext: \"北：地牢 ↑\"\n" +
            "\t})\n" +
            "},\n" +
            "{\n" +
            "\tname: \"兰州街道[3]\",\n" +
            "\t//地图名称text: Array(\"这里是兰州镇南\",\n" +
            "\t\"北边是十字路口\",\n" +
            "\t\"北：十字路口 ↑\"),\n" +
            "\t//描述判定npc: Array(\"青年侠客\"),\n" +
            "\t//npcdirection: Array(//可去路径{\n" +
            "\t\tname: \"兰州十字路口\",\n" +
            "\t\ttext: \"北：十字路口 ↑\"\n" +
            "\t},\n" +
            "\t{\n" +
            "\t\tname: \"兰州民宅\",\n" +
            "\t\ttext: \"东：民宅 →\"\n" +
            "\t})\n" +
            "},\n" +
            "{\n" +
            "\tname: \"兰州民宅\",\n" +
            "\t//地图名称text: Array(\"一间普通的民宅\",\n" +
            "\t\"不知道住着什么人\",\n" +
            "\t\"西：街道\"),\n" +
            "\t//描述判定npc: Array(\"护教\",\n" +
            "\t\"紫衣护教\"),\n" +
            "\t//npcdirection: Array(//可去路径{\n" +
            "\t\tname: \"兰州街道[3]\",\n" +
            "\t\ttext: \"西：街道 ←\"\n" +
            "\t})\n" +
            "},\n" +
            "{\n" +
            "\tname: \"兰州街道[2]\",\n" +
            "\t//地图名称text: Array(\"这里是兰州镇西\",\n" +
            "\t\"东边就是十字路口\",\n" +
            "\t\"南：龙门客栈\"),\n" +
            "\t//描述判定npc: Array(\"掌旗手\"),\n" +
            "\t//npcdirection: Array(//可去路径{\n" +
            "\t\tname: \"兰州药铺\",\n" +
            "\t\ttext: \"北：兰州药铺 ↑\"\n" +
            "\t},\n" +
            "\t{\n" +
            "\t\tname: \"兰州街道[4]\",\n" +
            "\t\ttext: \"西：兰州街道 ←\"\n" +
            "\t},\n" +
            "\t{\n" +
            "\t\tname: \"兰州十字路口\",\n" +
            "\t\ttext: \"东：十字路口 →\"\n" +
            "\t},\n" +
            "\t{\n" +
            "\t\tname: \"龙门客栈\",\n" +
            "\t\ttext: \"南：龙门客栈 ↓\"\n" +
            "\t})\n" +
            "},\n" +
            "{\n" +
            "\tname: \"兰州药铺\",\n" +
            "\t//地图名称text: Array(\"兰州药铺\",\n" +
            "\t\"南：街道 ↓\",\n" +
            "\t\"这是一家药铺\"),\n" +
            "\t//描述判定npc: Array(\"药铺伙计\"),\n" +
            "\t//npcdirection: Array(//可去路径{\n" +
            "\t\tname: \"兰州街道[2]\",\n" +
            "\t\ttext: \"南：街道 ↓\"\n" +
            "\t})\n" +
            "},\n" +
            "{\n" +
            "\tname: \"龙门客栈\",\n" +
            "\t//地图名称text: Array(\"龙门客栈一年四季客人络绎不绝\",\n" +
            "\t\"北：街道 ↑\"),\n" +
            "\t//描述判定npc: Array(),\n" +
            "\t//npcdirection: Array(//可去路径{\n" +
            "\t\tname: \"兰州街道[2]\",\n" +
            "\t\ttext: \"北：街道 ↑\"\n" +
            "\t})\n" +
            "},\n" +
            "{\n" +
            "\tname: \"兰州街道[4]\",\n" +
            "\t//地图名称text: Array(\"东边青板石铺的路与向西的碎石小径在这里汇合\",\n" +
            "\t\"西面仿佛是座庄院\",\n" +
            "\t\"东：街道\"),\n" +
            "\t//描述判定npc: Array(\"掌旗手\"),\n" +
            "\t//npcdirection: Array(//可去路径{\n" +
            "\t\tname: \"兰州西驿道[1]\",\n" +
            "\t\ttext: \"西：驿道 ←\"\n" +
            "\t},\n" +
            "\t{\n" +
            "\t\tname: \"兰州街道[2]\",\n" +
            "\t\ttext: \"东：街道 →\"\n" +
            "\t})\n" +
            "},\n" +
            "{\n" +
            "\tname: \"兰州西驿道[1]\",\n" +
            "\t//地图名称text: Array(\"西：驿道\",\n" +
            "\t\"东：兰州街道\",\n" +
            "\t\"一条驿道静静的向远方延伸\"),\n" +
            "\t//描述判定npc: Array(),\n" +
            "\t//npcdirection: Array(//可去路径{\n" +
            "\t\tname: \"兰州西驿道[2]\",\n" +
            "\t\ttext: \"西：驿道 ←\"\n" +
            "\t},\n" +
            "\t{\n" +
            "\t\tname: \"兰州街道[4]\",\n" +
            "\t\ttext: \"东：兰州街道 →\"\n" +
            "\t})\n" +
            "},\n" +
            "{\n" +
            "\tname: \"兰州西驿道[2]\",\n" +
            "\t//地图名称text: Array(\"这条驿道被黄沙覆盖，行走颇为困难\"),\n" +
            "\t//描述判定npc: Array(),\n" +
            "\t//npcdirection: Array(//可去路径{\n" +
            "\t\tname: \"兰州西驿道[3]\",\n" +
            "\t\ttext: \"西：驿道 ←\"\n" +
            "\t},\n" +
            "\t{\n" +
            "\t\tname: \"兰州西驿道[1]\",\n" +
            "\t\ttext: \"东：驿道 →\"\n" +
            "\t})\n" +
            "},\n" +
            "{\n" +
            "\tname: \"兰州西驿道[3]\",\n" +
            "\t//地图名称text: Array(\"这条驿道被黄沙覆盖，行走颇为困难\",\n" +
            "\t\"西：驿道\",\n" +
            "\t\"东：驿道\"),\n" +
            "\t//描述判定npc: Array(\"西门吹雪\"),\n" +
            "\t//npcdirection: Array(//可去路径{\n" +
            "\t\tname: \"兰州西驿道[4]\",\n" +
            "\t\ttext: \"西：驿道 ←\"\n" +
            "\t},\n" +
            "\t{\n" +
            "\t\tname: \"兰州西驿道[2]\",\n" +
            "\t\ttext: \"东：驿道 →\"\n" +
            "\t})\n" +
            "},\n" +
            "{\n" +
            "\tname: \"兰州西驿道[4]\",\n" +
            "\t//地图名称text: Array(\"这条驿道被黄沙覆盖，行走颇为困难\",\n" +
            "\t\"西：驿道\",\n" +
            "\t\"东：驿道\"),\n" +
            "\t//描述判定npc: Array(),\n" +
            "\t//npcdirection: Array(//可去路径{\n" +
            "\t\tname: \"兰州西驿道[5]\",\n" +
            "\t\ttext: \"西：驿道 ←\"\n" +
            "\t},\n" +
            "\t{\n" +
            "\t\tname: \"兰州西驿道[3]\",\n" +
            "\t\ttext: \"东：驿道 →\"\n" +
            "\t})\n" +
            "},\n" +
            "{\n" +
            "\tname: \"兰州西驿道[5]\",\n" +
            "\t//地图名称text: Array(\"这条驿道被黄沙覆盖，行走颇为困难\",\n" +
            "\t\"西：驿道\",\n" +
            "\t\"东：驿道\"),\n" +
            "\t//描述判定npc: Array(\"阳顶天\"),\n" +
            "\t//npcdirection: Array(//可去路径{\n" +
            "\t\tname: \"兰州西驿道[6]\",\n" +
            "\t\ttext: \"西：驿道 ←\"\n" +
            "\t},\n" +
            "\t{\n" +
            "\t\tname: \"兰州西驿道[4]\",\n" +
            "\t\ttext: \"东：驿道 →\"\n" +
            "\t})\n" +
            "},\n" +
            "{\n" +
            "\tname: \"兰州西驿道[6]\",\n" +
            "\t//地图名称text: Array(\"这条驿道被黄沙覆盖，行走颇为困难\",\n" +
            "\t\"西：楼兰\"),\n" +
            "\t//描述判定npc: Array(\"陆小凤\"),\n" +
            "\t//npcdirection: Array(//可去路径{\n" +
            "\t\tname: \"楼兰\",\n" +
            "\t\ttext: \"西：楼兰 ←\"\n" +
            "\t},\n" +
            "\t{\n" +
            "\t\tname: \"兰州西驿道[5]\",\n" +
            "\t\ttext: \"东：驿道 →\"\n" +
            "\t})\n" +
            "},\n" +
            "{\n" +
            "\tname: \"楼兰\",\n" +
            "\t//地图名称text: Array(\"古城楼兰\",\n" +
            "\t\"上马车\",\n" +
            "\t\"南：羊肠小道\"),\n" +
            "\t//描述判定npc: Array(\"谢晓峰\"),\n" +
            "\t//npcdirection: Array(//可去路径{\n" +
            "\t\tname: \"星宿海入口\",\n" +
            "\t\ttext: \"北：星宿海入口 ↑\"\n" +
            "\t},\n" +
            "\t{\n" +
            "\t\tname: \"兰州西驿道[6]\",\n" +
            "\t\ttext: \"东：驿道 →\"\n" +
            "\t},\n" +
            "\t{\n" +
            "\t\tname: \"羊肠小道\",\n" +
            "\t\ttext: \"南：羊肠小道 ↓\"\n" +
            "\t})\n" +
            "},\n" +
            "{\n" +
            "\tname: \"星宿海入口\",\n" +
            "\t//地图名称text: Array(\"这里是星宿海边。说是海\",\n" +
            "\t\"西：星宿海西 ←\",\n" +
            "\t\"南：楼兰 ↓\"),\n" +
            "\t//描述判定npc: Array(\"星宿弟子\"),\n" +
            "\t//npcdirection: Array(//可去路径{\n" +
            "\t\tname: \"星宿海西\",\n" +
            "\t\ttext: \"西：星宿海西 ←\"\n" +
            "\t},\n" +
            "\t{\n" +
            "\t\tname: \"星宿海东\",\n" +
            "\t\ttext: \"东：星宿海东 →\"\n" +
            "\t},\n" +
            "\t{\n" +
            "\t\tname: \"楼兰\",\n" +
            "\t\ttext: \"南：楼兰 ↓\"\n" +
            "\t})\n" +
            "},\n" +
            "{\n" +
            "\tname: \"星宿海西\",\n" +
            "\t//地图名称text: Array(\"这里是星宿海边。说是海\",\n" +
            "\t\"北：星宿海边 ↑\",\n" +
            "\t\"东：星宿海入口 →\"),\n" +
            "\t//描述判定npc: Array(\"星宿弟子\"),\n" +
            "\t//npcdirection: Array(//可去路径{\n" +
            "\t\tname: \"星宿海边\",\n" +
            "\t\ttext: \"北：星宿海边 ↑\"\n" +
            "\t},\n" +
            "\t{\n" +
            "\t\tname: \"星宿海石道\",\n" +
            "\t\ttext: \"西：石道 ←\"\n" +
            "\t},\n" +
            "\t{\n" +
            "\t\tname: \"星宿海入口\",\n" +
            "\t\ttext: \"东：星宿海入口 →\"\n" +
            "\t})\n" +
            "},\n" +
            "{\n" +
            "\tname: \"星宿海石道\",\n" +
            "\t//地图名称text: Array(\"这是星宿海边有人用石头铺成的一条小道\",\n" +
            "\t\"西：逍遥洞 ←\",\n" +
            "\t\"东：星宿海西 →\"),\n" +
            "\t//描述判定npc: Array(\"星宿弟子\"),\n" +
            "\t//npcdirection: Array(//可去路径{\n" +
            "\t\tname: \"星宿海逍遥洞\",\n" +
            "\t\ttext: \"西：逍遥洞 ←\"\n" +
            "\t},\n" +
            "\t{\n" +
            "\t\tname: \"星宿海西\",\n" +
            "\t\ttext: \"东：星宿海西 →\"\n" +
            "\t})\n" +
            "},\n" +
            "{\n" +
            "\tname: \"星宿海逍遥洞\",\n" +
            "\t//地图名称text: Array(\"这是一个粗糙的石洞\",\n" +
            "\t\"东：石道 →\"),\n" +
            "\t//描述判定npc: Array(\"星宿弟子\"),\n" +
            "\t//npcdirection: Array(//可去路径{\n" +
            "\t\tname: \"星宿海石道\",\n" +
            "\t\ttext: \"东：石道 →\"\n" +
            "\t})\n" +
            "},\n" +
            "{\n" +
            "\tname: \"星宿海边\",\n" +
            "\t//地图名称text: Array(\"这里是星宿海边。说是海，其实是片湖泊和沼泽，地形十分险恶\",\n" +
            "\t\"东：青海湖 →\",\n" +
            "\t\"南：星宿海西 ↓\"),\n" +
            "\t//描述判定npc: Array(\"星宿弟子\"),\n" +
            "\t//npcdirection: Array(//可去路径{\n" +
            "\t\tname: \"天山脚下\",\n" +
            "\t\ttext: \"西：天山脚下 ←\"\n" +
            "\t},\n" +
            "\t{\n" +
            "\t\tname: \"星宿青海湖\",\n" +
            "\t\ttext: \"东：青海湖 →\"\n" +
            "\t},\n" +
            "\t{\n" +
            "\t\tname: \"星宿海西\",\n" +
            "\t\ttext: \"南：星宿海西 ↓\"\n" +
            "\t})\n" +
            "},\n" +
            "{\n" +
            "\tname: \"星宿青海湖\",\n" +
            "\t//地图名称text: Array(\"这里地域辽阔，草原广袤\",\n" +
            "\t\"河流众多，水草丰美，环境幽静\",\n" +
            "\t\"西：星宿海边 ←\"),\n" +
            "\t//描述判定npc: Array(\"星宿弟子\"),\n" +
            "\t//npcdirection: Array(//可去路径{\n" +
            "\t\tname: \"星宿海边\",\n" +
            "\t\ttext: \"西：星宿海边 ←\"\n" +
            "\t})\n" +
            "},\n" +
            "{\n" +
            "\tname: \"天山脚下\",\n" +
            "\t//地图名称text: Array(\"这里是天山脚下，西面是高耸入云的天山\",\n" +
            "\t\"北：北疆小镇 ↑\",\n" +
            "\t\"东：星宿海边 →\"),\n" +
            "\t//描述判定npc: Array(\"波斯商人\"),\n" +
            "\t//npcdirection: Array(//可去路径{\n" +
            "\t\tname: \"北疆小镇\",\n" +
            "\t\ttext: \"北：北疆小镇 ↑\"\n" +
            "\t},\n" +
            "\t{\n" +
            "\t\tname: \"星宿海边\",\n" +
            "\t\ttext: \"东：星宿海边 →\"\n" +
            "\t},\n" +
            "\t{\n" +
            "\t\tname: \"南疆沙漠\",\n" +
            "\t\ttext: \"南：南疆沙漠 ↓\"\n" +
            "\t})\n" +
            "},\n" +
            "{\n" +
            "\tname: \"南疆沙漠\",\n" +
            "\t//地图名称text: Array(\"这就是浩瀚的塔克拉马干大沙漠\",\n" +
            "\t\"北：天山脚下 ↑\"),\n" +
            "\t//描述判定npc: Array(\"星宿弟子\"),\n" +
            "\t//npcdirection: Array(//可去路径{\n" +
            "\t\tname: \"天山脚下\",\n" +
            "\t\ttext: \"北：天山脚下 ↑\"\n" +
            "\t})\n" +
            "},\n" +
            "{\n" +
            "\tname: \"北疆小镇\",\n" +
            "\t//地图名称text: Array(\"这里是一座小镇\",\n" +
            "\t\"镇上人来人往\"),\n" +
            "\t//描述判定npc: Array(\"妇女\"),\n" +
            "\t//npcdirection: Array(//可去路径{\n" +
            "\t\tname: \"北疆赛马场\",\n" +
            "\t\ttext: \"北：赛马场 ↑\"\n" +
            "\t},\n" +
            "\t{\n" +
            "\t\tname: \"北疆杂货铺\",\n" +
            "\t\ttext: \"西：杂货铺 ←\"\n" +
            "\t},\n" +
            "\t{\n" +
            "\t\tname: \"巴依家院\",\n" +
            "\t\ttext: \"东：巴依家院 →\"\n" +
            "\t},\n" +
            "\t{\n" +
            "\t\tname: \"天山脚下\",\n" +
            "\t\ttext: \"南：天山脚下 ↓\"\n" +
            "\t})\n" +
            "},\n" +
            "{\n" +
            "\tname: \"北疆赛马场\",\n" +
            "\t//地图名称text: Array(\"这里是小镇的赛马场\",\n" +
            "\t\"南：北疆小镇 ↓\"),\n" +
            "\t//描述判定npc: Array(\"阿拉木罕\"),\n" +
            "\t//npcdirection: Array(//可去路径{\n" +
            "\t\tname: \"北疆小镇\",\n" +
            "\t\ttext: \"南：北疆小镇 ↓\"\n" +
            "\t})\n" +
            "},\n" +
            "{\n" +
            "\tname: \"北疆杂货铺\",\n" +
            "\t//地图名称text: Array(\"这是一个杂货铺\",\n" +
            "\t\"东：北疆小镇 →\"),\n" +
            "\t//描述判定npc: Array(\"买卖堤\"),\n" +
            "\t//npcdirection: Array(//可去路径{\n" +
            "\t\tname: \"北疆小镇\",\n" +
            "\t\ttext: \"东：北疆小镇 →\"\n" +
            "\t})\n" +
            "},\n" +
            "{\n" +
            "\tname: \"巴依家院\",\n" +
            "\t//地图名称text: Array(\"这是一个巴依家的庭院\",\n" +
            "\t\"西：北疆小镇 ←\"),\n" +
            "\t//描述判定npc: Array(\"巴依\"),\n" +
            "\t//npcdirection: Array(//可去路径{\n" +
            "\t\tname: \"北疆小镇\",\n" +
            "\t\ttext: \"西：北疆小镇 ←\"\n" +
            "\t},\n" +
            "\t{\n" +
            "\t\tname: \"巴依客厅\",\n" +
            "\t\ttext: \"东：客厅 →\"\n" +
            "\t})\n" +
            "},\n" +
            "{\n" +
            "\tname: \"巴依客厅\",\n" +
            "\t//地图名称text: Array(\"这是巴依家的客厅\",\n" +
            "\t\"西：巴依家院 ←\"),\n" +
            "\t//描述判定npc: Array(\"阿凡堤\"),\n" +
            "\t//npcdirection: Array(//可去路径{\n" +
            "\t\tname: \"巴依家院\",\n" +
            "\t\ttext: \"西：巴依家院 ←\"\n" +
            "\t})\n" +
            "},\n" +
            "{\n" +
            "\tname: \"星宿海东\",\n" +
            "\t//地图名称text: Array(\"这里是星宿海边。说是海\",\n" +
            "\t\"西：星宿海入口 ←\",\n" +
            "\t\"南：星宿海南 ↓\"),\n" +
            "\t//描述判定npc: Array(\"星宿弟子\"),\n" +
            "\t//npcdirection: Array(//可去路径{\n" +
            "\t\tname: \"星宿海入口\",\n" +
            "\t\ttext: \"西：星宿海入口 ←\"\n" +
            "\t},\n" +
            "\t{\n" +
            "\t\tname: \"星宿海南\",\n" +
            "\t\ttext: \"南：星宿海南 ↓\"\n" +
            "\t})\n" +
            "},\n" +
            "{\n" +
            "\tname: \"星宿海南\",\n" +
            "\t//地图名称text: Array(\"这里是星宿海边。说是海\",\n" +
            "\t\"北：星宿海东 ↑\",\n" +
            "\t\"东：日月洞 →\"),\n" +
            "\t//描述判定npc: Array(\"采花子\"),\n" +
            "\t//npcdirection: Array(//可去路径{\n" +
            "\t\tname: \"星宿海东\",\n" +
            "\t\ttext: \"北：星宿海东 ↑\"\n" +
            "\t},\n" +
            "\t{\n" +
            "\t\tname: \"星宿海日月洞\",\n" +
            "\t\ttext: \"东：日月洞 →\"\n" +
            "\t},\n" +
            "\t{\n" +
            "\t\tname: \"星宿海尽头\",\n" +
            "\t\ttext: \"南：星宿海尽头 ↓\"\n" +
            "\t})\n" +
            "},\n" +
            "{\n" +
            "\tname: \"星宿海日月洞\",\n" +
            "\t//地图名称text: Array(\"这里是星宿派总舵所在地日月洞\",\n" +
            "\t\"西：星宿海南 ←\"),\n" +
            "\t//描述判定npc: Array(\"丁春秋\"),\n" +
            "\t//npcdirection: Array(//可去路径{\n" +
            "\t\tname: \"星宿海南\",\n" +
            "\t\ttext: \"西：星宿海南 ←\"\n" +
            "\t})\n" +
            "},\n" +
            "{\n" +
            "\tname: \"星宿海尽头\",\n" +
            "\t//地图名称text: Array(\"这里是星宿海的尽头\",\n" +
            "\t\"北：星宿海南 ↑\",\n" +
            "\t\"南：山路 ↓\"),\n" +
            "\t//描述判定npc: Array(\"摘星子\"),\n" +
            "\t//npcdirection: Array(//可去路径{\n" +
            "\t\tname: \"星宿海南\",\n" +
            "\t\ttext: \"北：星宿海南 ↑\"\n" +
            "\t},\n" +
            "\t{\n" +
            "\t\tname: \"天山东麓山路[1]\",\n" +
            "\t\ttext: \"南：山路 ↓\"\n" +
            "\t})\n" +
            "},\n" +
            "{\n" +
            "\tname: \"天山东麓山路[1]\",\n" +
            "\t//地图名称text: Array(\"这里是天山东麓\",\n" +
            "\t\"北：星宿海尽头 ↑\",\n" +
            "\t\"东：山间平地 →\"),\n" +
            "\t//描述判定npc: Array(\"狮吼子\"),\n" +
            "\t//npcdirection: Array(//可去路径{\n" +
            "\t\tname: \"星宿海尽头\",\n" +
            "\t\ttext: \"北：星宿海尽头 ↑\"\n" +
            "\t},\n" +
            "\t{\n" +
            "\t\tname: \"星宿海山间平地\",\n" +
            "\t\ttext: \"东：山间平地 →\"\n" +
            "\t},\n" +
            "\t{\n" +
            "\t\tname: \"天山东麓山路[2]\",\n" +
            "\t\ttext: \"南：山路 ↓\"\n" +
            "\t})\n" +
            "},\n" +
            "{\n" +
            "\tname: \"星宿海山间平地\",\n" +
            "\t//地图名称text: Array(\"地上是嫩绿的小草\",\n" +
            "\t\"西：山路 ←\",\n" +
            "\t\"南：小路 ↓\"),\n" +
            "\t//描述判定npc: Array(\"星宿弟子\"),\n" +
            "\t//npcdirection: Array(//可去路径{\n" +
            "\t\tname: \"天山东麓山路[1]\",\n" +
            "\t\ttext: \"西：山路 ←\"\n" +
            "\t},\n" +
            "\t{\n" +
            "\t\tname: \"星宿海小路[1]\",\n" +
            "\t\ttext: \"南：小路 ↓\"\n" +
            "\t})\n" +
            "},\n" +
            "{\n" +
            "\tname: \"星宿海小路[1]\",\n" +
            "\t//地图名称text: Array(\"西面是望不见底的深涧\",\n" +
            "\t\"北：山间平地 ↑\",\n" +
            "\t\"西：储藏室 ←\"),\n" +
            "\t//描述判定npc: Array(\"星宿弟子\"),\n" +
            "\t//npcdirection: Array(//可去路径{\n" +
            "\t\tname: \"星宿海山间平地\",\n" +
            "\t\ttext: \"北：山间平地 ↑\"\n" +
            "\t},\n" +
            "\t{\n" +
            "\t\tname: \"星宿海储藏室\",\n" +
            "\t\ttext: \"西：储藏室 ←\"\n" +
            "\t},\n" +
            "\t{\n" +
            "\t\tname: \"星宿海小路[2]\",\n" +
            "\t\ttext: \"南：小路 ↓\"\n" +
            "\t})\n" +
            "},\n" +
            "{\n" +
            "\tname: \"星宿海储藏室\",\n" +
            "\t//地图名称text: Array(\"这里原来是一个长在山壁上的天然溶洞\",\n" +
            "\t\"星宿派把这里改造成了一个仓库\",\n" +
            "\t\"东：小路 →\"),\n" +
            "\t//描述判定npc: Array(\"星宿弟子\"),\n" +
            "\t//npcdirection: Array(//可去路径{\n" +
            "\t\tname: \"星宿海小路[1]\",\n" +
            "\t\ttext: \"东：小路 →\"\n" +
            "\t})\n" +
            "},\n" +
            "{\n" +
            "\tname: \"星宿海小路[2]\",\n" +
            "\t//地图名称text: Array(\"势在这里渐渐变得平缓\",\n" +
            "\t\"东面有一个山洞\",\n" +
            "\t\"北：小路 ↑\"),\n" +
            "\t//描述判定npc: Array(\"天狼子\"),\n" +
            "\t//npcdirection: Array(//可去路径{\n" +
            "\t\tname: \"星宿海小路[1]\",\n" +
            "\t\ttext: \"北：小路 ↑\"\n" +
            "\t})\n" +
            "},\n" +
            "{\n" +
            "\tname: \"天山东麓山路[2]\",\n" +
            "\t//地图名称text: Array(\"这里是天山东麓\",\n" +
            "\t\"北：山路 ↑\",\n" +
            "\t\"西：山路 ←\"),\n" +
            "\t//描述判定npc: Array(\"牧羊人\"),\n" +
            "\t//npcdirection: Array(//可去路径{\n" +
            "\t\tname: \"天山东麓山路[1]\",\n" +
            "\t\ttext: \"北：山路 ↑\"\n" +
            "\t},\n" +
            "\t{\n" +
            "\t\tname: \"天山东麓山路[3]\",\n" +
            "\t\ttext: \"西：山路 ←\"\n" +
            "\t})\n" +
            "},\n" +
            "{\n" +
            "\tname: \"天山东麓山路[3]\",\n" +
            "\t//地图名称text: Array(\"这里是天山东麓\",\n" +
            "\t\"西：山路 ←\",\n" +
            "\t\"东：山路 →\"),\n" +
            "\t//描述判定npc: Array(\"阿紫\"),\n" +
            "\t//npcdirection: Array(//可去路径{\n" +
            "\t\tname: \"天山东麓山路[4]\",\n" +
            "\t\ttext: \"西：山路 ←\"\n" +
            "\t},\n" +
            "\t{\n" +
            "\t\tname: \"天山东麓山路[2]\",\n" +
            "\t\ttext: \"东：山路 →\"\n" +
            "\t})\n" +
            "},\n" +
            "{\n" +
            "\tname: \"天山东麓山路[4]\",\n" +
            "\t//地图名称text: Array(\"这里是天山东麓\",\n" +
            "\t\"西：山路 ←\",\n" +
            "\t\"东：山路 →\"),\n" +
            "\t//描述判定npc: Array(\"星宿弟子\"),\n" +
            "\t//npcdirection: Array(//可去路径{\n" +
            "\t\tname: \"天山东麓山路[5]\",\n" +
            "\t\ttext: \"西：山路 ←\"\n" +
            "\t},\n" +
            "\t{\n" +
            "\t\tname: \"天山东麓山路[3]\",\n" +
            "\t\ttext: \"东：山路 →\"\n" +
            "\t})\n" +
            "},\n" +
            "{\n" +
            "\tname: \"天山东麓山路[5]\",\n" +
            "\t//地图名称text: Array(\"这里是天山东麓\",\n" +
            "\t\"西：顶峰 ←\",\n" +
            "\t\"东：山路 →\"),\n" +
            "\t//描述判定npc: Array(\"采药人\"),\n" +
            "\t//npcdirection: Array(//可去路径{\n" +
            "\t\tname: \"天山东麓顶峰\",\n" +
            "\t\ttext: \"西：顶峰 ←\"\n" +
            "\t},\n" +
            "\t{\n" +
            "\t\tname: \"天山东麓山路[4]\",\n" +
            "\t\ttext: \"东：山路 →\"\n" +
            "\t})\n" +
            "},\n" +
            "{\n" +
            "\tname: \"天山东麓顶峰\",\n" +
            "\t//地图名称text: Array(\"这里是天山顶峰\",\n" +
            "\t\"帕米尔高原的风光尽收眼底\",\n" +
            "\t\"东：山路 →\"),\n" +
            "\t//描述判定npc: Array(\"毒蛇\"),\n" +
            "\t//npcdirection: Array(//可去路径{\n" +
            "\t\tname: \"天山东麓山路[5]\",\n" +
            "\t\ttext: \"东：山路 →\"\n" +
            "\t})\n" +
            "},\n" +
            "{\n" +
            "\tname: \"羊肠小道\",\n" +
            "\t//地图名称text: Array(\"北：楼兰\",\n" +
            "\t\"西：小道\",\n" +
            "\t\"这就是一线天，两块巨石对面而立\"),\n" +
            "\t//描述判定npc: Array(\"教众\"),\n" +
            "\t//npcdirection: Array(//可去路径{\n" +
            "\t\tname: \"楼兰\",\n" +
            "\t\ttext: \"北：楼兰 ↑\"\n" +
            "\t},\n" +
            "\t{\n" +
            "\t\tname: \"楼兰小道\",\n" +
            "\t\ttext: \"西：小道 ←\"\n" +
            "\t})\n" +
            "},\n" +
            "{\n" +
            "\tname: \"楼兰小道\",\n" +
            "\t//地图名称text: Array(\"你现在正走在一条崎岖的山路上\",\n" +
            "\t\"北：铁门\",\n" +
            "\t\"东：羊肠小道\"),\n" +
            "\t//描述判定npc: Array(\"教众\"),\n" +
            "\t//npcdirection: Array(//可去路径{\n" +
            "\t\tname: \"楼兰铁门\",\n" +
            "\t\ttext: \"北：铁门 ↑\"\n" +
            "\t},\n" +
            "\t{\n" +
            "\t\tname: \"羊肠小道\",\n" +
            "\t\ttext: \"东：羊肠小道 →\"\n" +
            "\t})\n" +
            "},\n" +
            "{\n" +
            "\tname: \"楼兰铁门\",\n" +
            "\t//地图名称text: Array(\"这是上山的一道铁门，有人把守以免外人混入\",\n" +
            "\t\"北：青石大道\",\n" +
            "\t\"南：小道\"),\n" +
            "\t//描述判定npc: Array(\"教众\"),\n" +
            "\t//npcdirection: Array(//可去路径{\n" +
            "\t\tname: \"青石大道\",\n" +
            "\t\ttext: \"北：青石大道 ↑\"\n" +
            "\t},\n" +
            "\t{\n" +
            "\t\tname: \"楼兰小道\",\n" +
            "\t\ttext: \"南：小道 ↓\"\n" +
            "\t})\n" +
            "},\n" +
            "{\n" +
            "\tname: \"青石大道\",\n" +
            "\t//地图名称text: Array(\"一条很气派的青石大道\",\n" +
            "\t\"约有五丈来宽\",\n" +
            "\t\"北：护教居\"),\n" +
            "\t//描述判定npc: Array(\"掌旗手\"),\n" +
            "\t//npcdirection: Array(//可去路径{\n" +
            "\t\tname: \"护教居[1]\",\n" +
            "\t\ttext: \"北：护教居 ↑\"\n" +
            "\t},\n" +
            "\t{\n" +
            "\t\tname: \"楼兰铁门\",\n" +
            "\t\ttext: \"南：铁门 ↓\"\n" +
            "\t})\n" +
            "},\n" +
            "{\n" +
            "\tname: \"护教居[1]\",\n" +
            "\t//地图名称text: Array(\"这是一间很大的屋子，屋子里有很多人\",\n" +
            "\t\"北：大石门\",\n" +
            "\t\"南：青石大道\"),\n" +
            "\t//描述判定npc: Array(\"黑衣护教\",\n" +
            "\t\"青衣护教\",\n" +
            "\t\"橙衣护教\",\n" +
            "\t\"绿衣护教\"),\n" +
            "\t//npcdirection: Array(//可去路径{\n" +
            "\t\tname: \"大石门\",\n" +
            "\t\ttext: \"北：大石门 ↑\"\n" +
            "\t},\n" +
            "\t{\n" +
            "\t\tname: \"魔教休息室\",\n" +
            "\t\ttext: \"东：休息室 →\"\n" +
            "\t},\n" +
            "\t{\n" +
            "\t\tname: \"青石大道\",\n" +
            "\t\ttext: \"南：青石大道 ↓\"\n" +
            "\t})\n" +
            "},\n" +
            "{\n" +
            "\tname: \"魔教休息室\",\n" +
            "\t//地图名称text: Array(\"一间很大的睡房\",\n" +
            "\t\"似乎没有分男女\",\n" +
            "\t\"西：护教居\"),\n" +
            "\t//描述判定npc: Array(),\n" +
            "\t//npcdirection: Array(//可去路径{\n" +
            "\t\tname: \"护教居[1]\",\n" +
            "\t\ttext: \"西：护教居 ←\"\n" +
            "\t})\n" +
            "},\n" +
            "{\n" +
            "\tname: \"大石门\",\n" +
            "\t//地图名称text: Array(\"一座很大的石门\",\n" +
            "\t\"南：护教居 ↓\",\n" +
            "\t\"北：护法居 ↑\"),\n" +
            "\t//描述判定npc: Array(\"教众\"),\n" +
            "\t//npcdirection: Array(//可去路径{\n" +
            "\t\tname: \"护教居[1]\",\n" +
            "\t\ttext: \"南：护教居 ↓\"\n" +
            "\t},\n" +
            "\t{\n" +
            "\t\tname: \"护法居[2]\",\n" +
            "\t\ttext: \"北：护法居 ↑\"\n" +
            "\t})\n" +
            "},\n" +
            "{\n" +
            "\tname: \"护法居[2]\",\n" +
            "\t//地图名称text: Array(\"北：议事厅\",\n" +
            "\t\"南：大石门\",\n" +
            "\t\"屋前有几棵大槐树\"),\n" +
            "\t//描述判定npc: Array(\"蓝衣护法\",\n" +
            "\t\"黄衣护法\",\n" +
            "\t\"白衣护法\",\n" +
            "\t\"红衣护法\"),\n" +
            "\t//npcdirection: Array(//可去路径{\n" +
            "\t\tname: \"议事厅\",\n" +
            "\t\ttext: \"北：议事厅 ↑\"\n" +
            "\t},\n" +
            "\t{\n" +
            "\t\tname: \"大石门\",\n" +
            "\t\ttext: \"南：大石门 ↓\"\n" +
            "\t})\n" +
            "},\n" +
            "{\n" +
            "\tname: \"议事厅\",\n" +
            "\t//地图名称text: Array(\"这是乾意神教议事的地方\",\n" +
            "\t\"北：白玉牌楼\",\n" +
            "\t\"南：护法居 ↓\"),\n" +
            "\t//描述判定npc: Array(\"童堂主\",\n" +
            "\t\"罗堂主\"),\n" +
            "\t//npcdirection: Array(//可去路径{\n" +
            "\t\tname: \"白玉牌楼\",\n" +
            "\t\ttext: \"北：白玉牌楼 ↑\"\n" +
            "\t},\n" +
            "\t{\n" +
            "\t\tname: \"东殿\",\n" +
            "\t\ttext: \"东：东殿 →\"\n" +
            "\t},\n" +
            "\t{\n" +
            "\t\tname: \"护法居[2]\",\n" +
            "\t\ttext: \"南：护法居 ↓\"\n" +
            "\t})\n" +
            "},\n" +
            "{\n" +
            "\tname: \"东殿\",\n" +
            "\t//地图名称text: Array(\"一间殿堂\",\n" +
            "\t\"很是安静\",\n" +
            "\t\"西：议事厅 ←\"),\n" +
            "\t//描述判定npc: Array(\"沈仙衣\",\n" +
            "\t\"于兰天武\"),\n" +
            "\t//npcdirection: Array(//可去路径{\n" +
            "\t\tname: \"议事厅\",\n" +
            "\t\ttext: \"西：议事厅 ←\"\n" +
            "\t})\n" +
            "},\n" +
            "{\n" +
            "\tname: \"青龙大街\",\n" +
            "\t//地图名称text: Array(\"北：化生寺 ↑\",\n" +
            "\t\"西：长安城广场\",\n" +
            "\t\"东：青龙门\"),\n" +
            "\t//描述判定npc: Array(\"大狼狗\",\n" +
            "\t\"春游女孩\",\n" +
            "\t\"游人\",\n" +
            "\t\"打手\"),\n" +
            "\t//npcdirection: Array(//可去路径{\n" +
            "\t\tname: \"化生寺\",\n" +
            "\t\ttext: \"北：化生寺 ↑\"\n" +
            "\t},\n" +
            "\t{\n" +
            "\t\tname: \"长安城广场\",\n" +
            "\t\ttext: \"西：长安城广场 ←\"\n" +
            "\t},\n" +
            "\t{\n" +
            "\t\tname: \"青龙门\",\n" +
            "\t\ttext: \"东：青龙门 →\"\n" +
            "\t},\n" +
            "\t{\n" +
            "\t\tname: \"朱云商店\",\n" +
            "\t\ttext: \"南：朱云商店 ↓\"\n" +
            "\t})\n" +
            "},\n" +
            "{\n" +
            "\tname: \"化生寺\",\n" +
            "\t//地图名称text: Array(\"这是一座洒扫得很干净的寺庙\",\n" +
            "\t\"北：化生寺内\",\n" +
            "\t\"南：青龙大街\"),\n" +
            "\t//描述判定npc: Array(\"春游女孩\",\n" +
            "\t\"游人\"),\n" +
            "\t//npcdirection: Array(//可去路径{\n" +
            "\t\tname: \"化生寺内\",\n" +
            "\t\ttext: \"北：化生寺内 ↑\"\n" +
            "\t},\n" +
            "\t{\n" +
            "\t\tname: \"青龙大街\",\n" +
            "\t\ttext: \"南：青龙大街 ↓\"\n" +
            "\t})\n" +
            "},\n" +
            "{\n" +
            "\tname: \"化生寺内\",\n" +
            "\t//地图名称text: Array(\"这里是化生寺内\",\n" +
            "\t\"在这里你可以拜佛祖以减少自己的罪过\",\n" +
            "\t\"南：化生寺\"),\n" +
            "\t//描述判定npc: Array(\"苏星河\"),\n" +
            "\t//npcdirection: Array(//可去路径{\n" +
            "\t\tname: \"化生寺\",\n" +
            "\t\ttext: \"南：化生寺 ↓\"\n" +
            "\t})\n" +
            "},\n" +
            "{\n" +
            "\tname: \"朱云商店\",\n" +
            "\t//地图名称text: Array(\"女老板是老英雄朱振远的小女儿\",\n" +
            "\t\"也是振远镖局二老板\",\n" +
            "\t\"北：青龙大街\"),\n" +
            "\t//描述判定npc: Array(\"朱云\"),\n" +
            "\t//npcdirection: Array(//可去路径{\n" +
            "\t\tname: \"青龙大街\",\n" +
            "\t\ttext: \"北：青龙大街 ↑\"\n" +
            "\t})\n" +
            "},\n" +
            "{\n" +
            "\tname: \"青龙门\",\n" +
            "\t//地图名称text: Array(\"这是长安城的东城门\",\n" +
            "\t\"西：青龙大街\"),\n" +
            "\t//描述判定npc: Array(\"守城武将\",\n" +
            "\t\"守城小兵\"),\n" +
            "\t//npcdirection: Array(//可去路径{\n" +
            "\t\tname: \"青龙大街\",\n" +
            "\t\ttext: \"西：青龙大街 ←\"\n" +
            "\t},\n" +
            "\t{\n" +
            "\t\tname: \"长安东驿道[1]\",\n" +
            "\t\ttext: \"东：驿道 →\"\n" +
            "\t})\n" +
            "},\n" +
            "{\n" +
            "\tname: \"长安东驿道[1]\",\n" +
            "\t//地图名称text: Array(\"北：黄土路 ↑\",\n" +
            "\t\"西：青龙门\",\n" +
            "\t\"东：华山脚下\"),\n" +
            "\t//描述判定npc: Array(\"酸秀才\",\n" +
            "\t\"游人\",\n" +
            "\t\"行人\"),\n" +
            "\t//npcdirection: Array(//可去路径{\n" +
            "\t\tname: \"黄土路[1]\",\n" +
            "\t\ttext: \"北：黄土路 ↑\"\n" +
            "\t},\n" +
            "\t{\n" +
            "\t\tname: \"青龙门\",\n" +
            "\t\ttext: \"西：青龙门 ←\"\n" +
            "\t},\n" +
            "\t{\n" +
            "\t\tname: \"华山脚下\",\n" +
            "\t\ttext: \"东：华山脚下 →\"\n" +
            "\t})\n" +
            "},\n" +
            "{\n" +
            "\tname: \"黄土路[1]\",\n" +
            "\t//地图名称text: Array(\"你走在一条尘土飞扬的黄土路上\",\n" +
            "\t\"北：黄土路\",\n" +
            "\t\"南：驿道\"),\n" +
            "\t//描述判定npc: Array(\"土匪头\",\n" +
            "\t\"土匪\"),\n" +
            "\t//npcdirection: Array(//可去路径{\n" +
            "\t\tname: \"黄土路[2]\",\n" +
            "\t\ttext: \"北：黄土路 ↑\"\n" +
            "\t},\n" +
            "\t{\n" +
            "\t\tname: \"长安东驿道[1]\",\n" +
            "\t\ttext: \"南：驿道 ↓\"\n" +
            "\t})\n" +
            "},\n" +
            "{\n" +
            "\tname: \"黄土路[2]\",\n" +
            "\t//地图名称text: Array(\"你走在一条尘土飞扬的黄土路上\",\n" +
            "\t\"东：黄土路\",\n" +
            "\t\"南：黄土路\"),\n" +
            "\t//描述判定npc: Array(\"土匪头\",\n" +
            "\t\"土匪\"),\n" +
            "\t//npcdirection: Array(//可去路径{\n" +
            "\t\tname: \"黄土路[3]\",\n" +
            "\t\ttext: \"东：黄土路 →\"\n" +
            "\t},\n" +
            "\t{\n" +
            "\t\tname: \"黄土路[1]\",\n" +
            "\t\ttext: \"南：黄土路 ↓\"\n" +
            "\t})\n" +
            "},\n" +
            "{\n" +
            "\tname: \"黄土路[3]\",\n" +
            "\t//地图名称text: Array(\"你走在一条尘土飞扬的黄土路上\",\n" +
            "\t\"北：黄土路\",\n" +
            "\t\"西：黄土路\"),\n" +
            "\t//描述判定npc: Array(\"小喽罗\"),\n" +
            "\t//npcdirection: Array(//可去路径{\n" +
            "\t\tname: \"黄土路[4]\",\n" +
            "\t\ttext: \"北：黄土路 ↑\"\n" +
            "\t},\n" +
            "\t{\n" +
            "\t\tname: \"黄土路[2]\",\n" +
            "\t\ttext: \"西：黄土路 ←\"\n" +
            "\t})\n" +
            "},\n" +
            "{\n" +
            "\tname: \"黄土路[4]\",\n" +
            "\t//地图名称text: Array(\"你走在一条尘土飞扬的黄土路上\",\n" +
            "\t\"南：黄土路\"),\n" +
            "\t//描述判定npc: Array(\"土匪头\",\n" +
            "\t\"土匪\"),\n" +
            "\t//npcdirection: Array(//可去路径{\n" +
            "\t\tname: \"黄土路[3]\",\n" +
            "\t\ttext: \"南：黄土路 ↓\"\n" +
            "\t})\n" +
            "},\n" +
            "{\n" +
            "\tname: \"华山脚下\",\n" +
            "\t//地图名称text: Array(\"这里是华山脚下\",\n" +
            "\t\"东：潼关\",\n" +
            "\t\"南：华山 ↓\"),\n" +
            "\t//描述判定npc: Array(\"男孩\",\n" +
            "\t\"春游女孩\",\n" +
            "\t\"游人\"),\n" +
            "\t//npcdirection: Array(//可去路径{\n" +
            "\t\tname: \"长安东驿道[1]\",\n" +
            "\t\ttext: \"西：驿道 ←\"\n" +
            "\t},\n" +
            "\t{\n" +
            "\t\tname: \"潼关\",\n" +
            "\t\ttext: \"东：潼关 →\"\n" +
            "\t},\n" +
            "\t{\n" +
            "\t\tname: \"华山\",\n" +
            "\t\ttext: \"南：华山 ↓\"\n" +
            "\t})\n" +
            "},\n" +
            "{\n" +
            "\tname: \"华山\",\n" +
            "\t//地图名称text: Array(\"西岳华山，巍然耸立于陕西省华阴县城南\",\n" +
            "\t\"北：华山脚下\",\n" +
            "\t\"南：莎萝坪\"),\n" +
            "\t//描述判定npc: Array(\"妙手郎中\"),\n" +
            "\t//npcdirection: Array(//可去路径{\n" +
            "\t\tname: \"华山脚下\",\n" +
            "\t\ttext: \"北：华山脚下 ↑\"\n" +
            "\t},\n" +
            "\t{\n" +
            "\t\tname: \"莎萝坪\",\n" +
            "\t\ttext: \"南：莎萝坪 ↓\"\n" +
            "\t})\n" +
            "},\n" +
            "{\n" +
            "\tname: \"莎萝坪\",\n" +
            "\t//地图名称text: Array(\"沿着玉泉，踏过累累石涧\",\n" +
            "\t\"北：华山\",\n" +
            "\t\"南：云门\"),\n" +
            "\t//描述判定npc: Array(\"游客\",\n" +
            "\t\"江湖豪客\"),\n" +
            "\t//npcdirection: Array(//可去路径{\n" +
            "\t\tname: \"华山\",\n" +
            "\t\ttext: \"北：华山 ↑\"\n" +
            "\t},\n" +
            "\t{\n" +
            "\t\tname: \"村口\",\n" +
            "\t\ttext: \"东：村口 →\"\n" +
            "\t},\n" +
            "\t{\n" +
            "\t\tname: \"云门\",\n" +
            "\t\ttext: \"南：云门 ↓\"\n" +
            "\t})\n" +
            "},\n" +
            "{\n" +
            "\tname: \"村口\",\n" +
            "\t//地图名称text: Array(\"这里是华山脚下，虽然远离县城\",\n" +
            "\t\"西：莎萝坪\",\n" +
            "\t\"东：碎石路\"),\n" +
            "\t//描述判定npc: Array(\"王小二\",\n" +
            "\t\"小流氓\"),\n" +
            "\t//npcdirection: Array(//可去路径{\n" +
            "\t\tname: \"莎萝坪\",\n" +
            "\t\ttext: \"西：莎萝坪 ←\"\n" +
            "\t},\n" +
            "\t{\n" +
            "\t\tname: \"华山碎石路\",\n" +
            "\t\ttext: \"东：碎石路 →\"\n" +
            "\t})\n" +
            "},\n" +
            "{\n" +
            "\tname: \"华山碎石路\",\n" +
            "\t//地图名称text: Array(\"这是一个宁静的小村子\",\n" +
            "\t\"东：打谷场\",\n" +
            "\t\"南：铁匠铺\"),\n" +
            "\t//描述判定npc: Array(\"李铁嘴\",\n" +
            "\t\"流氓\"),\n" +
            "\t//npcdirection: Array(//可去路径{\n" +
            "\t\tname: \"华山民宅[1]\",\n" +
            "\t\ttext: \"北：民宅 ↑\"\n" +
            "\t},\n" +
            "\t{\n" +
            "\t\tname: \"村口\",\n" +
            "\t\ttext: \"西：村口 ←\"\n" +
            "\t},\n" +
            "\t{\n" +
            "\t\tname: \"打谷场\",\n" +
            "\t\ttext: \"东：打谷场 →\"\n" +
            "\t},\n" +
            "\t{\n" +
            "\t\tname: \"华山铁匠铺\",\n" +
            "\t\ttext: \"南：铁匠铺 ↓\"\n" +
            "\t})\n" +
            "},\n" +
            "{\n" +
            "\tname: \"华山民宅[1]\",\n" +
            "\t//地图名称text: Array(\"这是一间很结实的房子\",\n" +
            "\t\"但看的出建造的比村里其他的土坯房要好很多\",\n" +
            "\t\"南：碎石路\"),\n" +
            "\t//描述判定npc: Array(\"地保\"),\n" +
            "\t//npcdirection: Array(//可去路径{\n" +
            "\t\tname: \"华山碎石路\",\n" +
            "\t\ttext: \"南：碎石路 ↓\"\n" +
            "\t})\n" +
            "},\n" +
            "{\n" +
            "\tname: \"打谷场\",\n" +
            "\t//地图名称text: Array(\"这里是村子的中心，一个平坦的广场\",\n" +
            "\t\"西：碎石路\",\n" +
            "\t\"南：草棚\"),\n" +
            "\t//描述判定npc: Array(\"女孩\",\n" +
            "\t\"男孩\"),\n" +
            "\t//npcdirection: Array(//可去路径{\n" +
            "\t\tname: \"华山碎石路\",\n" +
            "\t\ttext: \"西：碎石路 ←\"\n" +
            "\t},\n" +
            "\t{\n" +
            "\t\tname: \"华山草棚\",\n" +
            "\t\ttext: \"南：草棚 ↓\"\n" +
            "\t})\n" +
            "},\n" +
            "{\n" +
            "\tname: \"华山草棚\",\n" +
            "\t//地图名称text: Array(\"这是一个简单的草棚\",\n" +
            "\t\"地上摆著一堆堆的货物\",\n" +
            "\t\"北：打谷场\"),\n" +
            "\t//描述判定npc: Array(\"小贩\"),\n" +
            "\t//npcdirection: Array(//可去路径{\n" +
            "\t\tname: \"打谷场\",\n" +
            "\t\ttext: \"北：打谷场 ↑\"\n" +
            "\t})\n" +
            "},\n" +
            "{\n" +
            "\tname: \"华山铁匠铺\",\n" +
            "\t//地图名称text: Array(\"这是一间甚是简陋的铁匠铺\",\n" +
            "\t\"北：碎石路 ↑\"),\n" +
            "\t//描述判定npc: Array(\"冯铁匠\"),\n" +
            "\t//npcdirection: Array(//可去路径{\n" +
            "\t\tname: \"华山碎石路\",\n" +
            "\t\ttext: \"北：碎石路 ↑\"\n" +
            "\t})\n" +
            "},\n" +
            "{\n" +
            "\tname: \"云门\",\n" +
            "\t//地图名称text: Array(\"过莎萝坪，是华山十八盘\",\n" +
            "\t\"北：莎萝坪\",\n" +
            "\t\"南：青柯坪\"),\n" +
            "\t//描述判定npc: Array(\"游客\"),\n" +
            "\t//npcdirection: Array(//可去路径{\n" +
            "\t\tname: \"莎萝坪\",\n" +
            "\t\ttext: \"北：莎萝坪 ↑\"\n" +
            "\t},\n" +
            "\t{\n" +
            "\t\tname: \"青柯坪\",\n" +
            "\t\ttext: \"南：青柯坪 ↓\"\n" +
            "\t})\n" +
            "},\n" +
            "{\n" +
            "\tname: \"青柯坪\",\n" +
            "\t//地图名称text: Array(\"青柯坪是一山间盆地，地势略为平坦\",\n" +
            "\t\"北：云门 ↑\",\n" +
            "\t\"东：老君沟\"),\n" +
            "\t//描述判定npc: Array(\"梁发\",\n" +
            "\t\"游客\"),\n" +
            "\t//npcdirection: Array(//可去路径{\n" +
            "\t\tname: \"云门\",\n" +
            "\t\ttext: \"北：云门 ↑\"\n" +
            "\t},\n" +
            "\t{\n" +
            "\t\tname: \"老君沟\",\n" +
            "\t\ttext: \"东：老君沟 →\"\n" +
            "\t})\n" +
            "},\n" +
            "{\n" +
            "\tname: \"老君沟\",\n" +
            "\t//地图名称text: Array(\"老君沟是一条半里多长的山沟\",\n" +
            "\t\"西：青柯坪 ←\"),\n" +
            "\t//描述判定npc: Array(\"劳德诺\"),\n" +
            "\t//npcdirection: Array(//可去路径{\n" +
            "\t\tname: \"青柯坪\",\n" +
            "\t\ttext: \"西：青柯坪 ←\"\n" +
            "\t},\n" +
            "\t{\n" +
            "\t\tname: \"镇岳宫\",\n" +
            "\t\ttext: \"南：镇岳宫 ↓\"\n" +
            "\t})\n" +
            "},\n" +
            "{\n" +
            "\tname: \"镇岳宫\",\n" +
            "\t//地图名称text: Array(\"镇岳宫倚壁而构，四边松林蔽日\",\n" +
            "\t\"北：老君沟 ↑\",\n" +
            "\t\"东：玉女峰\"),\n" +
            "\t//描述判定npc: Array(\"高根明\",\n" +
            "\t\"山贼头\"),\n" +
            "\t//npcdirection: Array(//可去路径{\n" +
            "\t\tname: \"老君沟\",\n" +
            "\t\ttext: \"北：老君沟 ↑\"\n" +
            "\t},\n" +
            "\t{\n" +
            "\t\tname: \"华山桃花林[1]\",\n" +
            "\t\ttext: \"西：桃花林 ←\"\n" +
            "\t},\n" +
            "\t{\n" +
            "\t\tname: \"玉女峰\",\n" +
            "\t\ttext: \"东：玉女峰 →\"\n" +
            "\t},\n" +
            "\t{\n" +
            "\t\tname: \"华山桃花林[2]\",\n" +
            "\t\ttext: \"南：桃花林 ↓\"\n" +
            "\t})\n" +
            "},\n" +
            "{\n" +
            "\tname: \"华山桃花林[1]\",\n" +
            "\t//地图名称text: Array(\"清幽的小谷，遍地桃花\",\n" +
            "\t\"东：镇岳宫 →\"),\n" +
            "\t//描述判定npc: Array(\"桃实仙\",\n" +
            "\t\"桃花仙\",\n" +
            "\t\"桃干仙\"),\n" +
            "\t//npcdirection: Array(//可去路径{\n" +
            "\t\tname: \"镇岳宫\",\n" +
            "\t\ttext: \"东：镇岳宫 →\"\n" +
            "\t})\n" +
            "},\n" +
            "{\n" +
            "\tname: \"华山桃花林[2]\",\n" +
            "\t//地图名称text: Array(\"清幽的小谷，遍地桃花\",\n" +
            "\t\"北：镇岳宫\"),\n" +
            "\t//描述判定npc: Array(\"桃枝仙\",\n" +
            "\t\"桃根仙\",\n" +
            "\t\"桃叶仙\"),\n" +
            "\t//npcdirection: Array(//可去路径{\n" +
            "\t\tname: \"镇岳宫\",\n" +
            "\t\ttext: \"北：镇岳宫 ↑\"\n" +
            "\t})\n" +
            "},\n" +
            "{\n" +
            "\tname: \"玉女峰\",\n" +
            "\t//地图名称text: Array(\"这里是华山的中峰，玉女峰\",\n" +
            "\t\"西：镇岳宫\"),\n" +
            "\t//描述判定npc: Array(\"岳灵珊\",\n" +
            "\t\"游客\"),\n" +
            "\t//npcdirection: Array(//可去路径{\n" +
            "\t\tname: \"华山练武场\",\n" +
            "\t\ttext: \"北：练武场 ↑\"\n" +
            "\t},\n" +
            "\t{\n" +
            "\t\tname: \"镇岳宫\",\n" +
            "\t\ttext: \"西：镇岳宫 ←\"\n" +
            "\t},\n" +
            "\t{\n" +
            "\t\tname: \"舍身崖\",\n" +
            "\t\ttext: \"东：舍身崖 →\"\n" +
            "\t},\n" +
            "\t{\n" +
            "\t\tname: \"思过崖\",\n" +
            "\t\ttext: \"南：思过崖 ↓\"\n" +
            "\t})\n" +
            "{\n" +
            "\tname: \"思过崖\",\n" +
            "\t//地图名称text: Array(\"这是华山的思过崖\",\n" +
            "\t\"北：玉女峰\"),\n" +
            "\t//描述判定npc: Array(\"令狐冲\",\n" +
            "\t\"风清扬\"),\n" +
            "\t//npcdirection: Array(//可去路径{\n" +
            "\t\tname: \"玉女峰\",\n" +
            "\t\ttext: \"北：玉女峰 ↑\"\n" +
            "\t})\n" +
            "},\n" +
            "{\n" +
            "\tname: \"华山练武场\",\n" +
            "\t//地图名称text: Array(\"这里是华山派的练武场\",\n" +
            "\t\"北：群仙观\"),\n" +
            "\t//描述判定npc: Array(\"林平之\",\n" +
            "\t\"江湖豪客\"),\n" +
            "\t//npcdirection: Array(//可去路径{\n" +
            "\t\tname: \"群仙观\",\n" +
            "\t\ttext: \"北：群仙观 ↑\"\n" +
            "\t},\n" +
            "\t{\n" +
            "\t\tname: \"朝阳峰[1]\",\n" +
            "\t\ttext: \"西：朝阳峰 ←\"\n" +
            "\t},\n" +
            "\t{\n" +
            "\t\tname: \"华山兵器房\",\n" +
            "\t\ttext: \"东：兵器房 →\"\n" +
            "\t},\n" +
            "\t{\n" +
            "\t\tname: \"玉女峰\",\n" +
            "\t\ttext: \"南：玉女峰 ↓\"\n" +
            "\t})\n" +
            "},\n" +
            "{\n" +
            "\tname: \"华山兵器房\",\n" +
            "\t//地图名称text: Array(\"这里是华山派的兵器房\",\n" +
            "\t\"西：练武场\"),\n" +
            "\t//描述判定npc: Array(),\n" +
            "\t//npcdirection: Array(//可去路径{\n" +
            "\t\tname: \"华山练武场\",\n" +
            "\t\ttext: \"西：练武场 ←\"\n" +
            "\t})\n" +
            "},\n" +
            "{\n" +
            "\tname: \"朝阳峰[1]\",\n" +
            "\t//地图名称text: Array(\"这里是朝阳峰小路，山势陡峭\",\n" +
            "\t\"东：练武场\"),\n" +
            "\t//描述判定npc: Array(\"成不忧\",\n" +
            "\t\"施戴子\"),\n" +
            "\t//npcdirection: Array(//可去路径{\n" +
            "\t\tname: \"华山练武场\",\n" +
            "\t\ttext: \"东：练武场 →\"\n" +
            "\t})\n" +
            "},\n" +
            "{\n" +
            "\tname: \"群仙观\",\n" +
            "\t//地图名称text: Array(\"这里是华山派历来之根本重地\",\n" +
            "\t\"北：有所不为轩\",\n" +
            "\t\"东：华山休息室\"),\n" +
            "\t//描述判定npc: Array(\"陆大有\"),\n" +
            "\t//npcdirection: Array(//可去路径{\n" +
            "\t\tname: \"有所不为轩\",\n" +
            "\t\ttext: \"北：有所不为轩 ↑\"\n" +
            "\t},\n" +
            "\t{\n" +
            "\t\tname: \"华山休息室\",\n" +
            "\t\ttext: \"东：华山休息室 →\"\n" +
            "\t},\n" +
            "\t{\n" +
            "\t\tname: \"华山练武场\",\n" +
            "\t\ttext: \"南：练武场 ↓\"\n" +
            "\t})\n" +
            "},\n" +
            "{\n" +
            "\tname: \"有所不为轩\",\n" +
            "\t//地图名称text: Array(\"这是华山掌门岳不群的居所\",\n" +
            "\t\"南：群仙观\"),\n" +
            "\t//描述判定npc: Array(),\n" +
            "\t//npcdirection: Array(//可去路径{\n" +
            "\t\tname: \"群仙观\",\n" +
            "\t\ttext: \"南：群仙观 ↓\"\n" +
            "\t})\n" +
            "},\n" +
            "{\n" +
            "\tname: \"华山休息室\",\n" +
            "\t//地图名称text: Array(\"这里是华山派的休息室\",\n" +
            "\t\"西：群仙观\"),\n" +
            "\t//描述判定npc: Array(),\n" +
            "\t//npcdirection: Array(//可去路径{\n" +
            "\t\tname: \"群仙观\",\n" +
            "\t\ttext: \"西：群仙观 ←\"\n" +
            "\t})\n" +
            "},\n" +
            "{\n" +
            "\tname: \"舍身崖\",\n" +
            "\t//地图名称text: Array(\"这是一段极窄极险的山崖\",\n" +
            "\t\"西：玉女峰\",\n" +
            "\t\"东：上天梯\"),\n" +
            "\t//描述判定npc: Array(\"黄真\"),\n" +
            "\t//npcdirection: Array(//可去路径{\n" +
            "\t\tname: \"苍龙岭\",\n" +
            "\t\ttext: \"北：苍龙岭 ↑\"\n" +
            "\t},\n" +
            "\t{\n" +
            "\t\tname: \"玉女峰\",\n" +
            "\t\ttext: \"西：玉女峰 ←\"\n" +
            "\t},\n" +
            "\t{\n" +
            "\t\tname: \"上天梯\",\n" +
            "\t\ttext: \"东：上天梯 →\"\n" +
            "\t},\n" +
            "\t{\n" +
            "\t\tname: \"玉女祠\",\n" +
            "\t\ttext: \"南：玉女祠 ↓\"\n" +
            "\t})\n" +
            "},\n" +
            "{\n" +
            "\tname: \"苍龙岭\",\n" +
            "\t//地图名称text: Array(\"北峰之上最陡峭的则是苍龙岭\",\n" +
            "\t\"南：舍身崖\"),\n" +
            "\t//描述判定npc: Array(\"穆人清\"),\n" +
            "\t//npcdirection: Array(//可去路径{\n" +
            "\t\tname: \"舍身崖\",\n" +
            "\t\ttext: \"南：舍身崖 ↓\"\n" +
            "\t})\n" +
            "},\n" +
            "{\n" +
            "\tname: \"玉女祠\",\n" +
            "\t//地图名称text: Array(\"玉女祠里供奉的到底是哪位玉女\",\n" +
            "\t\"北：舍身崖 ↑\"),\n" +
            "\t//描述判定npc: Array(\"夏青青\"),\n" +
            "\t//npcdirection: Array(//可去路径{\n" +
            "\t\tname: \"舍身崖\",\n" +
            "\t\ttext: \"北：舍身崖 ↓\"\n" +
            "\t})\n" +
            "},\n" +
            "{\n" +
            "\tname: \"上天梯\",\n" +
            "\t//地图名称text: Array(\"此处绝险，必须面壁挽索\",\n" +
            "\t\"北：紫气台\",\n" +
            "\t\"西：舍身崖\"),\n" +
            "\t//描述判定npc: Array(\"归辛树\",\n" +
            "\t\"归二娘\"),\n" +
            "\t//npcdirection: Array(//可去路径{\n" +
            "\t\tname: \"紫气台\",\n" +
            "\t\ttext: \"北：紫气台 ↑\"\n" +
            "\t},\n" +
            "\t{\n" +
            "\t\tname: \"舍身崖\",\n" +
            "\t\ttext: \"西：舍身崖 ←\"\n" +
            "\t},\n" +
            "\t{\n" +
            "\t\tname: \"朝阳峰[2]\",\n" +
            "\t\ttext: \"东：朝阳峰 →\"\n" +
            "\t})\n" +
            "},\n" +
            "{\n" +
            "\tname: \"朝阳峰[2]\",\n" +
            "\t//地图名称text: Array(\"这里就是华山的东峰，也称朝阳峰\",\n" +
            "\t\"西：上天梯\"),\n" +
            "\t//描述判定npc: Array(\"木桑道人\"),\n" +
            "\t//npcdirection: Array(//可去路径{\n" +
            "\t\tname: \"上天梯\",\n" +
            "\t\ttext: \"西：上天梯 ←\"\n" +
            "\t})\n" +
            "},\n" +
            "{\n" +
            "\tname: \"紫气台\",\n" +
            "\t//地图名称text: Array(\"紫气台终年云遮雾掩，迷蒙不见天日\",\n" +
            "\t\"南：上天梯\"),\n" +
            "\t//描述判定npc: Array(\"袁承志\"),\n" +
            "\t//npcdirection: Array(//可去路径{\n" +
            "\t\tname: \"上天梯\",\n" +
            "\t\ttext: \"南：上天梯 ↓\"\n" +
            "\t})\n" +
            "},\n" +
            "{\n" +
            "\tname: \"潼关\",\n" +
            "\t//地图名称text: Array(\"这里地势险峻，是古来兵家必争之地\",\n" +
            "\t\"西：华山脚下\"),\n" +
            "\t//描述判定npc: Array(\"独行盗\"),\n" +
            "\t//npcdirection: Array(//可去路径{\n" +
            "\t\tname: \"华山脚下\",\n" +
            "\t\ttext: \"西：华山脚下 ←\"\n" +
            "\t},\n" +
            "\t{\n" +
            "\t\tname: \"潼关东驿道[1]\",\n" +
            "\t\ttext: \"东：驿道 →\"\n" +
            "\t})\n" +
            "},\n" +
            "{\n" +
            "\tname: \"潼关东驿道[1]\",\n" +
            "\t//地图名称text: Array(\"西：潼关 ←\",\n" +
            "\t\"东：驿道\"),\n" +
            "\t//描述判定npc: Array(),\n" +
            "\t//npcdirection: Array(//可去路径{\n" +
            "\t\tname: \"潼关\",\n" +
            "\t\ttext: \"西：潼关 ←\"\n" +
            "\t},\n" +
            "\t{\n" +
            "\t\tname: \"潼关东驿道[2]\",\n" +
            "\t\ttext: \"东：驿道 →\"\n" +
            "\t})\n" +
            "},\n" +
            "{\n" +
            "\tname: \"潼关东驿道[2]\",\n" +
            "\t//地图名称text: Array(\"西：驿道 ←\",\n" +
            "\t\"东：洛阳西门\"),\n" +
            "\t//描述判定npc: Array(),\n" +
            "\t//npcdirection: Array(//可去路径{\n" +
            "\t\tname: \"潼关东驿道[1]\",\n" +
            "\t\ttext: \"西：驿道 ←\"\n" +
            "\t},\n" +
            "\t{\n" +
            "\t\tname: \"洛阳西门\",\n" +
            "\t\ttext: \"东：洛阳西门 →\"\n" +
            "\t})\n" +
            "},\n" +
            "{\n" +
            "\tname: \"洛阳西门\",\n" +
            "\t//地图名称text: Array(\"西：驿道 ←\",\n" +
            "\t\"东：洛阳西街\"),\n" +
            "\t//描述判定npc: Array(),\n" +
            "\t//npcdirection: Array(//可去路径{\n" +
            "\t\tname: \"潼关东驿道[2]\",\n" +
            "\t\ttext: \"西：驿道 ←\"\n" +
            "\t},\n" +
            "\t{\n" +
            "\t\tname: \"洛阳西街\",\n" +
            "\t\ttext: \"东：洛阳西街 →\"\n" +
            "\t})\n" +
            "},\n" +
            "{\n" +
            "\tname: \"洛阳西街\",\n" +
            "\t//地图名称text: Array(\"一条繁华的大街。\",\n" +
            "\t\"北：老君山 ↑\",\n" +
            "\t\"南：龙门石窟 ↓\"),\n" +
            "\t//描述判定npc: Array(),\n" +
            "\t//npcdirection: Array(//可去路径{\n" +
            "\t\tname: \"老君山\",\n" +
            "\t\ttext: \"北：老君山 ↑\"\n" +
            "\t},\n" +
            "\t{\n" +
            "\t\tname: \"洛阳西门\",\n" +
            "\t\ttext: \"西：洛阳西门 ←\"\n" +
            "\t},\n" +
            "\t{\n" +
            "\t\tname: \"洛阳中心\",\n" +
            "\t\ttext: \"东：洛阳中心 →\"\n" +
            "\t},\n" +
            "\t{\n" +
            "\t\tname: \"龙门石窟\",\n" +
            "\t\ttext: \"南：龙门石窟 ↓\"\n" +
            "\t})\n" +
            "},\n" +
            "{\n" +
            "\tname: \"老君山\",\n" +
            "\t//地图名称text: Array(\"一座风景秀丽的大山\",\n" +
            "\t\"北：静翠湖 ↑\",\n" +
            "\t\"南：洛阳西街\"),\n" +
            "\t//描述判定npc: Array(\"神教黄衣教众\",\n" +
            "\t\"神教蓝衣教众\",\n" +
            "\t\"神教教众头目\",\n" +
            "\t\"神教绿衣教众\",\n" +
            "\t\"神教红衣教众\",\n" +
            "\t\"神教青衣教众\",\n" +
            "\t\"神教紫衣教众\",\n" +
            "\t\"神教橙衣教众\"),\n" +
            "\t//npcdirection: Array(//可去路径{\n" +
            "\t\tname: \"静翠湖\",\n" +
            "\t\ttext: \"北：静翠湖 ↑\"\n" +
            "\t},\n" +
            "\t{\n" +
            "\t\tname: \"老君山宅院\",\n" +
            "\t\ttext: \"西：宅院 ←\"\n" +
            "\t},\n" +
            "\t{\n" +
            "\t\tname: \"洛阳西街\",\n" +
            "\t\ttext: \"南：洛阳西街 ↓\"\n" +
            "\t})\n" +
            "},\n" +
            "{\n" +
            "\tname: \"静翠湖\",\n" +
            "\t//地图名称text: Array(\"一片碧波荡漾的湖水\",\n" +
            "\t\"南：老君山 ↓\"),\n" +
            "\t//描述判定npc: Array(\"绯衣女子\"),\n" +
            "\t//npcdirection: Array(//可去路径{\n" +
            "\t\tname: \"老君山\",\n" +
            "\t\ttext: \"南：老君山 ↓\"\n" +
            "\t})\n" +
            "},\n" +
            "{\n" +
            "\tname: \"老君山宅院\",\n" +
            "\t//地图名称text: Array(\"一处僻静的宅院，不知道里面有什么人\",\n" +
            "\t\"东：老君山 →\"),\n" +
            "\t//描述判定npc: Array(\"神秘女子\"),\n" +
            "\t//npcdirection: Array(//可去路径{\n" +
            "\t\tname: \"老君山野外\",\n" +
            "\t\ttext: \"北：野外 ↑\"\n" +
            "\t},\n" +
            "\t{\n" +
            "\t\tname: \"老君山\",\n" +
            "\t\ttext: \"东：老君山 →\"\n" +
            "\t})\n" +
            "},\n" +
            "{\n" +
            "\tname: \"老君山野外\",\n" +
            "\t//地图名称text: Array(\"一处荒郊野外，中间有一群人\",\n" +
            "\t\"南：宅院 ↓\"),\n" +
            "\t//描述判定npc: Array(\"男村民\",\n" +
            "\t\"女村民\"),\n" +
            "\t//npcdirection: Array(//可去路径{\n" +
            "\t\tname: \"老君山宅院\",\n" +
            "\t\ttext: \"南：宅院 ↓\"\n" +
            "\t})\n" +
            "},\n" +
            "{\n" +
            "\tname: \"龙门石窟\",\n" +
            "\t//地图名称text: Array(\"这里是龙门石窟\",\n" +
            "\t\"北：洛阳西街 ↑\"),\n" +
            "\t//描述判定npc: Array(),\n" +
            "\t//npcdirection: Array(//可去路径{\n" +
            "\t\tname: \"洛阳西街\",\n" +
            "\t\ttext: \"北：洛阳西街 ↑\"\n" +
            "\t})\n" +
            "},\n" +
            "//----------------------------可怜的分割线------------------------------{\n" +
            "\tname: \"洛阳中心\",\n" +
            "\t//地图名称text: Array(\"洛阳城的中心，热闹非凡\",\n" +
            "\t\"北：洛阳北街\",\n" +
            "\t\"南：洛阳南街 ↓\"),\n" +
            "\t//描述判定npc: Array(\"楚留香\"),\n" +
            "\t//npcdirection: Array(//可去路径{\n" +
            "\t\tname: \"洛阳北街\",\n" +
            "\t\ttext: \"北：洛阳北街 ↑\"\n" +
            "\t},\n" +
            "\t{\n" +
            "\t\tname: \"洛阳西街\",\n" +
            "\t\ttext: \"西：洛阳西街 ←\"\n" +
            "\t},\n" +
            "\t{\n" +
            "\t\tname: \"洛阳东街\",\n" +
            "\t\ttext: \"东：洛阳东街 →\"\n" +
            "\t},\n" +
            "\t{\n" +
            "\t\tname: \"洛阳南街\",\n" +
            "\t\ttext: \"南：洛阳南街 ↓\"\n" +
            "\t})\n" +
            "},\n" +
            "{\n" +
            "\tname: \"洛阳北街\",\n" +
            "\t//地图名称text: Array(\"南：洛阳中心\",\n" +
            "\t\"一条繁华的大街。\",\n" +
            "\t\"北：洛阳北门\"),\n" +
            "\t//描述判定npc: Array(),\n" +
            "\t//npcdirection: Array(//可去路径{\n" +
            "\t\tname: \"洛阳北门\",\n" +
            "\t\ttext: \"北：洛阳北门 ↑\"\n" +
            "\t},\n" +
            "\t{\n" +
            "\t\tname: \"洛阳官邸\",\n" +
            "\t\ttext: \"西：官邸 ←\"\n" +
            "\t},\n" +
            "\t{\n" +
            "\t\tname: \"洛阳绿竹巷\",\n" +
            "\t\ttext: \"东：绿竹巷 →\"\n" +
            "\t},\n" +
            "\t{\n" +
            "\t\tname: \"洛阳中心\",\n" +
            "\t\ttext: \"南：洛阳中心 ↓\"\n" +
            "\t})\n" +
            "},\n" +
            "{\n" +
            "\tname: \"洛阳官邸\",\n" +
            "\t//地图名称text: Array(\"这是一座官邸，不知道住着什么达官贵人\",\n" +
            "\t\"东：洛阳北街 →\"),\n" +
            "\t//描述判定npc: Array(),\n" +
            "\t//npcdirection: Array(//可去路径{\n" +
            "\t\tname: \"洛阳北街\",\n" +
            "\t\ttext: \"东：洛阳北街 →\"\n" +
            "\t})\n" +
            "},\n" +
            "{\n" +
            "\tname: \"洛阳绿竹巷\",\n" +
            "\t//地图名称text: Array(\"一条静悄悄的小巷\",\n" +
            "\t\"西：洛阳北街 ←\"),\n" +
            "\t//描述判定npc: Array(\"任盈盈(任务)\"),\n" +
            "\t//npcdirection: Array(//可去路径{\n" +
            "\t\tname: \"洛阳北街\",\n" +
            "\t\ttext: \"西：洛阳北街 ←\"\n" +
            "\t})\n" +
            "},\n" +
            "{\n" +
            "\tname: \"洛阳北门\",\n" +
            "\t//地图名称text: Array(\"北：驿道\",\n" +
            "\t\"洛阳城的北门。\"),\n" +
            "\t//描述判定npc: Array(),\n" +
            "\t//npcdirection: Array(//可去路径{\n" +
            "\t\tname: \"洛阳北驿道[1]\",\n" +
            "\t\ttext: \"北：驿道 ↑\"\n" +
            "\t},\n" +
            "\t{\n" +
            "\t\tname: \"洛阳北街\",\n" +
            "\t\ttext: \"南：洛阳北街 ↓\"\n" +
            "\t})\n" +
            "},\n" +
            "{\n" +
            "\tname: \"洛阳北驿道[1]\",\n" +
            "\t//地图名称text: Array(\"北：驿道\",\n" +
            "\t\"南：洛阳北门\",\n" +
            "\t\"一条驿道静静的向远方延伸\"),\n" +
            "\t//描述判定npc: Array(),\n" +
            "\t//npcdirection: Array(//可去路径{\n" +
            "\t\tname: \"洛阳北驿道[2]\",\n" +
            "\t\ttext: \"北：驿道 ↑\"\n" +
            "\t},\n" +
            "\t{\n" +
            "\t\tname: \"洛阳北门\",\n" +
            "\t\ttext: \"南：洛阳北门 ↓\"\n" +
            "\t})\n" +
            "},\n" +
            "{\n" +
            "\tname: \"洛阳北驿道[2]\",\n" +
            "\t//地图名称text: Array(\"北：驿道\",\n" +
            "\t\"南：驿道\",\n" +
            "\t\"一条驿道静静的向远方延伸，\"),\n" +
            "\t//描述判定npc: Array(),\n" +
            "\t//npcdirection: Array(//可去路径{\n" +
            "\t\tname: \"洛阳北驿道[3]\",\n" +
            "\t\ttext: \"北：驿道 ↑\"\n" +
            "\t},\n" +
            "\t{\n" +
            "\t\tname: \"洛阳北驿道[1]\",\n" +
            "\t\ttext: \"南：驿道 ↓\"\n" +
            "\t})\n" +
            "},\n" +
            "{\n" +
            "\tname: \"洛阳北驿道[3]\",\n" +
            "\t//地图名称text: Array(\"东：山洞\",\n" +
            "\t\"北：驿道\",\n" +
            "\t\"南：驿道\",\n" +
            "\t\"一条驿道静静的向远方延伸，好象永远没有尽头。\"),\n" +
            "\t//描述判定npc: Array(),\n" +
            "\t//npcdirection: Array(//可去路径{\n" +
            "\t\tname: \"洛阳北驿道[4]\",\n" +
            "\t\ttext: \"北：驿道 ↑\"\n" +
            "\t},\n" +
            "\t{\n" +
            "\t\tname: \"洛阳北山洞\",\n" +
            "\t\ttext: \"东：山洞 →\"\n" +
            "\t},\n" +
            "\t{\n" +
            "\t\tname: \"洛阳北驿道[2]\",\n" +
            "\t\ttext: \"南：驿道 ↓\"\n" +
            "\t})\n" +
            "},\n" +
            "{\n" +
            "\tname: \"洛阳北山洞\",\n" +
            "\t//地图名称text: Array(\"一个伸手不见五指的山洞\",\n" +
            "\t\"西：驿道\"),\n" +
            "\t//描述判定npc: Array(\"王重阳\"),\n" +
            "\t//npcdirection: Array(//可去路径{\n" +
            "\t\tname: \"洛阳北驿道[3]\",\n" +
            "\t\ttext: \"西：驿道 ←\"\n" +
            "\t})\n" +
            "},\n" +
            "{\n" +
            "\tname: \"洛阳北驿道[4]\",\n" +
            "\t//地图名称text: Array(\"北：大广场\",\n" +
            "\t\"南：驿道\",\n" +
            "\t\"一条驿道静静的向远方延伸\"),\n" +
            "\t//描述判定npc: Array(),\n" +
            "\t//npcdirection: Array(//可去路径{\n" +
            "\t\tname: \"大广场\",\n" +
            "\t\ttext: \"北：大广场 ↑\"\n" +
            "\t},\n" +
            "\t{\n" +
            "\t\tname: \"洛阳北驿道[3]\",\n" +
            "\t\ttext: \"南：驿道 ↓\"\n" +
            "\t})\n" +
            "},\n" +
            "{\n" +
            "\tname: \"大广场\",\n" +
            "\t//地图名称text: Array(\"这里是一个大广场，再往北就是皇宫了\",\n" +
            "\t\"北：十里长街\",\n" +
            "\t\"南：驿道\"),\n" +
            "\t//描述判定npc: Array(),\n" +
            "\t//npcdirection: Array(//可去路径{\n" +
            "\t\tname: \"十里长街[1]\",\n" +
            "\t\ttext: \"北：十里长街 ↑\"\n" +
            "\t},\n" +
            "\t{\n" +
            "\t\tname: \"洛阳北驿道[4]\",\n" +
            "\t\ttext: \"南：驿道 ↓\"\n" +
            "\t})\n" +
            "},\n" +
            "{\n" +
            "\tname: \"十里长街[1]\",\n" +
            "\t//地图名称text: Array(\"北：金水桥\",\n" +
            "\t\"西：十里长街\",\n" +
            "\t\"东：十里长街\"),\n" +
            "\t//描述判定npc: Array(\"李寻欢\"),\n" +
            "\t//npcdirection: Array(//可去路径{\n" +
            "\t\tname: \"金水桥\",\n" +
            "\t\ttext: \"北：金水桥 ↑\"\n" +
            "\t},\n" +
            "\t{\n" +
            "\t\tname: \"十里长街[2]\",\n" +
            "\t\ttext: \"西：十里长街 ←\"\n" +
            "\t},\n" +
            "\t{\n" +
            "\t\tname: \"十里长街[3]\",\n" +
            "\t\ttext: \"东：十里长街 →\"\n" +
            "\t},\n" +
            "\t{\n" +
            "\t\tname: \"大广场\",\n" +
            "\t\ttext: \"南：大广场 ↓\"\n" +
            "\t})\n" +
            "},\n" +
            "{\n" +
            "\tname: \"金水桥\",\n" +
            "\t//地图名称text: Array(\"这就是著名的金水桥\",\n" +
            "\t\"北：紫禁城\",\n" +
            "\t\"桥下是护城河缓缓的流水\"),\n" +
            "\t//描述判定npc: Array(\"官家小姐\",\n" +
            "\t\"书生\"),\n" +
            "\t//npcdirection: Array(//可去路径{\n" +
            "\t\tname: \"紫禁城\",\n" +
            "\t\ttext: \"北：紫禁城 ↑\"\n" +
            "\t},\n" +
            "\t{\n" +
            "\t\tname: \"十里长街[1]\",\n" +
            "\t\ttext: \"南：十里长街 ↓\"\n" +
            "\t})\n" +
            "},\n" +
            "{\n" +
            "\tname: \"紫禁城\",\n" +
            "\t//地图名称text: Array(\"这便是皇宫正门\",\n" +
            "\t\"一张镶金边的告示贴在墙上\",\n" +
            "\t\"南：金水桥\"),\n" +
            "\t//描述判定npc: Array(\"书生\"),\n" +
            "\t//npcdirection: Array(//可去路径{\n" +
            "\t\tname: \"金水桥\",\n" +
            "\t\ttext: \"南：金水桥\"\n" +
            "\t})\n" +
            "},\n" +
            "{\n" +
            "\tname: \"十里长街[3]\",\n" +
            "\t//地图名称text: Array(\"北：顺升钱庄\",\n" +
            "\t\"东：建国门\",\n" +
            "\t\"南：当铺 ↓\"),\n" +
            "\t//描述判定npc: Array(\"李沉舟\"),\n" +
            "\t//npcdirection: Array(//可去路径{\n" +
            "\t\tname: \"顺升钱庄\",\n" +
            "\t\ttext: \"北：顺升钱庄 ↑\"\n" +
            "\t},\n" +
            "\t{\n" +
            "\t\tname: \"十里长街[1]\",\n" +
            "\t\ttext: \"西：十里长街 ←\"\n" +
            "\t},\n" +
            "\t{\n" +
            "\t\tname: \"建国门\",\n" +
            "\t\ttext: \"东：建国门 →\"\n" +
            "\t},\n" +
            "\t{\n" +
            "\t\tname: \"京城当铺\",\n" +
            "\t\ttext: \"南：当铺 ↓\"\n" +
            "\t})\n" +
            "},\n" +
            "{\n" +
            "\tname: \"顺升钱庄\",\n" +
            "\t//地图名称text: Array(\"这是一家老字号的钱庄\",\n" +
            "\t\"南：十里长街\",\n" +
            "\t\"已有几百年的历史\"),\n" +
            "\t//描述判定npc: Array(\"萧峰\"),\n" +
            "\t//npcdirection: Array(//可去路径{\n" +
            "\t\tname: \"十里长街[3]\",\n" +
            "\t\ttext: \"南：十里长街 ↓\"\n" +
            "\t})\n" +
            "},\n" +
            "{\n" +
            "\tname: \"京城当铺\",\n" +
            "\t//地图名称text: Array(\"这是一家看似普通的当铺\",\n" +
            "\t\"但你总觉得有点不太对劲\",\n" +
            "\t\"北：十里长街\"),\n" +
            "\t//描述判定npc: Array(\"叶开\"),\n" +
            "\t//npcdirection: Array(//可去路径{\n" +
            "\t\tname: \"十里长街[3]\",\n" +
            "\t\ttext: \"北：十里长街 ↑\"\n" +
            "\t})\n" +
            "},\n" +
            "//--------------------------幽默的分割线-------------------------------{\n" +
            "\tname: \"建国门\",\n" +
            "\t//地图名称text: Array(\"京城的东门\",\n" +
            "\t\"北：驿道\",\n" +
            "\t\"西：十里长街 ←\"),\n" +
            "\t//描述判定npc: Array(\"书生\"),\n" +
            "\t//npcdirection: Array(//可去路径{\n" +
            "\t\tname: \"京城东驿道[1]\",\n" +
            "\t\ttext: \"北：驿道 ↑\"\n" +
            "\t},\n" +
            "\t{\n" +
            "\t\tname: \"十里长街[3]\",\n" +
            "\t\ttext: \"西：十里长街 ←\"\n" +
            "\t})\n" +
            "},\n" +
            "{\n" +
            "\tname: \"京城东驿道[1]\",\n" +
            "\t//地图名称text: Array(\"北：驿道\",\n" +
            "\t\"南：建国门\",\n" +
            "\t\"一条驿道静静的向远方延伸\"),\n" +
            "\t//描述判定npc: Array(),\n" +
            "\t//npcdirection: Array(//可去路径{\n" +
            "\t\tname: \"京城东驿道[2]\",\n" +
            "\t\ttext: \"北：驿道 ↑\"\n" +
            "\t},\n" +
            "\t{\n" +
            "\t\tname: \"建国门\",\n" +
            "\t\ttext: \"南：建国门 ↓\"\n" +
            "\t})\n" +
            "},\n" +
            "{\n" +
            "\tname: \"京城东驿道[2]\",\n" +
            "\t//地图名称text: Array(\"北：驿道\",\n" +
            "\t\"南：驿道\",\n" +
            "\t\"一条驿道静静的向远方延伸\"),\n" +
            "\t//描述判定npc: Array(),\n" +
            "\t//npcdirection: Array(//可去路径{\n" +
            "\t\tname: \"京城东驿道[3]\",\n" +
            "\t\ttext: \"北：驿道 ↑\"\n" +
            "\t},\n" +
            "\t{\n" +
            "\t\tname: \"京城东驿道[1]\",\n" +
            "\t\ttext: \"南：驿道 ↓\"\n" +
            "\t})\n" +
            "},\n" +
            "{\n" +
            "\tname: \"京城东驿道[3]\",\n" +
            "\t//地图名称text: Array(\"北：驿道\",\n" +
            "\t\"西：森林\",\n" +
            "\t\"南：驿道\",\n" +
            "\t\"一条驿道静静的向远方延伸\"),\n" +
            "\t//描述判定npc: Array(),\n" +
            "\t//npcdirection: Array(//可去路径{\n" +
            "\t\tname: \"京城东驿道[4]\",\n" +
            "\t\ttext: \"北：驿道 ↑\"\n" +
            "\t},\n" +
            "\t{\n" +
            "\t\tname: \"京城东森林[1]\",\n" +
            "\t\ttext: \"西：森林 ←\"\n" +
            "\t},\n" +
            "\t{\n" +
            "\t\tname: \"京城东驿道[2]\",\n" +
            "\t\ttext: \"南：驿道 ↓\"\n" +
            "\t})\n" +
            "},\n" +
            "{\n" +
            "\tname: \"京城东森林[1]\",\n" +
            "\t//地图名称text: Array(\"郁郁葱葱的森林\",\n" +
            "\t\"东：驿道 →\"),\n" +
            "\t//描述判定npc: Array(\"上官金虹\"),\n" +
            "\t//npcdirection: Array(//可去路径{\n" +
            "\t\tname: \"京城东驿道[3]\",\n" +
            "\t\ttext: \"东：驿道 →\"\n" +
            "\t})\n" +
            "},\n" +
            "{\n" +
            "\tname: \"京城东驿道[4]\",\n" +
            "\t//地图名称text: Array(\"北：长白山\",\n" +
            "\t\"南：驿道\",\n" +
            "\t\"一条驿道静静的向远方延伸\"),\n" +
            "\t//描述判定npc: Array(),\n" +
            "\t//npcdirection: Array(//可去路径{\n" +
            "\t\tname: \"长白山\",\n" +
            "\t\ttext: \"北：长白山 ↑\"\n" +
            "\t},\n" +
            "\t{\n" +
            "\t\tname: \"京城东驿道[3]\",\n" +
            "\t\ttext: \"南：驿道 ↓\"\n" +
            "\t})\n" +
            "},\n" +
            "{\n" +
            "\tname: \"长白山\",\n" +
            "\t//地图名称text: Array(\"莽莽苍苍的长白山，是中原大地的龙脉所在\"),\n" +
            "\t//描述判定npc: Array(),\n" +
            "\t//npcdirection: Array(//可去路径{\n" +
            "\t\tname: \"长白山腰\",\n" +
            "\t\ttext: \"北：山腰 ↑\"\n" +
            "\t},\n" +
            "\t{\n" +
            "\t\tname: \"摩天崖\",\n" +
            "\t\ttext: \"西：摩天崖 ←\"\n" +
            "\t},\n" +
            "\t{\n" +
            "\t\tname: \"京城东驿道[4]\",\n" +
            "\t\ttext: \"南：驿道 ↓\"\n" +
            "\t})\n" +
            "},\n" +
            "{\n" +
            "\tname: \"摩天崖\",\n" +
            "\t//地图名称text: Array(\"这里是摩天崖，摩天居士谢烟客就住在这里\"),\n" +
            "\t//描述判定npc: Array(\"谢烟客\",\n" +
            "\t\"石破天\"),\n" +
            "\t//npcdirection: Array(//可去路径{\n" +
            "\t\tname: \"长白山\",\n" +
            "\t\ttext: \"东：长白山 →\"\n" +
            "\t})\n" +
            "},\n" +
            "{\n" +
            "\tname: \"长白山腰\",\n" +
            "\t//地图名称text: Array(\"这里是长白山的山腰，一片郁郁葱葱\"),\n" +
            "\t//描述判定npc: Array(),\n" +
            "\t//npcdirection: Array(//可去路径{\n" +
            "\t\tname: \"长白岩洞\",\n" +
            "\t\ttext: \"东：岩洞 →\"\n" +
            "\t},\n" +
            "\t{\n" +
            "\t\tname: \"长白山\",\n" +
            "\t\ttext: \"南：长白山 ↓\"\n" +
            "\t})\n" +
            "},\n" +
            "{\n" +
            "\tname: \"长白岩洞\",\n" +
            "\t//地图名称text: Array(\"一座岩洞，岩洞尽头似乎有一扇门，紧紧地锁住了\"),\n" +
            "\t//描述判定npc: Array(),\n" +
            "\t//npcdirection: Array(//可去路径{\n" +
            "\t\tname: \"长白山腰\",\n" +
            "\t\ttext: \"西：山腰 ←\"\n" +
            "\t},\n" +
            "\t{\n" +
            "\t\tname: \"长白雪谷\",\n" +
            "\t\ttext: \"东：长白雪谷 →\"\n" +
            "\t})\n" +
            "},\n" +
            "{\n" +
            "\tname: \"长白雪谷\",\n" +
            "\t//地图名称text: Array(\"这里是长白山的雪谷\"),\n" +
            "\t//描述判定npc: Array(\"麻衣人\"),\n" +
            "\t//npcdirection: Array(//可去路径{\n" +
            "\t\tname: \"长白岩洞\",\n" +
            "\t\ttext: \"西：岩洞 ←\"\n" +
            "\t})\n" +
            "},\n" +
            "{\n" +
            "\tname: \"十里长街[2]\",\n" +
            "\t//地图名称text: Array(\"北：西单\",\n" +
            "\t\"西：复兴门\",\n" +
            "\t\"南：如归客栈 ↓\"),\n" +
            "\t//描述判定npc: Array(\"醉汉\"),\n" +
            "\t//npcdirection: Array(//可去路径{\n" +
            "\t\tname: \"西单\",\n" +
            "\t\ttext: \"北：西单 ↑\"\n" +
            "\t},\n" +
            "\t{\n" +
            "\t\tname: \"复兴门\",\n" +
            "\t\ttext: \"西：复兴门 ←\"\n" +
            "\t},\n" +
            "\t{\n" +
            "\t\tname: \"十里长街[1]\",\n" +
            "\t\ttext: \"东：十里长街 →\"\n" +
            "\t},\n" +
            "\t{\n" +
            "\t\tname: \"如归客栈\",\n" +
            "\t\ttext: \"南：如归客栈 ↓\"\n" +
            "\t})\n" +
            "},\n" +
            "{\n" +
            "\tname: \"西单\",\n" +
            "\t//地图名称text: Array(\"这里就是西单，人来人往，十分热闹\",\n" +
            "\t\"南：十里长街\"),\n" +
            "\t//描述判定npc: Array(\"柳随风\"),\n" +
            "\t//npcdirection: Array(//可去路径{\n" +
            "\t\tname: \"十里长街[2]\",\n" +
            "\t\ttext: \"南：十里长街 ↓\"\n" +
            "\t})\n" +
            "},\n" +
            "{\n" +
            "\tname: \"国子监\",\n" +
            "\t//地图名称text: Array(\"这里是国子监，几位书生正在埋头读书\",\n" +
            "\t\"南：西单 ↓\"),\n" +
            "\t//描述判定npc: Array(\"老郭\",\n" +
            "\t\"老吴\",\n" +
            "\t\"老黄\",\n" +
            "\t\"老曲\",\n" +
            "\t\"老闫\"),\n" +
            "\t//npcdirection: Array(//可去路径{\n" +
            "\t\tname: \"西单\",\n" +
            "\t\ttext: \"南：西单 ↓\"\n" +
            "\t})\n" +
            "},\n" +
            "{\n" +
            "\tname: \"如归客栈\",\n" +
            "\t//地图名称text: Array(\"一间开在繁华地带的客栈\",\n" +
            "\t\"它的老板可真找到了黄金地段\",\n" +
            "\t\"北：十里长街\"),\n" +
            "\t//描述判定npc: Array(),\n" +
            "\t//npcdirection: Array(//可去路径{\n" +
            "\t\tname: \"十里长街[2]\",\n" +
            "\t\ttext: \"北：十里长街 ↑\"\n" +
            "\t})\n" +
            "},\n" +
            "{\n" +
            "\tname: \"复兴门\",\n" +
            "\t//地图名称text: Array(\"京城的西门\",\n" +
            "\t\"不知道想复兴什么\",\n" +
            "\t\"东：十里长街\"),\n" +
            "\t//描述判定npc: Array(),\n" +
            "\t//npcdirection: Array(//可去路径{\n" +
            "\t\tname: \"复兴大路\",\n" +
            "\t\ttext: \"西：大路 ←\"\n" +
            "\t},\n" +
            "\t{\n" +
            "\t\tname: \"十里长街[2]\",\n" +
            "\t\ttext: \"东：十里长街 →\"\n" +
            "\t})\n" +
            "},\n" +
            "{\n" +
            "\tname: \"复兴大路\",\n" +
            "\t//地图名称text: Array(\"一条宽阔的大路\",\n" +
            "\t\"西：羊肠小道 ←\",\n" +
            "\t\"东：复兴门 →\"),\n" +
            "\t//描述判定npc: Array(),\n" +
            "\t//npcdirection: Array(//可去路径{\n" +
            "\t\tname: \"复兴小道\",\n" +
            "\t\ttext: \"西：羊肠小道 ←\"\n" +
            "\t},\n" +
            "\t{\n" +
            "\t\tname: \"复兴门\",\n" +
            "\t\ttext: \"东：复兴门 →\"\n" +
            "\t})\n" +
            "},\n" +
            "{\n" +
            "\tname: \"复兴小道\",\n" +
            "\t//地图名称text: Array(\"一条被在恰克卜里山中\",\n" +
            "\t\"道旁的茅草高达五尺，遮住了天光\",\n" +
            "\t\"西：小桥流水 ←\"),\n" +
            "\t//描述判定npc: Array(\"樵夫\"),\n" +
            "\t//npcdirection: Array(//可去路径{\n" +
            "\t\tname: \"小桥流水\",\n" +
            "\t\ttext: \"西：小桥流水 ←\"\n" +
            "\t},\n" +
            "\t{\n" +
            "\t\tname: \"复兴大路\",\n" +
            "\t\ttext: \"东：大路 →\"\n" +
            "\t})\n" +
            "},\n" +
            "{\n" +
            "\tname: \"小桥流水\",\n" +
            "\t//地图名称text: Array(\"一条清澈的小溪上横跨着一座木桥\",\n" +
            "\t\"桥的那边是一片茂盛的竹林\",\n" +
            "\t\"北：翠竹庄门 ↑\"),\n" +
            "\t//描述判定npc: Array(),\n" +
            "\t//npcdirection: Array(//可去路径{\n" +
            "\t\tname: \"翠竹庄门\",\n" +
            "\t\ttext: \"北：翠竹庄门 ↑\"\n" +
            "\t},\n" +
            "\t{\n" +
            "\t\tname: \"复兴小道\",\n" +
            "\t\ttext: \"东：羊肠小道 →\"\n" +
            "\t})\n" +
            "},\n" +
            "{\n" +
            "\tname: \"翠竹庄门\",\n" +
            "\t//地图名称text: Array(\"这是一座精巧的山庄。庄院依山傍水\",\n" +
            "\t\"铁雪山庄\",\n" +
            "\t\"北：山庄前院 ↑\"),\n" +
            "\t//描述判定npc: Array(\"老张\"),\n" +
            "\t//npcdirection: Array(//可去路径{\n" +
            "\t\tname: \"山庄前院\",\n" +
            "\t\ttext: \"北：山庄前院 ↑\"\n" +
            "\t},\n" +
            "\t{\n" +
            "\t\tname: \"小桥流水\",\n" +
            "\t\ttext: \"南：小桥流水 ↓\"\n" +
            "\t})\n" +
            "},\n" +
            "{\n" +
            "\tname: \"山庄前院\",\n" +
            "\t//地图名称text: Array(\"这里的装饰古朴而幽雅\",\n" +
            "\t\"院子的四周斑斑点点的种着黄色的枚瑰\",\n" +
            "\t\"北：翠竹屋 ↑\"),\n" +
            "\t//描述判定npc: Array(),\n" +
            "\t//npcdirection: Array(//可去路径{\n" +
            "\t\tname: \"翠竹屋\",\n" +
            "\t\ttext: \"北：翠竹屋 ↑\"\n" +
            "\t},\n" +
            "\t{\n" +
            "\t\tname: \"翠竹庄门\",\n" +
            "\t\ttext: \"南：翠竹庄门 ↓\"\n" +
            "\t})\n" +
            "},\n" +
            "{\n" +
            "\tname: \"翠竹屋\",\n" +
            "\t//地图名称text: Array(\"青青的软竹搭成小小的翠竹屋\",\n" +
            "\t\"竹编成的\",\n" +
            "\t\"北：山庄后院 ↑\"),\n" +
            "\t//描述判定npc: Array(\"铁少\",\n" +
            "\t\"雪蕊儿\"),\n" +
            "\t//npcdirection: Array(//可去路径{\n" +
            "\t\tname: \"山庄后院\",\n" +
            "\t\ttext: \"北：山庄后院 ↑\"\n" +
            "\t},\n" +
            "\t{\n" +
            "\t\tname: \"山庄前院\",\n" +
            "\t\ttext: \"南：山庄前院 ↓\"\n" +
            "\t})\n" +
            "},\n" +
            "{\n" +
            "\tname: \"山庄后院\",\n" +
            "\t//地图名称text: Array(\"庄外的小溪在这里形成一个小小的瀑布\",\n" +
            "\t\"是铁雪庄主一生的积\",\n" +
            "\t\"南：翠竹屋 ↓\"),\n" +
            "\t//描述判定npc: Array(\"黑袍公\",\n" +
            "\t\"白袍公\"),\n" +
            "\t//npcdirection: Array(//可去路径{\n" +
            "\t\tname: \"铁雪练功室\",\n" +
            "\t\ttext: \"西：练功室 ←\"\n" +
            "\t},\n" +
            "\t{\n" +
            "\t\tname: \"铁雪藏书阁\",\n" +
            "\t\ttext: \"东：藏书阁 →\"\n" +
            "\t},\n" +
            "\t{\n" +
            "\t\tname: \"翠竹屋\",\n" +
            "\t\ttext: \"南：翠竹屋 ↓\"\n" +
            "\t})\n" +
            "},\n" +
            "{\n" +
            "\tname: \"铁雪练功室\",\n" +
            "\t//地图名称text: Array(\"干干净净的墙上挂着一幅字画\",\n" +
            "\t\"知山有路勤为径\",\n" +
            "\t\"东：山庄后院 →\"),\n" +
            "\t//描述判定npc: Array(),\n" +
            "\t//npcdirection: Array(//可去路径{\n" +
            "\t\tname: \"山庄后院\",\n" +
            "\t\ttext: \"东：山庄后院 →\"\n" +
            "\t})\n" +
            "},\n" +
            "{\n" +
            "\tname: \"铁雪藏书阁\",\n" +
            "\t//地图名称text: Array(\"干干净净的书架上堆满了铁雪山庄的武功秘笈\",\n" +
            "\t\"这些秘笈\",\n" +
            "\t\"西：山庄后院 ←\"),\n" +
            "\t//描述判定npc: Array(\"小翠\"),\n" +
            "\t//npcdirection: Array(//可去路径{\n" +
            "\t\tname: \"山庄后院\",\n" +
            "\t\ttext: \"西：山庄后院 ←\"\n" +
            "\t})\n" +
            "},\n" +
            "{\n" +
            "\tname: \"洛阳东街\",\n" +
            "\t//地图名称text: Array(\"一条繁华的大街。\",\n" +
            "\t\"西：洛阳中心\",\n" +
            "\t\"南：白马寺 ↓\"),\n" +
            "\t//描述判定npc: Array(),\n" +
            "\t//npcdirection: Array(//可去路径{\n" +
            "\t\tname: \"牡丹园\",\n" +
            "\t\ttext: \"北：牡丹园 ↑\"\n" +
            "\t},\n" +
            "\t{\n" +
            "\t\tname: \"洛阳中心\",\n" +
            "\t\ttext: \"西：洛阳中心 ←\"\n" +
            "\t},\n" +
            "\t{\n" +
            "\t\tname: \"洛阳东门\",\n" +
            "\t\ttext: \"东：洛阳东门 →\"\n" +
            "\t},\n" +
            "\t{\n" +
            "\t\tname: \"白马寺\",\n" +
            "\t\ttext: \"南：白马寺 ↓\"\n" +
            "\t})\n" +
            "},\n" +
            "{\n" +
            "\tname: \"牡丹园\",\n" +
            "\t//地图名称text: Array(\"这里盛开着万朵牡丹\",\n" +
            "\t\"洛阳牡丹甲天下\",\n" +
            "\t\"南：洛阳东街 ↓\"),\n" +
            "\t//描述判定npc: Array(),\n" +
            "\t//npcdirection: Array(//可去路径{\n" +
            "\t\tname: \"洛阳东街\",\n" +
            "\t\ttext: \"南：洛阳东街 ↓\"\n" +
            "\t})\n" +
            "},\n" +
            "{\n" +
            "\tname: \"白马寺\",\n" +
            "\t//地图名称text: Array(\"这里是有名的白马寺\",\n" +
            "\t\"北：洛阳东街 ↑\"),\n" +
            "\t//描述判定npc: Array(),\n" +
            "\t//npcdirection: Array(//可去路径{\n" +
            "\t\tname: \"洛阳东街\",\n" +
            "\t\ttext: \"北：洛阳东街 ↑\"\n" +
            "\t})\n" +
            "},\n" +
            "{\n" +
            "\tname: \"洛阳东门\",\n" +
            "\t//地图名称text: Array(\"洛阳城的东门。\",\n" +
            "\t\"西：洛阳东街\",\n" +
            "\t\"东：驿道\"),\n" +
            "\t//描述判定npc: Array(),\n" +
            "\t//npcdirection: Array(//可去路径{\n" +
            "\t\tname: \"洛阳东街\",\n" +
            "\t\ttext: \"西：洛阳东街 ←\"\n" +
            "\t},\n" +
            "\t{\n" +
            "\t\tname: \"洛阳东驿道[2]\",\n" +
            "\t\ttext: \"东：驿道 →\"\n" +
            "\t})\n" +
            "},\n" +
            "{\n" +
            "\tname: \"洛阳东驿道[2]\",\n" +
            "\t//地图名称text: Array(\"西：洛阳东门\",\n" +
            "\t\"东：驿道\",\n" +
            "\t\"一条驿道静静的向远方延伸\"),\n" +
            "\t//描述判定npc: Array(),\n" +
            "\t//npcdirection: Array(//可去路径{\n" +
            "\t\tname: \"洛阳东门\",\n" +
            "\t\ttext: \"西：洛阳东门 ←\"\n" +
            "\t},\n" +
            "\t{\n" +
            "\t\tname: \"洛阳东驿道[3]\",\n" +
            "\t\ttext: \"东：驿道 →\"\n" +
            "\t})\n" +
            "},\n" +
            "{\n" +
            "\tname: \"洛阳东驿道[3]\",\n" +
            "\t//地图名称text: Array(\"东：驿道\",\n" +
            "\t\"西：驿道\",\n" +
            "\t\"一条驿道静静的向远方延伸\"),\n" +
            "\t//描述判定npc: Array(),\n" +
            "\t//npcdirection: Array(//可去路径{\n" +
            "\t\tname: \"少室山石阶\",\n" +
            "\t\ttext: \"北：少室山石阶 ↑\"\n" +
            "\t},\n" +
            "\t{\n" +
            "\t\tname: \"洛阳东驿道[2]\",\n" +
            "\t\ttext: \"西：驿道 ←\"\n" +
            "\t},\n" +
            "\t{\n" +
            "\t\tname: \"洛阳东驿道[4]\",\n" +
            "\t\ttext: \"东：驿道 →\"\n" +
            "\t})\n" +
            "},\n" +
            "{\n" +
            "\tname: \"洛阳东驿道[4]\",\n" +
            "\t//地图名称text: Array(\"东：驿道\",\n" +
            "\t\"西：驿道\",\n" +
            "\t\"一条驿道静静的向远方延伸\"),\n" +
            "\t//描述判定npc: Array(),\n" +
            "\t//npcdirection: Array(//可去路径{\n" +
            "\t\tname: \"洛阳东驿道[3]\",\n" +
            "\t\ttext: \"西：驿道 ←\"\n" +
            "\t},\n" +
            "\t{\n" +
            "\t\tname: \"济南]\",\n" +
            "\t\ttext: \"东：济南 →\"\n" +
            "\t})\n" +
            "},\n" +
            "{\n" +
            "\tname: \"济南\",\n" +
            "\t//地图名称text: Array(\"山东名城，背倚黄海，虎视中原\",\n" +
            "\t\"西：驿道\"),\n" +
            "\t//描述判定npc: Array(\"阿飞\"),\n" +
            "\t//npcdirection: Array(//可去路径{\n" +
            "\t\tname: \"洛阳东驿道[4]\",\n" +
            "\t\ttext: \"西：驿道 ←\"\n" +
            "\t},\n" +
            "\t{\n" +
            "\t\tname: \"济南临淄\",\n" +
            "\t\ttext: \"东：临淄 →\"\n" +
            "\t})\n" +
            "},\n" +
            "{\n" +
            "\tname: \"济南临淄\",\n" +
            "\t//地图名称text: Array(\"临淄以前是齐国都城\",\n" +
            "\t\"西：济南 ←\"),\n" +
            "\t//描述判定npc: Array(\"天机老人\"),\n" +
            "\t//npcdirection: Array(//可去路径{\n" +
            "\t\tname: \"济南\",\n" +
            "\t\ttext: \"西：济南 ←\"\n" +
            "\t})\n" +
            "},\n" +
            "{\n" +
            "\tname: \"洛阳南街\",\n" +
            "\t//地图名称text: Array(\"一条繁华的大街\",\n" +
            "\t\"北：洛阳中心\",\n" +
            "\t\"西：山庄\",\n" +
            "\t\"南：洛阳南门\"),\n" +
            "\t//描述判定npc: Array(),\n" +
            "\t//npcdirection: Array(//可去路径{\n" +
            "\t\tname: \"洛阳中心\",\n" +
            "\t\ttext: \"北：洛阳中心 ↑\"\n" +
            "\t},\n" +
            "\t{\n" +
            "\t\tname: \"山庄\",\n" +
            "\t\ttext: \"西：山庄 ←\"\n" +
            "\t},\n" +
            "\t{\n" +
            "\t\tname: \"洛阳南门\",\n" +
            "\t\ttext: \"南：洛阳南门 ↓\"\n" +
            "\t})\n" +
            "},\n" +
            "{\n" +
            "\tname: \"山庄\",\n" +
            "\t//地图名称text: Array(\"一座安静的山庄\",\n" +
            "\t\"东：洛阳南街\"),\n" +
            "\t//描述判定npc: Array(),\n" +
            "\t//npcdirection: Array(//可去路径{\n" +
            "\t\tname: \"洛阳南街\",\n" +
            "\t\ttext: \"东：洛阳南街 →\"\n" +
            "\t})\n" +
            "},\n" +
            "{\n" +
            "\tname: \"洛阳南门\",\n" +
            "\t//地图名称text: Array(\"洛阳城的南门\",\n" +
            "\t\"北：洛阳南街\",\n" +
            "\t\"西：血狼谷领地\",\n" +
            "\t\"南：驿道\"),\n" +
            "\t//描述判定npc: Array(),\n" +
            "\t//npcdirection: Array(//可去路径{\n" +
            "\t\tname: \"洛阳南街\",\n" +
            "\t\ttext: \"北：洛阳南街 ↑\"\n" +
            "\t},\n" +
            "\t{\n" +
            "\t\tname: \"血狼谷领地\",\n" +
            "\t\ttext: \"西：血狼谷领地 ←\"\n" +
            "\t},\n" +
            "\t{\n" +
            "\t\tname: \"洛阳南驿道[1]\",\n" +
            "\t\ttext: \"南：驿道 ↓\"\n" +
            "\t})\n" +
            "},\n" +
            "{\n" +
            "\tname: \"血狼谷领地\",\n" +
            "\t//地图名称text: Array(\"这里是早期夺宝一些帮派的领地\",\n" +
            "\t\"北：3g联盟领地 ↑\",\n" +
            "\t\"西：仁龙盟领地 ←\"),\n" +
            "\t//描述判定npc: Array(\"守帮弟子\"),\n" +
            "\t//npcdirection: Array(//可去路径{\n" +
            "\t\tname: \"3g联盟领地\",\n" +
            "\t\ttext: \"北：3g联盟领地 ↑\"\n" +
            "\t},\n" +
            "\t{\n" +
            "\t\tname: \"仁龙盟领地\",\n" +
            "\t\ttext: \"西：仁龙盟领地 ←\"\n" +
            "\t},\n" +
            "\t{\n" +
            "\t\tname: \"洛阳南门\",\n" +
            "\t\ttext: \"东：洛阳南门 →\"\n" +
            "\t},\n" +
            "\t{\n" +
            "\t\tname: \"贼窝领地\",\n" +
            "\t\ttext: \"南：贼窝领地 ↓\"\n" +
            "\t})\n" +
            "},\n" +
            "{\n" +
            "\tname: \"3g联盟领地\",\n" +
            "\t//地图名称text: Array(\"这里是3g联盟领地\",\n" +
            "\t\"南：血狼谷领地 ↓\"),\n" +
            "\t//描述判定npc: Array(\"守帮弟子\"),\n" +
            "\t//npcdirection: Array(//可去路径{\n" +
            "\t\tname: \"血狼谷领地\",\n" +
            "\t\ttext: \"南：血狼谷领地 ↓\"\n" +
            "\t})\n" +
            "},\n" +
            "{\n" +
            "\tname: \"仁龙盟领地\",\n" +
            "\t//地图名称text: Array(\"这里是仁龙盟领地\",\n" +
            "\t\"东：血狼谷领地 →\"),\n" +
            "\t//描述判定npc: Array(\"守帮弟子\"),\n" +
            "\t//npcdirection: Array(//可去路径{\n" +
            "\t\tname: \"血狼谷领地\",\n" +
            "\t\ttext: \"东：血狼谷领地 →\"\n" +
            "\t})\n" +
            "},\n" +
            "{\n" +
            "\tname: \"贼窝领地\",\n" +
            "\t//地图名称text: Array(\"这里是贼窝的领地\",\n" +
            "\t\"西：魔刀盟领地 ←\",\n" +
            "\t\"东：义帮领地 →\"),\n" +
            "\t//描述判定npc: Array(\"守帮弟子\"),\n" +
            "\t//npcdirection: Array(//可去路径{\n" +
            "\t\tname: \"血狼谷领地\",\n" +
            "\t\ttext: \"北：血狼谷领地 ↑\"\n" +
            "\t},\n" +
            "\t{\n" +
            "\t\tname: \"魔刀盟领地\",\n" +
            "\t\ttext: \"西：魔刀盟领地 ←\"\n" +
            "\t},\n" +
            "\t{\n" +
            "\t\tname: \"义帮领地\",\n" +
            "\t\ttext: \"东：义帮领地 →\"\n" +
            "\t},\n" +
            "\t{\n" +
            "\t\tname: \"心动无限领地\",\n" +
            "\t\ttext: \"南：心动无限领地 ↓\"\n" +
            "\t})\n" +
            "},\n" +
            "{\n" +
            "\tname: \"魔刀盟领地\",\n" +
            "\t//地图名称text: Array(\"这里是魔刀盟的领地\",\n" +
            "\t\"东：贼窝领地 →\"),\n" +
            "\t//描述判定npc: Array(\"守帮弟子\"),\n" +
            "\t//npcdirection: Array(//可去路径{\n" +
            "\t\tname: \"贼窝领地\",\n" +
            "\t\ttext: \"东：贼窝领地 →\"\n" +
            "\t})\n" +
            "},\n" +
            "{\n" +
            "\tname: \"义帮领地\",\n" +
            "\t//地图名称text: Array(\"这里是义帮领地\",\n" +
            "\t\"西：贼窝领地 ←\"),\n" +
            "\t//描述判定npc: Array(\"守帮弟子\"),\n" +
            "\t//npcdirection: Array(//可去路径{\n" +
            "\t\tname: \"贼窝领地\",\n" +
            "\t\ttext: \"西：贼窝领地 ←\"\n" +
            "\t})\n" +
            "},\n" +
            "{\n" +
            "\tname: \"心动无限领地\",\n" +
            "\t//地图名称text: Array(\"这里是心动无限领地\",\n" +
            "\t\"北：贼窝领地 ↑\"),\n" +
            "\t//描述判定npc: Array(\"守帮弟子\"),\n" +
            "\t//npcdirection: Array(//可去路径{\n" +
            "\t\tname: \"贼窝领地\",\n" +
            "\t\ttext: \"北：贼窝领地 ↑\"\n" +
            "\t})\n" +
            "},\n" +
            "{\n" +
            "\tname: \"洛阳南驿道[1]\",\n" +
            "\t//地图名称text: Array(\"北：洛阳南门 \",\n" +
            "\t\"一条驿道静静的向远方延伸\"),\n" +
            "\t//描述判定npc: Array(),\n" +
            "\t//npcdirection: Array(//可去路径{\n" +
            "\t\tname: \"洛阳南门\",\n" +
            "\t\ttext: \"北：洛阳南门 ↑\"\n" +
            "\t},\n" +
            "\t{\n" +
            "\t\tname: \"洛阳南驿道[2]\",\n" +
            "\t\ttext: \"南：驿道 ↓\"\n" +
            "\t})\n" +
            "},\n" +
            "{\n" +
            "\tname: \"洛阳南驿道[2]\",\n" +
            "\t//地图名称text: Array(\"西：木屋\",\n" +
            "\t\"一条驿道静静的向远方延伸\",\n" +
            "\t\"北：驿道\",\n" +
            "\t\"南：驿道\"),\n" +
            "\t//描述判定npc: Array(\"马钰\"),\n" +
            "\t//npcdirection: Array(//可去路径{\n" +
            "\t\tname: \"洛阳南驿道[1]\",\n" +
            "\t\ttext: \"北：驿道 ↑\"\n" +
            "\t},\n" +
            "\t{\n" +
            "\t\tname: \"洛阳南木屋\",\n" +
            "\t\ttext: \"西：木屋 ←\"\n" +
            "\t},\n" +
            "\t{\n" +
            "\t\tname: \"天龙门\",\n" +
            "\t\ttext: \"东：天龙门 →\"\n" +
            "\t},\n" +
            "\t{\n" +
            "\t\tname: \"洛阳南驿道[3]\",\n" +
            "\t\ttext: \"南：驿道 ↓\"\n" +
            "\t})\n" +
            "},\n" +
            "{\n" +
            "\tname: \"洛阳南木屋\",\n" +
            "\t//地图名称text: Array(\"在道路旁忽然有一间木屋，显得非常奇怪\",\n" +
            "\t\"东：驿道\"),\n" +
            "\t//描述判定npc: Array(\"丘处机\"),\n" +
            "\t//npcdirection: Array(//可去路径{\n" +
            "\t\tname: \"洛阳南驿道[2]\",\n" +
            "\t\ttext: \"东：驿道 →\"\n" +
            "\t})\n" +
            "},\n" +
            "{\n" +
            "\tname: \"洛阳南驿道[3]\",\n" +
            "\t//地图名称text: Array(\"南：武汉\",\n" +
            "\t\"一条驿道静静的向远方延伸\"),\n" +
            "\t//描述判定npc: Array(),\n" +
            "\t//npcdirection: Array(//可去路径{\n" +
            "\t\tname: \"洛阳南驿道[2]\",\n" +
            "\t\ttext: \"北：驿道 ↑\"\n" +
            "\t},\n" +
            "\t{\n" +
            "\t\tname: \"武汉\",\n" +
            "\t\ttext: \"南：武汉 ↓\"\n" +
            "\t})\n" +
            "},\n" +
            "{\n" +
            "\tname: \"武汉\",\n" +
            "\t//地图名称text: Array(\"这里是九省通衢的江城。\",\n" +
            "\t\"南：驿道 ↓\"),\n" +
            "\t//描述判定npc: Array(),\n" +
            "\t//npcdirection: Array(//可去路径{\n" +
            "\t\tname: \"洛阳南驿道[3]\",\n" +
            "\t\ttext: \"北：驿道 ↑\"\n" +
            "\t},\n" +
            "\t{\n" +
            "\t\tname: \"武汉西驿道[1]\",\n" +
            "\t\ttext: \"西：驿道 ←\"\n" +
            "\t},\n" +
            "\t{\n" +
            "\t\tname: \"武汉东驿道[1]\",\n" +
            "\t\ttext: \"东：驿道 →\"\n" +
            "\t},\n" +
            "\t{\n" +
            "\t\tname: \"武汉南驿道[1]\",\n" +
            "\t\ttext: \"南：驿道 ↓\"\n" +
            "\t})\n" +
            "},\n" +
            "{\n" +
            "\tname: \"武汉东驿道[1]\",\n" +
            "\t//地图名称text: Array(\"一条驿道静静的向远方延伸\",\n" +
            "\t\"好象永远没有尽头\",\n" +
            "\t\"西：武汉 ←\"),\n" +
            "\t//描述判定npc: Array(),\n" +
            "\t//npcdirection: Array(//可去路径{\n" +
            "\t\tname: \"武汉\",\n" +
            "\t\ttext: \"西：武汉 ←\"\n" +
            "\t},\n" +
            "\t{\n" +
            "\t\tname: \"武汉东驿道[2]\",\n" +
            "\t\ttext: \"东：驿道 →\"\n" +
            "\t})\n" +
            "},\n" +
            "{\n" +
            "\tname: \"武汉东驿道[2]\",\n" +
            "\t//地图名称text: Array(\"一条驿道静静的向远方延伸\",\n" +
            "\t\"好象永远没有尽头\",\n" +
            "\t\"西：驿道 ←\",\n" +
            "\t\"东：驿道 →\"),\n" +
            "\t//描述判定npc: Array(),\n" +
            "\t//npcdirection: Array(//可去路径{\n" +
            "\t\tname: \"武汉东驿道[1]\",\n" +
            "\t\ttext: \"西：驿道 ←\"\n" +
            "\t},\n" +
            "\t{\n" +
            "\t\tname: \"武汉东驿道[3]\",\n" +
            "\t\ttext: \"东：驿道 →\"\n" +
            "\t})\n" +
            "},\n" +
            "{\n" +
            "\tname: \"武汉东驿道[3]\",\n" +
            "\t//地图名称text: Array(\"一条驿道静静的向远方延伸\",\n" +
            "\t\"东：上海西街 →\"),\n" +
            "\t//描述判定npc: Array(),\n" +
            "\t//npcdirection: Array(//可去路径{\n" +
            "\t\tname: \"武汉东驿道[2]\",\n" +
            "\t\ttext: \"西：驿道 ←\"\n" +
            "\t},\n" +
            "\t{\n" +
            "\t\tname: \"上海西街\",\n" +
            "\t\ttext: \"东：上海西街 →\"\n" +
            "\t})\n" +
            "},\n" +
            "{\n" +
            "\tname: \"上海西街\",\n" +
            "\t//地图名称text: Array(\"你走在西大街上，感到这里的街面要比别处的干净、整洁\",\n" +
            "\t\"东：西街\",\n" +
            "\t\"南：杂货铺\"),\n" +
            "\t//描述判定npc: Array(),\n" +
            "\t//npcdirection: Array(//可去路径{\n" +
            "\t\tname: \"武汉东驿道[3]\",\n" +
            "\t\ttext: \"西：驿道 ←\"\n" +
            "\t},\n" +
            "\t{\n" +
            "\t\tname: \"上海西街[3]\",\n" +
            "\t\ttext: \"东：西街 →\"\n" +
            "\t},\n" +
            "\t{\n" +
            "\t\tname: \"上海杂货铺\",\n" +
            "\t\ttext: \"南：杂货铺 ↓\"\n" +
            "\t})\n" +
            "},\n" +
            "//---------------------------无奈的分割线---------------------------------------{\n" +
            "\tname: \"上海杂货铺\",\n" +
            "\t//地图名称text: Array(\"这是一家小小的杂货铺\",\n" +
            "\t\"北：上海西街\"),\n" +
            "\t//描述判定npc: Array(\"日月神教光明右使向问天\",\n" +
            "\t\"梁掌柜\"),\n" +
            "\t//npcdirection: Array(//可去路径{\n" +
            "\t\tname: \"上海西街\",\n" +
            "\t\ttext: \"北：上海西街 ↑\"\n" +
            "\t})\n" +
            "},\n" +
            "{\n" +
            "\tname: \"上海西街[3]\",\n" +
            "\t//地图名称text: Array(\"你走在西大街上，感到这里的街面要比别处的干净、整洁\",\n" +
            "\t\"西：上海西街\",\n" +
            "\t\"东：西街\"),\n" +
            "\t//描述判定npc: Array(),\n" +
            "\t//npcdirection: Array(//可去路径{\n" +
            "\t\tname: \"上海西街\",\n" +
            "\t\ttext: \"西：上海西街 ←\"\n" +
            "\t},\n" +
            "\t{\n" +
            "\t\tname: \"上海西街[2]\",\n" +
            "\t\ttext: \"东：西街 →\"\n" +
            "\t})\n" +
            "},\n" +
            "{\n" +
            "\tname: \"上海西街[2]\",\n" +
            "\t//地图名称text: Array(\"你走在西大街上，感到这里的街面要比别处的干净、整洁\",\n" +
            "\t\"北：小巷子\",\n" +
            "\t\"西：西街\"),\n" +
            "\t//描述判定npc: Array(),\n" +
            "\t//npcdirection: Array(//可去路径{\n" +
            "\t\tname: \"上海小巷子[1]\",\n" +
            "\t\ttext: \"北：小巷子 ↑\"\n" +
            "\t},\n" +
            "\t{\n" +
            "\t\tname: \"上海西街[3]\",\n" +
            "\t\ttext: \"西：西街 ←\"\n" +
            "\t},\n" +
            "\t{\n" +
            "\t\tname: \"上海西街[1]\",\n" +
            "\t\ttext: \"东：西街 →\"\n" +
            "\t})\n" +
            "},\n" +
            "{\n" +
            "\tname: \"上海小巷子[1]\",\n" +
            "\t//地图名称text: Array(\"这是一条昏暗的小巷子\",\n" +
            "\t\"北：小巷子\",\n" +
            "\t\"南：西街\"),\n" +
            "\t//描述判定npc: Array(\"流氓老大\",\n" +
            "\t\"浪人田中英机\"),\n" +
            "\t//npcdirection: Array(//可去路径{\n" +
            "\t\tname: \"上海小巷子[2]\",\n" +
            "\t\ttext: \"北：小巷子 ↑\"\n" +
            "\t},\n" +
            "\t{\n" +
            "\t\tname: \"上海西街[2]\",\n" +
            "\t\ttext: \"南：西街 ↓\"\n" +
            "\t})\n" +
            "},\n" +
            "{\n" +
            "\tname: \"上海小巷子[2]\",\n" +
            "\t//地图名称text: Array(\"这是一条昏暗的小巷子\",\n" +
            "\t\"南：小巷子\"),\n" +
            "\t//描述判定npc: Array(\"蒙面人\"),\n" +
            "\t//npcdirection: Array(//可去路径{\n" +
            "\t\tname: \"上海小巷子[1]\",\n" +
            "\t\ttext: \"南：小巷子 ↓\"\n" +
            "\t})\n" +
            "},\n" +
            "{\n" +
            "\tname: \"上海西街[1]\",\n" +
            "\t//地图名称text: Array(\"这是一条宽阔的青石板街道，向东西两头延伸\",\n" +
            "\t\"北：酒楼\",\n" +
            "\t\"东：市中心\"),\n" +
            "\t//描述判定npc: Array(\"张骥\"),\n" +
            "\t//npcdirection: Array(//可去路径{\n" +
            "\t\tname: \"上海酒楼\",\n" +
            "\t\ttext: \"北：酒楼 ↑\"\n" +
            "\t},\n" +
            "\t{\n" +
            "\t\tname: \"上海西街[2]\",\n" +
            "\t\ttext: \"西：西街 ←\"\n" +
            "\t},\n" +
            "\t{\n" +
            "\t\tname: \"上海市中心\",\n" +
            "\t\ttext: \"东：市中心 →\"\n" +
            "\t})\n" +
            "},\n" +
            "{\n" +
            "\tname: \"上海酒楼\",\n" +
            "\t//地图名称text: Array(\"八仙酒楼可是非常出名的一家酒楼\",\n" +
            "\t\"东：北街\",\n" +
            "\t\"南：西街\"),\n" +
            "\t//描述判定npc: Array(),\n" +
            "\t//npcdirection: Array(//可去路径{\n" +
            "\t\tname: \"上海西街[1]\",\n" +
            "\t\ttext: \"南：西街 ↓\"\n" +
            "\t})\n" +
            "},\n" +
            "{\n" +
            "\tname: \"上海市中心\",\n" +
            "\t//地图名称text: Array(\"这儿就上海的市中心了\",\n" +
            "\t\"来来往往的行人不停的经过你身边\"),\n" +
            "\t//描述判定npc: Array(\"慕容复\"),\n" +
            "\t//npcdirection: Array(//可去路径{\n" +
            "\t\tname: \"上海北街\",\n" +
            "\t\ttext: \"北：北街 ↑\"\n" +
            "\t},\n" +
            "\t{\n" +
            "\t\tname: \"上海西街[1]\",\n" +
            "\t\ttext: \"西：西街 ←\"\n" +
            "\t},\n" +
            "\t{\n" +
            "\t\tname: \"上海东街[1]\",\n" +
            "\t\ttext: \"东：东街 →\"\n" +
            "\t},\n" +
            "\t{\n" +
            "\t\tname: \"上海南街[1]\",\n" +
            "\t\ttext: \"南：南街 ↓\"\n" +
            "\t})\n" +
            "},\n" +
            "{\n" +
            "\tname: \"上海北街\",\n" +
            "\t//地图名称text: Array(\"这是一条宽阔的青石街道，向南北两头延伸\",\n" +
            "\t\"北：上海北城门\",\n" +
            "\t\"南：市中心\"),\n" +
            "\t//描述判定npc: Array(),\n" +
            "\t//npcdirection: Array(//可去路径{\n" +
            "\t\tname: \"上海北城门\",\n" +
            "\t\ttext: \"北：上海北城门 ↑\"\n" +
            "\t},\n" +
            "\t{\n" +
            "\t\tname: \"上海客栈\",\n" +
            "\t\ttext: \"东：客栈 →\"\n" +
            "\t},\n" +
            "\t{\n" +
            "\t\tname: \"上海市中心\",\n" +
            "\t\ttext: \"南：市中心 ↓\"\n" +
            "\t})\n" +
            "},\n" +
            "{\n" +
            "\tname: \"上海客栈\",\n" +
            "\t//地图名称text: Array(\"旅途劳累，不妨来休息休息\",\n" +
            "\t\"西：北街\"),\n" +
            "\t//描述判定npc: Array(),\n" +
            "\t//npcdirection: Array(//可去路径{\n" +
            "\t\tname: \"上海北街\",\n" +
            "\t\ttext: \"西：北街 ←\"\n" +
            "\t})\n" +
            "},\n" +
            "{\n" +
            "\tname: \"上海北城门\",\n" +
            "\t//地图名称text: Array(\"这是上海的北城门\",\n" +
            "\t\"南：北街\"),\n" +
            "\t//描述判定npc: Array(\"官兵\"),\n" +
            "\t//npcdirection: Array(//可去路径{\n" +
            "\t\tname: \"苏州山路\",\n" +
            "\t\ttext: \"北：苏州山路 ↑\"\n" +
            "\t},\n" +
            "\t{\n" +
            "\t\tname: \"上海北街\",\n" +
            "\t\ttext: \"南：北街 ↓\"\n" +
            "\t})\n" +
            "},\n" +
            "{\n" +
            "\tname: \"苏州山路\",\n" +
            "\t//地图名称text: Array(\"你走在一条山路上。时值春日\",\n" +
            "\t\"路旁的山坡上开满了金黄色的油菜花。东面是江南名城嘉兴\",\n" +
            "\t\"北：山路 ↑\",\n" +
            "\t\"南：上海北城门 ↓\"),\n" +
            "\t//描述判定npc: Array(),\n" +
            "\t//npcdirection: Array(//可去路径{\n" +
            "\t\tname: \"苏州山路[2]\",\n" +
            "\t\ttext: \"北：山路 ↑\"\n" +
            "\t},\n" +
            "\t{\n" +
            "\t\tname: \"苏州山路[1]\",\n" +
            "\t\ttext: \"东：山路 →\"\n" +
            "\t},\n" +
            "\t{\n" +
            "\t\tname: \"上海北城门\",\n" +
            "\t\ttext: \"南：上海北城门 ↓\"\n" +
            "\t})\n" +
            "},\n" +
            "{\n" +
            "\tname: \"苏州山路[1]\",\n" +
            "\t//地图名称text: Array(\"你走在一条山路上。时值春日\",\n" +
            "\t\"路旁的山坡上开满了金黄色的油菜花\",\n" +
            "\t\"北面是江南名城嘉兴\",\n" +
            "\t\"向南则进入福建武夷山区\",\n" +
            "\t\"西：苏州山路 ←\"),\n" +
            "\t//描述判定npc: Array(),\n" +
            "\t//npcdirection: Array(//可去路径{\n" +
            "\t\tname: \"嘉兴南门\",\n" +
            "\t\ttext: \"北：南门 ↑\"\n" +
            "\t},\n" +
            "\t{\n" +
            "\t\tname: \"苏州山路\",\n" +
            "\t\ttext: \"西：苏州山路 ←\"\n" +
            "\t})\n" +
            "},\n" +
            "{\n" +
            "\tname: \"嘉兴南门\",\n" +
            "\t//地图名称text: Array(\"这里是嘉兴的南门。周围长着茂密的竹林。东面是座庙宇。向南可入福建\",\n" +
            "\t\"北：嘉兴城 ↑\",\n" +
            "\t\"东：铁枪庙 →\",\n" +
            "\t\"南：山路 ↓\"),\n" +
            "\t//描述判定npc: Array(),\n" +
            "\t//npcdirection: Array(//可去路径{\n" +
            "\t\tname: \"嘉兴城\",\n" +
            "\t\ttext: \"北：嘉兴城 ↑\"\n" +
            "\t},\n" +
            "\t{\n" +
            "\t\tname: \"铁枪庙\",\n" +
            "\t\ttext: \"东：铁枪庙 →\"\n" +
            "\t},\n" +
            "\t{\n" +
            "\t\tname: \"苏州山路[1]\",\n" +
            "\t\ttext: \"南：山路 ↓\"\n" +
            "\t})\n" +
            "},\n" +
            "{\n" +
            "\tname: \"铁枪庙\",\n" +
            "\t//地图名称text: Array(\"这铁枪庙祀奉的是五代时名将铁枪王彦章。庙旁有座高塔\",\n" +
            "\t\"北：南湖 ↑\",\n" +
            "\t\"西：南门 ←\"),\n" +
            "\t//描述判定npc: Array(\"乌鸦\"),\n" +
            "\t//npcdirection: Array(//可去路径{\n" +
            "\t\tname: \"南湖[1]\",\n" +
            "\t\ttext: \"北：南湖 ↑\"\n" +
            "\t},\n" +
            "\t{\n" +
            "\t\tname: \"嘉兴南门\",\n" +
            "\t\ttext: \"西：南门 ←\"\n" +
            "\t})\n" +
            "},\n" +
            "{\n" +
            "\tname: \"南湖[1]\",\n" +
            "\t//地图名称text: Array(\"这里是烟波浩淼的南湖。湖上几只画舫在游荡\",\n" +
            "\t\"北：谷底 ↑\",\n" +
            "\t\"西：嘉兴城 ←\"),\n" +
            "\t//描述判定npc: Array(),\n" +
            "\t//npcdirection: Array(//可去路径{\n" +
            "\t\tname: \"谷底\",\n" +
            "\t\ttext: \"北：谷底 ↑\"\n" +
            "\t},\n" +
            "\t{\n" +
            "\t\tname: \"嘉兴城\",\n" +
            "\t\ttext: \"西：嘉兴城 ←\"\n" +
            "\t},\n" +
            "\t{\n" +
            "\t\tname: \"南湖[2]\",\n" +
            "\t\ttext: \"东：南湖 →\"\n" +
            "\t},\n" +
            "\t{\n" +
            "\t\tname: \"铁枪庙\",\n" +
            "\t\ttext: \"南：铁枪庙 ↓\"\n" +
            "\t})\n" +
            "},\n" +
            "{\n" +
            "\tname: \"南湖[2]\",\n" +
            "\t//地图名称text: Array(\"这里是嘉兴南湖。节近中秋\",\n" +
            "\t\"西：南湖 ←\",\n" +
            "\t\"南：山雨楼 ↓\"),\n" +
            "\t//描述判定npc: Array(\"李莫愁\"),\n" +
            "\t//npcdirection: Array(//可去路径{\n" +
            "\t\tname: \"南湖[1]\",\n" +
            "\t\ttext: \"西：南湖 ←\"\n" +
            "\t},\n" +
            "\t{\n" +
            "\t\tname: \"山雨楼\",\n" +
            "\t\ttext: \"南：山雨楼 ↓\"\n" +
            "\t})\n" +
            "},\n" +
            "{\n" +
            "\tname: \"山雨楼\",\n" +
            "\t//地图名称text: Array(\"山雨楼建在南湖中心的一个小岛上\",\n" +
            "\t\"北：南湖 ↑\"),\n" +
            "\t//描述判定npc: Array(),\n" +
            "\t//npcdirection: Array(//可去路径{\n" +
            "\t\tname: \"南湖[2]\",\n" +
            "\t\ttext: \"北：南湖 ↑\"\n" +
            "\t})\n" +
            "},\n" +
            "{\n" +
            "\tname: \"谷底\",\n" +
            "\t//地图名称text: Array(\"这里是一个山谷的底部，不时传来一阵雕鸣\",\n" +
            "\t\"北：草丛 ↑\",\n" +
            "\t\"南：南湖 ↓\"),\n" +
            "\t//描述判定npc: Array(\"丑雕\"),\n" +
            "\t//npcdirection: Array(//可去路径{\n" +
            "\t\tname: \"草丛\",\n" +
            "\t\ttext: \"北：草丛 ↑\"\n" +
            "\t},\n" +
            "\t{\n" +
            "\t\tname: \"南湖[1]\",\n" +
            "\t\ttext: \"南：南湖 ↓\"\n" +
            "\t})\n" +
            "},\n" +
            "{\n" +
            "\tname: \"草丛\",\n" +
            "\t//地图名称text: Array(\"这里是荒谷的东面，一栋草房孤孤单单地座落在荒谷的尽头\",\n" +
            "\t\"南：谷底 ↓\"),\n" +
            "\t//描述判定npc: Array(),\n" +
            "\t//npcdirection: Array(//可去路径{\n" +
            "\t\tname: \"谷底\",\n" +
            "\t\ttext: \"南：谷底 ↓\"\n" +
            "\t})\n" +
            "},\n" +
            "{\n" +
            "\tname: \"嘉兴城\",\n" +
            "\t//地图名称text: Array(\"这里是江南名城嘉兴\",\n" +
            "\t\"北：牛家村街道 ↑\",\n" +
            "\t\"南：南门 ↓\"),\n" +
            "\t//描述判定npc: Array(),\n" +
            "\t//npcdirection: Array(//可去路径{\n" +
            "\t\tname: \"牛家村街道\",\n" +
            "\t\ttext: \"北：牛家村街道 ↑\"\n" +
            "\t},\n" +
            "\t{\n" +
            "\t\tname: \"苏州山路[2]\",\n" +
            "\t\ttext: \"西：山路 ←\"\n" +
            "\t},\n" +
            "\t{\n" +
            "\t\tname: \"南湖[1]\",\n" +
            "\t\ttext: \"东：南湖 →\"\n" +
            "\t},\n" +
            "\t{\n" +
            "\t\tname: \"嘉兴南门\",\n" +
            "\t\ttext: \"南：南门 ↓\"\n" +
            "\t})\n" +
            "},\n" +
            "{\n" +
            "\tname: \"牛家村街道\",\n" +
            "\t//地图名称text: Array(\"你走在一条冷清的街道上\",\n" +
            "\t\"北边有一个很破旧的茅草房。好象常年没人居住了\",\n" +
            "\t\"北：小屋 ↑\",\n" +
            "\t\"南：嘉兴城 ↓\"),\n" +
            "\t//描述判定npc: Array(),\n" +
            "\t//npcdirection: Array(//可去路径{\n" +
            "\t\tname: \"牛家村小屋\",\n" +
            "\t\ttext: \"北：小屋 ↑\"\n" +
            "\t},\n" +
            "\t{\n" +
            "\t\tname: \"嘉兴城\",\n" +
            "\t\ttext: \"南：嘉兴城 ↓\"\n" +
            "\t})\n" +
            "},\n" +
            "{\n" +
            "\tname: \"牛家村小屋\",\n" +
            "\t//地图名称text: Array(\"这是牛家村小屋\",\n" +
            "\t\"北：内室 ↑\",\n" +
            "\t\"南：牛家村街道 ↓\"),\n" +
            "\t//描述判定npc: Array(\"傻姑\"),\n" +
            "\t//npcdirection: Array(//可去路径{\n" +
            "\t\tname: \"牛家村内室\",\n" +
            "\t\ttext: \"北：内室 ↑\"\n" +
            "\t},\n" +
            "\t{\n" +
            "\t\tname: \"牛家村街道\",\n" +
            "\t\ttext: \"南：牛家村街道 ↓\"\n" +
            "\t})\n" +
            "},\n" +
            "{\n" +
            "\tname: \"牛家村内室\",\n" +
            "\t//地图名称text: Array(\"这里看起来破破烂烂\",\n" +
            "\t\"不过收拾的相当整洁\",\n" +
            "\t\"南：小屋 ↓\"),\n" +
            "\t//描述判定npc: Array(),\n" +
            "\t//npcdirection: Array(//可去路径{\n" +
            "\t\tname: \"牛家村小屋\",\n" +
            "\t\ttext: \"南：小屋 ↓\"\n" +
            "\t})\n" +
            "},\n" +
            "{\n" +
            "\tname: \"苏州山路[2]\",\n" +
            "\t//地图名称text: Array(\"你走在一条山路上\",\n" +
            "\t\"时值春日\",\n" +
            "\t\"路旁的山坡上开满了金黄色的油菜花\",\n" +
            "\t\"北：山路 ↑\",\n" +
            "\t\"东：嘉兴城 →\",\n" +
            "\t\"南：苏州山路 ↓\"),\n" +
            "\t//描述判定npc: Array(),\n" +
            "\t//npcdirection: Array(//可去路径{\n" +
            "\t\tname: \"苏州山路[3]\",\n" +
            "\t\ttext: \"北：山路 ↑\"\n" +
            "\t},\n" +
            "\t{\n" +
            "\t\tname: \"嘉兴城\",\n" +
            "\t\ttext: \"东：嘉兴城 →\"\n" +
            "\t},\n" +
            "\t{\n" +
            "\t\tname: \"苏州山路\",\n" +
            "\t\ttext: \"南：苏州山路 ↓\"\n" +
            "\t})\n" +
            "},\n" +
            "{\n" +
            "\tname: \"苏州山路[3]\",\n" +
            "\t//地图名称text: Array(\"你走在一条山路上\",\n" +
            "\t\"时值春日\",\n" +
            "\t\"路旁的山坡上开满了金黄色的油菜花\",\n" +
            "\t\"西：荒野 ←\",\n" +
            "\t\"南：山路 ↓\"),\n" +
            "\t//描述判定npc: Array(),\n" +
            "\t//npcdirection: Array(//可去路径{\n" +
            "\t\tname: \"苏州荒野\",\n" +
            "\t\ttext: \"西：荒野 ←\"\n" +
            "\t},\n" +
            "\t{\n" +
            "\t\tname: \"苏州山路[2]\",\n" +
            "\t\ttext: \"南：山路 ↓\"\n" +
            "\t})\n" +
            "},\n" +
            "{\n" +
            "\tname: \"苏州荒野\",\n" +
            "\t//地图名称text: Array(\"这是苏州南门外的荒野\",\n" +
            "\t\"北：南城门 ↑\",\n" +
            "\t\"东：山路 →\"),\n" +
            "\t//描述判定npc: Array(),\n" +
            "\t//npcdirection: Array(//可去路径{\n" +
            "\t\tname: \"嘉兴南城门\",\n" +
            "\t\ttext: \"北：南城门 ↑\"\n" +
            "\t},\n" +
            "\t{\n" +
            "\t\tname: \"苏州山路[3]\",\n" +
            "\t\ttext: \"东：山路 →\"\n" +
            "\t})\n" +
            "},\n" +
            "{\n" +
            "\tname: \"嘉兴南城门\",\n" +
            "\t//地图名称text: Array(\"这里是嘉兴的南门\",\n" +
            "\t\"北：南街 ↑\",\n" +
            "\t\"南：荒野 ↓\"),\n" +
            "\t//描述判定npc: Array(),\n" +
            "\t//npcdirection: Array(//可去路径{\n" +
            "\t\tname: \"苏州南街[2]\",\n" +
            "\t\ttext: \"北：南街 ↑\"\n" +
            "\t},\n" +
            "\t{\n" +
            "\t\tname: \"苏州荒野\",\n" +
            "\t\ttext: \"南：荒野 ↓\"\n" +
            "\t})\n" +
            "},\n" +
            "{\n" +
            "\tname: \"苏州南街[2]\",\n" +
            "\t//地图名称text: Array(\"南大街乃是城里的繁华地段\",\n" +
            "\t\"北：南街 ↑\",\n" +
            "\t\"西：园林 ←\"),\n" +
            "\t//描述判定npc: Array(),\n" +
            "\t//npcdirection: Array(//可去路径{\n" +
            "\t\tname: \"苏州南街[1]\",\n" +
            "\t\ttext: \"北：南街 ↑\"\n" +
            "\t},\n" +
            "\t{\n" +
            "\t\tname: \"苏州园林[1]\",\n" +
            "\t\ttext: \"西：园林 ←\"\n" +
            "\t},\n" +
            "\t{\n" +
            "\t\tname: \"苏州南街小巷子\",\n" +
            "\t\ttext: \"东：小巷子 →\"\n" +
            "\t},\n" +
            "\t{\n" +
            "\t\tname: \"嘉兴南城门\",\n" +
            "\t\ttext: \"南：南城门 ↓\"\n" +
            "\t})\n" +
            "},\n" +
            "{\n" +
            "\tname: \"苏州园林[1]\",\n" +
            "\t//地图名称text: Array(\"一走入这个庭园，扑鼻而来的便是一股若有似无\",\n" +
            "\t\"北：园林 ↑\",\n" +
            "\t\"东：南街 →\"),\n" +
            "\t//描述判定npc: Array(),\n" +
            "\t//npcdirection: Array(//可去路径{\n" +
            "\t\tname: \"苏州园林[2]\",\n" +
            "\t\ttext: \"北：园林 ↑\"\n" +
            "\t},\n" +
            "\t{\n" +
            "\t\tname: \"苏州南街[2]\",\n" +
            "\t\ttext: \"东：南街 →\"\n" +
            "\t})\n" +
            "},\n" +
            "{\n" +
            "\tname: \"苏州园林[2]\",\n" +
            "\t//地图名称text: Array(\"小亭的地板是以不同颜色的细石砌成各种图案\",\n" +
            "\t\"北：园林 ↑\",\n" +
            "\t\"东：园林 →\"),\n" +
            "\t//描述判定npc: Array(),\n" +
            "\t//npcdirection: Array(//可去路径{\n" +
            "\t\tname: \"苏州园林[4]\",\n" +
            "\t\ttext: \"北：园林 ↑\"\n" +
            "\t},\n" +
            "\t{\n" +
            "\t\tname: \"苏州园林[3]\",\n" +
            "\t\ttext: \"东：园林 →\"\n" +
            "\t},\n" +
            "\t{\n" +
            "\t\tname: \"苏州园林[1]\",\n" +
            "\t\ttext: \"南：园林 ↓\"\n" +
            "\t})\n" +
            "},\n" +
            "{\n" +
            "\tname: \"苏州园林[3]\",\n" +
            "\t//地图名称text: Array(\"你走至荷花池的大桥上，见水如晶帘一般奔入\",\n" +
            "\t\"西：园林 ←\"),\n" +
            "\t//描述判定npc: Array(),\n" +
            "\t//npcdirection: Array(//可去路径{\n" +
            "\t\tname: \"苏州园林[2]\",\n" +
            "\t\ttext: \"西：园林 ←\"\n" +
            "\t})\n" +
            "},\n" +
            "{\n" +
            "\tname: \"苏州园林[4]\",\n" +
            "\t//地图名称text: Array(\"穿过一层竹篱、花嶂编的月洞门\",\n" +
            "\t\"西：园林 ←\",\n" +
            "\t\"南：园林 ↓\"),\n" +
            "\t//描述判定npc: Array(),\n" +
            "\t//npcdirection: Array(//可去路径{\n" +
            "\t\tname: \"苏州园林[5]\",\n" +
            "\t\ttext: \"西：园林 ←\"\n" +
            "\t},\n" +
            "\t{\n" +
            "\t\tname: \"苏州南街[2]\",\n" +
            "\t\ttext: \"南：园林 ↓\"\n" +
            "\t})\n" +
            "},\n" +
            "{\n" +
            "\tname: \"苏州园林[5]\",\n" +
            "\t//地图名称text: Array(\"你一进了小亭内\",\n" +
            "\t\"只觉异香扑鼻\",\n" +
            "\t\"东：园林 →\"),\n" +
            "\t//描述判定npc: Array(),\n" +
            "\t//npcdirection: Array(//可去路径{\n" +
            "\t\tname: \"苏州园林[4]\",\n" +
            "\t\ttext: \"东：园林 →\"\n" +
            "\t})\n" +
            "},\n" +
            "{\n" +
            "\tname: \"苏州南街小巷子\",\n" +
            "\t//地图名称text: Array(\"这是一条昏暗的小巷子\",\n" +
            "\t\"里面充满了不祥的气息\",\n" +
            "\t\"北：小店 ↑\"),\n" +
            "\t//描述判定npc: Array(),\n" +
            "\t//npcdirection: Array(//可去路径{\n" +
            "\t\tname: \"苏州小店\",\n" +
            "\t\ttext: \"北：小店 ↑\"\n" +
            "\t},\n" +
            "\t{\n" +
            "\t\tname: \"苏州南街[2]\",\n" +
            "\t\ttext: \"西：南街 ←\"\n" +
            "\t})\n" +
            "},\n" +
            "{\n" +
            "\tname: \"苏州小店\",\n" +
            "\t//地图名称text: Array(\"这家店出名的不是它卖的东西，而是它的老板娘---迎风\",\n" +
            "\t\"南：小巷子 ↓\"),\n" +
            "\t//描述判定npc: Array(\"迎风\"),\n" +
            "\t//npcdirection: Array(//可去路径{\n" +
            "\t\tname: \"苏州南街小巷子\",\n" +
            "\t\ttext: \"南：小巷子 ↓\"\n" +
            "\t})\n" +
            "},\n" +
            "{\n" +
            "\tname: \"苏州南街[1]\",\n" +
            "\t//地图名称text: Array(\"你走在一条繁忙的街道上\",\n" +
            "\t\"看着操着南腔北调的人们行色匆匆\",\n" +
            "\t\"北：市中心 ↑\",\n" +
            "\t\"西：红娘庄 ←\"),\n" +
            "\t//描述判定npc: Array(),\n" +
            "\t//npcdirection: Array(//可去路径{\n" +
            "\t\tname: \"苏州市中心\",\n" +
            "\t\ttext: \"北：市中心 ↑\"\n" +
            "\t},\n" +
            "\t{\n" +
            "\t\tname: \"苏州红娘庄\",\n" +
            "\t\ttext: \"西：红娘庄 ←\"\n" +
            "\t},\n" +
            "\t{\n" +
            "\t\tname: \"苏州客店\",\n" +
            "\t\ttext: \"东：客店 →\"\n" +
            "\t},\n" +
            "\t{\n" +
            "\t\tname: \"苏州南街[2]\",\n" +
            "\t\ttext: \"南：南街 ↓\"\n" +
            "\t})\n" +
            "},\n" +
            "{\n" +
            "\tname: \"苏州红娘庄\",\n" +
            "\t//地图名称text: Array(\"你现在正站在红娘庄里\",\n" +
            "\t\"这里是专门替人缔结婚约和解除婚约的地方\",\n" +
            "\t\"东：南街 →\"),\n" +
            "\t//描述判定npc: Array(\"迎风\"),\n" +
            "\t//npcdirection: Array(//可去路径{\n" +
            "\t\tname: \"苏州南街[1]\",\n" +
            "\t\ttext: \"东：南街 →\"\n" +
            "\t})\n" +
            "},\n" +
            "{\n" +
            "\tname: \"苏州客店\",\n" +
            "\t//地图名称text: Array(\"这是一家价钱低廉的客栈\",\n" +
            "\t\"生意非常兴隆。外地游客多选择这里落脚\",\n" +
            "\t\"西：南街 ←\"),\n" +
            "\t//描述判定npc: Array(\"迎风\"),\n" +
            "\t//npcdirection: Array(//可去路径{\n" +
            "\t\tname: \"苏州南街[1]\",\n" +
            "\t\ttext: \"西：南街 ←\"\n" +
            "\t})\n" +
            "},\n" +
            "{\n" +
            "\tname: \"苏州市中心\",\n" +
            "\t//地图名称text: Array(\"这儿就是苏州城的市中心了\",\n" +
            "\t\"来来往往的行人不停的经过你身边\",\n" +
            "\t\"北：北街 ↑\",\n" +
            "\t\"西：西街 ←\"),\n" +
            "\t//描述判定npc: Array(\"花花公子\",\n" +
            "\t\"卖艺人\"),\n" +
            "\t//npcdirection: Array(//可去路径{\n" +
            "\t\tname: \"苏州北街[1]\",\n" +
            "\t\ttext: \"北：北街 ↑\"\n" +
            "\t},\n" +
            "\t{\n" +
            "\t\tname: \"苏州西街[1]\",\n" +
            "\t\ttext: \"西：西街 ←\"\n" +
            "\t},\n" +
            "\t{\n" +
            "\t\tname: \"苏州东街[1]\",\n" +
            "\t\ttext: \"东：东街 →\"\n" +
            "\t},\n" +
            "\t{\n" +
            "\t\tname: \"苏州南街[1]\",\n" +
            "\t\ttext: \"南：南街 ↓\"\n" +
            "\t})\n" +
            "},\n" +
            "{\n" +
            "\tname: \"苏州北街[1]\",\n" +
            "\t//地图名称text: Array(\"这是一条宽阔的青石街道，向南北两头延伸\",\n" +
            "\t\"北：北街 ↑\",\n" +
            "\t\"西：酒楼 ←\"),\n" +
            "\t//描述判定npc: Array(),\n" +
            "\t//npcdirection: Array(//可去路径{\n" +
            "\t\tname: \"苏州北街[2]\",\n" +
            "\t\ttext: \"北：北街 ↑\"\n" +
            "\t},\n" +
            "\t{\n" +
            "\t\tname: \"苏州酒楼\",\n" +
            "\t\ttext: \"西：酒楼 ←\"\n" +
            "\t},\n" +
            "\t{\n" +
            "\t\tname: \"武墓祠\",\n" +
            "\t\ttext: \"东：武墓祠 →\"\n" +
            "\t},\n" +
            "\t{\n" +
            "\t\tname: \"苏州市中心\",\n" +
            "\t\ttext: \"南：南街 ↓\"\n" +
            "\t})\n" +
            "},\n" +
            "{\n" +
            "\tname: \"苏州酒楼\",\n" +
            "\t//地图名称text: Array(\"八仙酒楼可是非常出名的一家酒楼\",\n" +
            "\t\"东：北街 →\",\n" +
            "\t\"南：西街 ↓\"),\n" +
            "\t//描述判定npc: Array(\"苗若兰\",\n" +
            "\t\"苗心儿\"),\n" +
            "\t//npcdirection: Array(//可去路径{\n" +
            "\t\tname: \"苏州北街[1]\",\n" +
            "\t\ttext: \"东：北街 →\"\n" +
            "\t},\n" +
            "\t{\n" +
            "\t\tname: \"苏州西街[1]\",\n" +
            "\t\ttext: \"南：西街 ↓\"\n" +
            "\t})\n" +
            "},\n" +
            "{\n" +
            "\tname: \"武墓祠\",\n" +
            "\t//地图名称text: Array(\"这是武穆公岳飞的祠堂\",\n" +
            "\t\"岳飞被秦桧害死后，他的躯体埋在杭州西。湖边\",\n" +
            "\t\"西：北街 ←\"),\n" +
            "\t//描述判定npc: Array(),\n" +
            "\t//npcdirection: Array(//可去路径{\n" +
            "\t\tname: \"苏州北街[1]\",\n" +
            "\t\ttext: \"西：北街 ←\"\n" +
            "\t})\n" +
            "},\n" +
            "{\n" +
            "\tname: \"苏州北街[2]\",\n" +
            "\t//地图名称text: Array(\"这是一条宽阔的青石街道，向南北两头延伸\",\n" +
            "\t\"北：北城门 ↑\",\n" +
            "\t\"西：茶馆 ←\"),\n" +
            "\t//描述判定npc: Array(),\n" +
            "\t//npcdirection: Array(//可去路径{\n" +
            "\t\tname: \"苏州北城门\",\n" +
            "\t\ttext: \"北：北城门 ↑\"\n" +
            "\t},\n" +
            "\t{\n" +
            "\t\tname: \"苏州茶馆\",\n" +
            "\t\ttext: \"西：茶馆 ←\"\n" +
            "\t},\n" +
            "\t{\n" +
            "\t\tname: \"苏州驿站\",\n" +
            "\t\ttext: \"东：驿站 →\"\n" +
            "\t},\n" +
            "\t{\n" +
            "\t\tname: \"苏州北街[1]\",\n" +
            "\t\ttext: \"南：北街 ↓\"\n" +
            "\t})\n" +
            "},\n" +
            "{\n" +
            "\tname: \"苏州北城门\",\n" +
            "\t//地图名称text: Array(\"这是素来有天堂之称的苏州的北城门\",\n" +
            "\t\"城门正上方写有“北门”两个。大字\",\n" +
            "\t\"南：北街 ↓\"),\n" +
            "\t//描述判定npc: Array(),\n" +
            "\t//npcdirection: Array(//可去路径{\n" +
            "\t\tname: \"苏州北街[2]\",\n" +
            "\t\ttext: \"南：北街 ↓\"\n" +
            "\t})\n" +
            "},\n" +
            "{\n" +
            "\tname: \"苏州茶馆\",\n" +
            "\t//地图名称text: Array(\"你一走进来，就闻到一股茶香沁入心脾，精神为之一爽\",\n" +
            "\t\"几张八仙桌一字。排开，坐满了客人\",\n" +
            "\t\"东：北街 →\"),\n" +
            "\t//描述判定npc: Array(\"茶馆老板\"),\n" +
            "\t//npcdirection: Array(//可去路径{\n" +
            "\t\tname: \"苏州北街[2]\",\n" +
            "\t\ttext: \"东：北街 →\"\n" +
            "\t})\n" +
            "},\n" +
            "{\n" +
            "\tname: \"苏州驿站\",\n" +
            "\t//地图名称text: Array(\"这里是本地的驿站\",\n" +
            "\t\"有钱人可以从这里雇车去往外地。墙上有一块牌子\",\n" +
            "\t\"西：北街 ←\"),\n" +
            "\t//描述判定npc: Array(\"阿红\"),\n" +
            "\t//npcdirection: Array(//可去路径{\n" +
            "\t\tname: \"苏州北街[2]\",\n" +
            "\t\ttext: \"西：北街 ←\"\n" +
            "\t})\n" +
            "},\n" +
            "{\n" +
            "\tname: \"苏州西街[1]\",\n" +
            "\t//地图名称text: Array(\"这是一条宽阔的青石板街道，向东西两头延伸\",\n" +
            "\t\"北：酒楼 ↑\",\n" +
            "\t\"西：西街 ←\"),\n" +
            "\t//描述判定npc: Array(\"郭啸天\"),\n" +
            "\t//npcdirection: Array(//可去路径{\n" +
            "\t\tname: \"苏州酒楼\",\n" +
            "\t\ttext: \"北：酒楼 ↑\"\n" +
            "\t},\n" +
            "\t{\n" +
            "\t\tname: \"苏州西街[2]\",\n" +
            "\t\ttext: \"西：西街 ←\"\n" +
            "\t},\n" +
            "\t{\n" +
            "\t\tname: \"苏州市中心\",\n" +
            "\t\ttext: \"东：市中心 →\"\n" +
            "\t},\n" +
            "\t{\n" +
            "\t\tname: \"苏州左家大门\",\n" +
            "\t\ttext: \"南：大门 ↓\"\n" +
            "\t})\n" +
            "},\n" +
            "{\n" +
            "\tname: \"苏州左家大门\",\n" +
            "\t//地图名称text: Array(\"左家是这儿的大户\",\n" +
            "\t\"北：西街 ↑\",\n" +
            "\t\"西：后院 ←\"),\n" +
            "\t//描述判定npc: Array(\"家丁\"),\n" +
            "\t//npcdirection: Array(//可去路径{\n" +
            "\t\tname: \"苏州西街[1]\",\n" +
            "\t\ttext: \"北：西街 ↑\"\n" +
            "\t},\n" +
            "\t{\n" +
            "\t\tname: \"苏州左家后院[1]\",\n" +
            "\t\ttext: \"西：后院 ←\"\n" +
            "\t})\n" +
            "},\n" +
            "{\n" +
            "\tname: \"苏州左家后院[1]\",\n" +
            "\t//地图名称text: Array(\"这里是左家后院\",\n" +
            "\t\"西：大院 ←\",\n" +
            "\t\"东：大门 →\"),\n" +
            "\t//描述判定npc: Array(),\n" +
            "\t//npcdirection: Array(//可去路径{\n" +
            "\t\tname: \"苏州左家大院\",\n" +
            "\t\ttext: \"西：大院 ←\"\n" +
            "\t},\n" +
            "\t{\n" +
            "\t\tname: \"苏州左家大门\",\n" +
            "\t\ttext: \"东：大门 →\"\n" +
            "\t})\n" +
            "},\n" +
            "{\n" +
            "\tname: \"苏州左家大院\",\n" +
            "\t//地图名称text: Array(\"你走进大院，迎面是一个屏风\",\n" +
            "\t\"西：左家后院 ←\",\n" +
            "\t\"东：后院 →\"),\n" +
            "\t//描述判定npc: Array(\"园丁\"),\n" +
            "\t//npcdirection: Array(//可去路径{\n" +
            "\t\tname: \"苏州左家后院\",\n" +
            "\t\ttext: \"西：左家后院 ←\"\n" +
            "\t},\n" +
            "\t{\n" +
            "\t\tname: \"苏州左家后院[1]\",\n" +
            "\t\ttext: \"东：后院 →\"\n" +
            "\t})\n" +
            "},\n" +
            "{\n" +
            "\tname: \"苏州左家后院\",\n" +
            "\t//地图名称text: Array(\"你走进后院，迎面是一口大锅\",\n" +
            "\t\"东：大院 →\"),\n" +
            "\t//描述判定npc: Array(\"左轻候\"),\n" +
            "\t//npcdirection: Array(//可去路径{\n" +
            "\t\tname: \"苏州左家大院\",\n" +
            "\t\ttext: \"东：大院 →\"\n" +
            "\t})\n" +
            "},\n" +
            "{\n" +
            "\tname: \"苏州西街[2]\",\n" +
            "\t//地图名称text: Array(\"你走在西大街上，感到这里的街面要比别处的干净、整洁\",\n" +
            "\t\"北：小巷子 ↑\",\n" +
            "\t\"南：静心斋 \"),\n" +
            "\t//描述判定npc: Array(),\n" +
            "\t//npcdirection: Array(//可去路径{\n" +
            "\t\tname: \"苏州西街小巷子[1]\",\n" +
            "\t\ttext: \"北：小巷子 ↑\"\n" +
            "\t},\n" +
            "\t{\n" +
            "\t\tname: \"苏州西街[3]\",\n" +
            "\t\ttext: \"西：西街 ←\"\n" +
            "\t},\n" +
            "\t{\n" +
            "\t\tname: \"苏州西街[1]\",\n" +
            "\t\ttext: \"东：西街 →\"\n" +
            "\t},\n" +
            "\t{\n" +
            "\t\tname: \"静心斋\",\n" +
            "\t\ttext: \"南：静心斋 ↓\"\n" +
            "\t})\n" +
            "},\n" +
            "{\n" +
            "\tname: \"苏州西街小巷子[1]\",\n" +
            "\t//地图名称text: Array(\"这是一条繁荣的街道，来来往往的旅客和游人在街上逛着\",\n" +
            "\t\"北：小巷子 ↑\",\n" +
            "\t\"南：西街 ↓\"),\n" +
            "\t//描述判定npc: Array(\"流氓\"),\n" +
            "\t//npcdirection: Array(//可去路径{\n" +
            "\t\tname: \"苏州西街小巷子[2]\",\n" +
            "\t\ttext: \"北：小巷子 ↑\"\n" +
            "\t},\n" +
            "\t{\n" +
            "\t\tname: \"苏州西街[2]\",\n" +
            "\t\ttext: \"南：西街 ↓\"\n" +
            "\t})\n" +
            "},\n" +
            "{\n" +
            "\tname: \"苏州西街小巷子[2]\",\n" +
            "\t//地图名称text: Array(\"来来往往的旅客和游人在街上逛着\",\n" +
            "\t\"看有没有。合适的东西可买\",\n" +
            "\t\"南：小巷子 ↓\"),\n" +
            "\t//描述判定npc: Array(\"蒙面人\"),\n" +
            "\t//npcdirection: Array(//可去路径{\n" +
            "\t\tname: \"苏州西街小巷子[1]\",\n" +
            "\t\ttext: \"南：小巷子 ↓\"\n" +
            "\t})\n" +
            "},\n" +
            "{\n" +
            "\tname: \"静心斋\",\n" +
            "\t//地图名称text: Array(\"这里是静心斋的讲堂\",\n" +
            "\t\"窗明几净，一尘不染。一位庄重严肃的老者坐在太师。椅上讲学\",\n" +
            "\t\"北：西街 ↑\"),\n" +
            "\t//描述判定npc: Array(),\n" +
            "\t//npcdirection: Array(//可去路径{\n" +
            "\t\tname: \"苏州西街[2]\",\n" +
            "\t\ttext: \"北：西街 ↑\"\n" +
            "\t})\n" +
            "},\n" +
            "{\n" +
            "\tname: \"苏州西街[3]\",\n" +
            "\t//地图名称text: Array(\"西大街上，感到这里的街面要比别处的干净、整洁\",\n" +
            "\t\"北：镖局 ↑\",\n" +
            "\t\"南：小吃店 ↓\"),\n" +
            "\t//描述判定npc: Array(),\n" +
            "\t//npcdirection: Array(//可去路径{\n" +
            "\t\tname: \"苏州镖局\",\n" +
            "\t\ttext: \"北：镖局 ↑\"\n" +
            "\t},\n" +
            "\t{\n" +
            "\t\tname: \"苏州西街[4]\",\n" +
            "\t\ttext: \"西：西街 ←\"\n" +
            "\t},\n" +
            "\t{\n" +
            "\t\tname: \"苏州西街[2]\",\n" +
            "\t\ttext: \"东：西街 →\"\n" +
            "\t},\n" +
            "\t{\n" +
            "\t\tname: \"苏州小吃店\",\n" +
            "\t\ttext: \"南：小吃店 ↓\"\n" +
            "\t})\n" +
            "},\n" +
            "{\n" +
            "\tname: \"苏州镖局\",\n" +
            "\t//地图名称text: Array(\"你来到一座结构宏伟的建筑前\"),\n" +
            "\t//描述判定npc: Array(\"纪嫣然\"),\n" +
            "\t//npcdirection: Array(//可去路径{\n" +
            "\t\tname: \"苏州镖局练武场\",\n" +
            "\t\ttext: \"北：练武场 ↑\"\n" +
            "\t},\n" +
            "\t{\n" +
            "\t\tname: \"苏州西街[3]\",\n" +
            "\t\ttext: \"南：西街 ↓\"\n" +
            "\t})\n" +
            "},\n" +
            "{\n" +
            "\tname: \"苏州镖局练武场\",\n" +
            "\t//地图名称text: Array(\"这是镖局弟子练武的地方，几个镖局弟子正在练武\"),\n" +
            "\t//描述判定npc: Array(\"镖头\",\n" +
            "\t\"镖局弟子\"),\n" +
            "\t//npcdirection: Array(//可去路径{\n" +
            "\t\tname: \"苏州镖局大厅\",\n" +
            "\t\ttext: \"北：大厅 ↑\"\n" +
            "\t},\n" +
            "\t{\n" +
            "\t\tname: \"苏州镖局器械房\",\n" +
            "\t\ttext: \"西：器械房 ←\"\n" +
            "\t},\n" +
            "\t{\n" +
            "\t\tname: \"苏州镖局帐房\",\n" +
            "\t\ttext: \"东：帐房 →\"\n" +
            "\t},\n" +
            "\t{\n" +
            "\t\tname: \"苏州镖局\",\n" +
            "\t\ttext: \"南：镖局 ↓\"\n" +
            "\t})\n" +
            "},\n" +
            "{\n" +
            "\tname: \"苏州镖局大厅\",\n" +
            "\t//地图名称text: Array(\"这是镖局大厅\",\n" +
            "\t\"南：练武场 ↓\"),\n" +
            "\t//描述判定npc: Array(\"江小川\"),\n" +
            "\t//npcdirection: Array(//可去路径{\n" +
            "\t\tname: \"苏州镖局练武场\",\n" +
            "\t\ttext: \"南：练武场 ↓\"\n" +
            "\t})\n" +
            "},\n" +
            "{\n" +
            "\tname: \"苏州镖局器械房\",\n" +
            "\t//地图名称text: Array(\"这里是堆放镖局专用器械的地方\",\n" +
            "\t\"东：练武场 →\"),\n" +
            "\t//描述判定npc: Array(),\n" +
            "\t//npcdirection: Array(//可去路径{\n" +
            "\t\tname: \"苏州镖局练武场\",\n" +
            "\t\ttext: \"东：练武场 →\"\n" +
            "\t})\n" +
            "},\n" +
            "{\n" +
            "\tname: \"苏州镖局帐房\",\n" +
            "\t//地图名称text: Array(\"这是镖局管理帐目的地方\",\n" +
            "\t\"北：精进楼 ↑\",\n" +
            "\t\"西：练武场 ←\"),\n" +
            "\t//描述判定npc: Array(\"林太平\"),\n" +
            "\t//npcdirection: Array(//可去路径{\n" +
            "\t\tname: \"苏州镖局精进楼[1]\",\n" +
            "\t\ttext: \"北：精进楼 ↑\"\n" +
            "\t},\n" +
            "\t{\n" +
            "\t\tname: \"苏州镖局练武场\",\n" +
            "\t\ttext: \"西：练武场 ←\"\n" +
            "\t})\n" +
            "},\n" +
            "{\n" +
            "\tname: \"苏州镖局精进楼[1]\",\n" +
            "\t//地图名称text: Array(\"过一个香草芬芳的园子，你来到了镖局弟子门学功夫的精进楼\",\n" +
            "\t\"北：精进楼 ↑\",\n" +
            "\t\"南：帐房 ↓\"),\n" +
            "\t//描述判定npc: Array(\"金乌\"),\n" +
            "\t//npcdirection: Array(//可去路径{\n" +
            "\t\tname: \"苏州镖局精进楼[2]\",\n" +
            "\t\ttext: \"北：精进楼 ↑\"\n" +
            "\t},\n" +
            "\t{\n" +
            "\t\tname: \"苏州镖局帐房\",\n" +
            "\t\ttext: \"南：帐房 ↓\"\n" +
            "\t})\n" +
            "},\n" +
            "{\n" +
            "\tname: \"苏州镖局精进楼[2]\",\n" +
            "\t//地图名称text: Array(\"你快步来到二楼，眼前的情景让你大吃一惊。只见这地方足足。有外边的练武场大，\",\n" +
            "\t\"北：精进楼 ↑\",\n" +
            "\t\"南：精进楼 ↓\"),\n" +
            "\t//描述判定npc: Array(\"富人\"),\n" +
            "\t//npcdirection: Array(//可去路径{\n" +
            "\t\tname: \"苏州镖局精进楼[3]\",\n" +
            "\t\ttext: \"北：精进楼 ↑\"\n" +
            "\t},\n" +
            "\t{\n" +
            "\t\tname: \"苏州镖局精进楼[1]\",\n" +
            "\t\ttext: \"南：精进楼 ↓\"\n" +
            "\t})\n" +
            "},\n" +
            "{\n" +
            "\tname: \"苏州镖局精进楼[3]\",\n" +
            "\t//地图名称text: Array(\"你踏着古老的木梯来到三楼\",\n" +
            "\t\"见几个趟子手正在专心地修炼\",\n" +
            "\t\"南：精进楼 ↓\"),\n" +
            "\t//描述判定npc: Array(),\n" +
            "\t//npcdirection: Array(//可去路径{\n" +
            "\t\tname: \"苏州镖局精进楼[2]\",\n" +
            "\t\ttext: \"南：精进楼 ↓\"\n" +
            "\t})\n" +
            "},\n" +
            "{\n" +
            "\tname: \"苏州小吃店\",\n" +
            "\t//地图名称text: Array(\"你来到小吃店，小二立即迎了上来\",\n" +
            "\t\"这儿有不少客人再品赏着风味各异的小吃\",\n" +
            "\t\"北：西街 ↑\"),\n" +
            "\t//描述判定npc: Array(),\n" +
            "\t//npcdirection: Array(//可去路径{\n" +
            "\t\tname: \"苏州西街[3]\",\n" +
            "\t\ttext: \"北：西街 ↑\"\n" +
            "\t})\n" +
            "},\n" +
            "{\n" +
            "\tname: \"苏州西街[4]\",\n" +
            "\t//地图名称text: Array(\"你走在西大街上，感到这里的街面要比别处的干净、整洁\",\n" +
            "\t\"北：水井 ↑\",\n" +
            "\t\"南：杂货铺 ↓\"),\n" +
            "\t//描述判定npc: Array(),\n" +
            "\t//npcdirection: Array(//可去路径{\n" +
            "\t\tname: \"苏州水井\",\n" +
            "\t\ttext: \"北：水井 ↑\"\n" +
            "\t},\n" +
            "\t{\n" +
            "\t\tname: \"苏州西大驿道[1]\",\n" +
            "\t\ttext: \"西：大驿道 ←\"\n" +
            "\t},\n" +
            "\t{\n" +
            "\t\tname: \"苏州西街[3]\",\n" +
            "\t\ttext: \"东：西街 →\"\n" +
            "\t},\n" +
            "\t{\n" +
            "\t\tname: \"苏州杂货铺\",\n" +
            "\t\ttext: \"南：杂货铺 ↓\"\n" +
            "\t})\n" +
            "},\n" +
            "{\n" +
            "\tname: \"苏州水井\",\n" +
            "\t//地图名称text: Array(\"你来到一口水井旁。这儿可以免费喝水\",\n" +
            "\t\"你一想到这儿，不由呵呵笑了\",\n" +
            "\t\"南：西街 ↓\"),\n" +
            "\t//描述判定npc: Array(),\n" +
            "\t//npcdirection: Array(//可去路径{\n" +
            "\t\tname: \"苏州西街[4]\",\n" +
            "\t\ttext: \"南：西街 ↓\"\n" +
            "\t})\n" +
            "},\n" +
            "{\n" +
            "\tname: \"苏州杂货铺\",\n" +
            "\t//地图名称text: Array(\"这是一家小小的杂货铺\",\n" +
            "\t\"北：西街 ↑\"),\n" +
            "\t//描述判定npc: Array(\"梁万良\"),\n" +
            "\t//npcdirection: Array(//可去路径{\n" +
            "\t\tname: \"苏州西街[4]\",\n" +
            "\t\ttext: \"北：西街 ↑\"\n" +
            "\t})\n" +
            "},\n" +
            "{\n" +
            "\tname: \"苏州西大驿道[1]\",\n" +
            "\t//地图名称text: Array(\"你走在一条静谧的小道上，远处能否看到森林\",\n" +
            "\t\"北：大驿道 ↑\",\n" +
            "\t\"东：西街 →\"),\n" +
            "\t//描述判定npc: Array(),\n" +
            "\t//npcdirection: Array(//可去路径{\n" +
            "\t\tname: \"苏州西大驿道[2]\",\n" +
            "\t\ttext: \"北：大驿道 ↑\"\n" +
            "\t},\n" +
            "\t{\n" +
            "\t\tname: \"苏州西街[4]\",\n" +
            "\t\ttext: \"东：西街 →\"\n" +
            "\t})\n" +
            "},\n" +
            "{\n" +
            "\tname: \"苏州西大驿道[2]\",\n" +
            "\t//地图名称text: Array(\"你走在一条尘土飞扬的大驿道上。四周人来人往\",\n" +
            "\t\"西：大驿道 ←\",\n" +
            "\t\"南：大驿道 ↓\"),\n" +
            "\t//描述判定npc: Array(),\n" +
            "\t//npcdirection: Array(//可去路径{\n" +
            "\t\tname: \"苏州西大驿道[3]\",\n" +
            "\t\ttext: \"西：大驿道 ←\"\n" +
            "\t},\n" +
            "\t{\n" +
            "\t\tname: \"苏州西大驿道[1]\",\n" +
            "\t\ttext: \"南：大驿道 ↓\"\n" +
            "\t})\n" +
            "},\n" +
            "{\n" +
            "\tname: \"苏州西大驿道[3]\",\n" +
            "\t//地图名称text: Array(\"你走在一条尘土飞扬的大驿道上。四周人来人往\",\n" +
            "\t\"东：大驿道 →\"),\n" +
            "\t//描述判定npc: Array(),\n" +
            "\t//npcdirection: Array(//可去路径{\n" +
            "\t\tname: \"苏州西大驿道[2]\",\n" +
            "\t\ttext: \"东：大驿道 →\"\n" +
            "\t})\n" +
            "},\n" +
            "{\n" +
            "\tname: \"苏州东街[1]\",\n" +
            "\t//地图名称text: Array(\"这是一条宽阔的青石板街道，向东西两头延伸\",\n" +
            "\t\"北：钱庄 ↑\",\n" +
            "\t\"南：当铺 ↓\"),\n" +
            "\t//描述判定npc: Array(),\n" +
            "\t//npcdirection: Array(//可去路径{\n" +
            "\t\tname: \"苏州钱庄\",\n" +
            "\t\ttext: \"北：钱庄 ↑\"\n" +
            "\t},\n" +
            "\t{\n" +
            "\t\tname: \"苏州市中心\",\n" +
            "\t\ttext: \"西：市中心 ←\"\n" +
            "\t},\n" +
            "\t{\n" +
            "\t\tname: \"苏州东街[2]\",\n" +
            "\t\ttext: \"东：东街 →\"\n" +
            "\t},\n" +
            "\t{\n" +
            "\t\tname: \"苏州当铺\",\n" +
            "\t\ttext: \"南：当铺 ↓\"\n" +
            "\t})\n" +
            "},\n" +
            "{\n" +
            "\tname: \"苏州钱庄\",\n" +
            "\t//地图名称text: Array(\"这是一家老字号的钱庄，已有几百年的历史\",\n" +
            "\t\"南：东街 ↓\"),\n" +
            "\t//描述判定npc: Array(\"史守财\"),\n" +
            "\t//npcdirection: Array(//可去路径{\n" +
            "\t\tname: \"苏州东街[1]\",\n" +
            "\t\ttext: \"南：东街 ↓\"\n" +
            "\t})\n" +
            "},\n" +
            "{\n" +
            "\tname: \"苏州当铺\",\n" +
            "\t//地图名称text: Array(\"这是一家以买卖公平著称的当铺\",\n" +
            "\t\"北：东街 ↑\"),\n" +
            "\t//描述判定npc: Array(\"恶霸\"),\n" +
            "\t//npcdirection: Array(//可去路径{\n" +
            "\t\tname: \"苏州东街[1]\",\n" +
            "\t\ttext: \"北：东街 ↑\"\n" +
            "\t})\n" +
            "},\n" +
            "{\n" +
            "\tname: \"苏州东街[2]\",\n" +
            "\t//地图名称text: Array(\"这是一条宽阔的青石板街道，向东西两头延伸\",\n" +
            "\t\"北：衙门大门 ↑\",\n" +
            "\t\"南：兵营大门 ↓\"),\n" +
            "\t//描述判定npc: Array(),\n" +
            "\t//npcdirection: Array(//可去路径{\n" +
            "\t\tname: \"苏州衙门大门\",\n" +
            "\t\ttext: \"北：衙门大门 ↑\"\n" +
            "\t},\n" +
            "\t{\n" +
            "\t\tname: \"苏州东街[1]\",\n" +
            "\t\ttext: \"西：东街 ←\"\n" +
            "\t},\n" +
            "\t{\n" +
            "\t\tname: \"苏州小亭\",\n" +
            "\t\ttext: \"东：小亭 →\"\n" +
            "\t},\n" +
            "\t{\n" +
            "\t\tname: \"苏州兵营大门\",\n" +
            "\t\ttext: \"南：兵营大门 ↓\"\n" +
            "\t})\n" +
            "},\n" +
            "{\n" +
            "\tname: \"苏州衙门大门\",\n" +
            "\t//地图名称text: Array(\"这里是衙门大门，两扇朱木大门紧紧关闭着\",\n" +
            "\t\"北：正厅 ↑\",\n" +
            "\t\"南：东街 ↓\"),\n" +
            "\t//描述判定npc: Array(\"衙役\"),\n" +
            "\t//npcdirection: Array(//可去路径{\n" +
            "\t\tname: \"苏州衙门正厅\",\n" +
            "\t\ttext: \"北：正厅 ↑\"\n" +
            "\t},\n" +
            "\t{\n" +
            "\t\tname: \"苏州东街[2]\",\n" +
            "\t\ttext: \"南：东街 ↓\"\n" +
            "\t})\n" +
            "},\n" +
            "{\n" +
            "\tname: \"苏州衙门正厅\",\n" +
            "\t//地图名称text: Array(\"这里是衙门正厅\",\n" +
            "\t\"北：后厅 ↑\",\n" +
            "\t\"南：衙门大门 ↓\"),\n" +
            "\t//描述判定npc: Array(\"杨康\",\n" +
            "\t\"完颜亮\"),\n" +
            "\t//npcdirection: Array(//可去路径{\n" +
            "\t\tname: \"苏州衙门后厅\",\n" +
            "\t\ttext: \"北：后厅 ↑\"\n" +
            "\t},\n" +
            "\t{\n" +
            "\t\tname: \"苏州衙门书房[1]\",\n" +
            "\t\ttext: \"东：书房 →\"\n" +
            "\t},\n" +
            "\t{\n" +
            "\t\tname: \"苏州衙门大门\",\n" +
            "\t\ttext: \"南：衙门大门 ↓\"\n" +
            "\t})\n" +
            "},\n" +
            "{\n" +
            "\tname: \"苏州衙门书房[1]\",\n" +
            "\t//地图名称text: Array(\"这是一个宽敞的房间\",\n" +
            "\t\"右边有个窗户\",\n" +
            "\t\"西：正厅 ←\"),\n" +
            "\t//描述判定npc: Array(),\n" +
            "\t//npcdirection: Array(//可去路径{\n" +
            "\t\tname: \"苏州衙门正厅\",\n" +
            "\t\ttext: \"西：正厅 ←\"\n" +
            "\t})\n" +
            "},\n" +
            "{\n" +
            "\tname: \"苏州衙门后厅\",\n" +
            "\t//地图名称text: Array(\"这里是衙门后厅\",\n" +
            "\t\"东：书房 →\",\n" +
            "\t\"南：正厅 ↓\"),\n" +
            "\t//描述判定npc: Array(\"甜儿\",\n" +
            "\t\"李师师\",\n" +
            "\t\"穆念慈\"),\n" +
            "\t//npcdirection: Array(//可去路径{\n" +
            "\t\tname: \"苏州衙门书房[2]\",\n" +
            "\t\ttext: \"东：书房 →\"\n" +
            "\t},\n" +
            "\t{\n" +
            "\t\tname: \"苏州衙门正厅\",\n" +
            "\t\ttext: \"南：正厅 ↓\"\n" +
            "\t})\n" +
            "},\n" +
            "{\n" +
            "\tname: \"苏州衙门书房[2]\",\n" +
            "\t//地图名称text: Array(\"这是一个宽敞的房间\",\n" +
            "\t\"右边有个窗户\",\n" +
            "\t\"西：后厅 ←\"),\n" +
            "\t//描述判定npc: Array(),\n" +
            "\t//npcdirection: Array(//可去路径{\n" +
            "\t\tname: \"苏州衙门后厅\",\n" +
            "\t\ttext: \"西：后厅 ←\"\n" +
            "\t})\n" +
            "},\n" +
            "{\n" +
            "\tname: \"苏州小亭\",\n" +
            "\t//地图名称text: Array(\"这是一个供行人休息的亭子\",\n" +
            "\t\"西：东街 ←\"),\n" +
            "\t//描述判定npc: Array(),\n" +
            "\t//npcdirection: Array(//可去路径{\n" +
            "\t\tname: \"苏州东街[2]\",\n" +
            "\t\ttext: \"西：东街 ←\"\n" +
            "\t})\n" +
            "},\n" +
            "{\n" +
            "\tname: \"苏州兵营大门\",\n" +
            "\t//地图名称text: Array(\"你正站在兵营的门口，面对着一排简陋的营房\",\n" +
            "\t\"北：东街 ↑\",\n" +
            "\t\"南：营帐 ↓\"),\n" +
            "\t//描述判定npc: Array(),\n" +
            "\t//npcdirection: Array(//可去路径{\n" +
            "\t\tname: \"苏州东街[2]\",\n" +
            "\t\ttext: \"北：东街 ↑\"\n" +
            "\t},\n" +
            "\t{\n" +
            "\t\tname: \"苏州兵营营帐\",\n" +
            "\t\ttext: \"南：营帐 ↓\"\n" +
            "\t})\n" +
            "},\n" +
            "{\n" +
            "\tname: \"苏州兵营营帐\",\n" +
            "\t//地图名称text: Array(\"这里是兵营，密密麻麻到处都是官兵\",\n" +
            "\t\"北：兵营大门 ↑\",\n" +
            "\t\"南：主营 ↓\"),\n" +
            "\t//描述判定npc: Array(\"杨排风\"),\n" +
            "\t//npcdirection: Array(//可去路径{\n" +
            "\t\tname: \"苏州兵营大门\",\n" +
            "\t\ttext: \"北：兵营大门 ↑\"\n" +
            "\t},\n" +
            "\t{\n" +
            "\t\tname: \"苏州兵营主营\",\n" +
            "\t\ttext: \"南：主营 ↓\"\n" +
            "\t})\n" +
            "},\n" +
            "{\n" +
            "\tname: \"苏州兵营主营\",\n" +
            "\t//地图名称text: Array(\"这里是主将大营，两边是武将\",\n" +
            "\t\"北：营帐 ↑\"),\n" +
            "\t//描述判定npc: Array(\"穆桂英\"),\n" +
            "\t//npcdirection: Array(//可去路径{\n" +
            "\t\tname: \"苏州兵营营帐\",\n" +
            "\t\ttext: \"北：营帐 ↑\"\n" +
            "\t})\n" +
            "},\n" +
            "//---------------------------下流的分割线-----------------------------{\n" +
            "\tname: \"上海东街[1]\",\n" +
            "\t//地图名称text: Array(\"这是一条宽阔的青石板街道，向东西两头延伸\",\n" +
            "\t\"西：市中心\",\n" +
            "\t\"北：钱庄 ↑\"),\n" +
            "\t//描述判定npc: Array(\"游人\"),\n" +
            "\t//npcdirection: Array(//可去路径{\n" +
            "\t\tname: \"上海钱庄\",\n" +
            "\t\ttext: \"北：钱庄 ↑\"\n" +
            "\t},\n" +
            "\t{\n" +
            "\t\tname: \"上海市中心\",\n" +
            "\t\ttext: \"西：市中心 ←\"\n" +
            "\t},\n" +
            "\t{\n" +
            "\t\tname: \"上海东街[2]\",\n" +
            "\t\ttext: \"东：东街 →\"\n" +
            "\t},\n" +
            "\t{\n" +
            "\t\tname: \"上海当铺\",\n" +
            "\t\ttext: \"南：当铺 ↓\"\n" +
            "\t})\n" +
            "},\n" +
            "{\n" +
            "\tname: \"上海钱庄\",\n" +
            "\t//地图名称text: Array(\"这是一家老字号的钱庄\",\n" +
            "\t\"南：东街 ↓\"),\n" +
            "\t//描述判定npc: Array(\"铁公鸡史守财\"),\n" +
            "\t//npcdirection: Array(//可去路径{\n" +
            "\t\tname: \"上海东街[1]\",\n" +
            "\t\ttext: \"南：东街 ↓\"\n" +
            "\t})\n" +
            "},\n" +
            "{\n" +
            "\tname: \"上海当铺\",\n" +
            "\t//地图名称text: Array(\"一个五尺高的柜台挡在你的面前\",\n" +
            "\t\"柜台上摆着一个牌子\",\n" +
            "\t\"北：东街 ↑\"),\n" +
            "\t//描述判定npc: Array(\"段玉\"),\n" +
            "\t//npcdirection: Array(//可去路径{\n" +
            "\t\tname: \"上海东街[1]\",\n" +
            "\t\ttext: \"北：东街 ↑\"\n" +
            "\t})\n" +
            "},\n" +
            "{\n" +
            "\tname: \"上海东街[2]\",\n" +
            "\t//地图名称text: Array(\"这是一条宽阔的青石板街道，向东西两头延伸\"),\n" +
            "\t//描述判定npc: Array(\"柳永\"),\n" +
            "\t//npcdirection: Array(//可去路径{\n" +
            "\t\tname: \"上海衙门大门\",\n" +
            "\t\ttext: \"北：衙门大门 ↑\"\n" +
            "\t},\n" +
            "\t{\n" +
            "\t\tname: \"上海东街[1]\",\n" +
            "\t\ttext: \"西：东街 ←\"\n" +
            "\t},\n" +
            "\t{\n" +
            "\t\tname: \"上海小亭\",\n" +
            "\t\ttext: \"东：小亭 →\"\n" +
            "\t},\n" +
            "\t{\n" +
            "\t\tname: \"上海兵营大门\",\n" +
            "\t\ttext: \"南：兵营大门 ↓\"\n" +
            "\t})\n" +
            "},\n" +
            "{\n" +
            "\tname: \"上海衙门大门\",\n" +
            "\t//地图名称text: Array(\"这里是衙门大门，两扇朱木大门紧紧关闭着\",\n" +
            "\t\"南：东街 ↓\",\n" +
            "\t\"北：正厅 ↑\"),\n" +
            "\t//描述判定npc: Array(\"衙役\"),\n" +
            "\t//npcdirection: Array(//可去路径{\n" +
            "\t\tname: \"上海衙门正厅\",\n" +
            "\t\ttext: \"北：正厅 ↑\"\n" +
            "\t},\n" +
            "\t{\n" +
            "\t\tname: \"上海东街[2]\",\n" +
            "\t\ttext: \"南：东街 ↓\"\n" +
            "\t})\n" +
            "},\n" +
            "{\n" +
            "\tname: \"上海衙门正厅\",\n" +
            "\t//地图名称text: Array(\"这里是衙门正厅，知府杨康正在和朋友喝酒\",\n" +
            "\t\"南：衙门大门\",\n" +
            "\t\"北：后厅 ↑\"),\n" +
            "\t//描述判定npc: Array(\"杨康\"),\n" +
            "\t//npcdirection: Array(//可去路径{\n" +
            "\t\tname: \"上海衙门后厅\",\n" +
            "\t\ttext: \"北：后厅 ↑\"\n" +
            "\t},\n" +
            "\t{\n" +
            "\t\tname: \"上海衙门大门\",\n" +
            "\t\ttext: \"南：衙门大门 ↓\"\n" +
            "\t})\n" +
            "},\n" +
            "{\n" +
            "\tname: \"上海衙门后厅\",\n" +
            "\t//地图名称text: Array(\"这里是衙门后厅，厅内有几张椅子\",\n" +
            "\t\"知府夫人穆念慈正和几位姑娘聊天\",\n" +
            "\t\"南：正厅\"),\n" +
            "\t//描述判定npc: Array(\"穆念慈\",\n" +
            "\t\"甜儿\"),\n" +
            "\t//npcdirection: Array(//可去路径{\n" +
            "\t\tname: \"上海衙门正厅\",\n" +
            "\t\ttext: \"南：正厅 ↓\"\n" +
            "\t})\n" +
            "},\n" +
            "{\n" +
            "\tname: \"上海兵营大门\",\n" +
            "\t//地图名称text: Array(\"你正站在兵营的门口，面对着一排简陋的营房，可以看到穿着制服的官兵正在操练，不时地传来呐喊声\",\n" +
            "\t\"北：东街 ↑\",\n" +
            "\t\"南：营帐 ↓\"),\n" +
            "\t//描述判定npc: Array(\"官兵\"),\n" +
            "\t//npcdirection: Array(//可去路径{\n" +
            "\t\tname: \"上海东街[2]\",\n" +
            "\t\ttext: \"北：东街 ↑\"\n" +
            "\t},\n" +
            "\t{\n" +
            "\t\tname: \"上海营帐\",\n" +
            "\t\ttext: \"南：营帐 ↓\"\n" +
            "\t})\n" +
            "},\n" +
            "{\n" +
            "\tname: \"上海营帐\",\n" +
            "\t//地图名称text: Array(\"这里是兵营，密密麻麻到处都是官兵\",\n" +
            "\t\"北：兵营大门 ↑\"),\n" +
            "\t//描述判定npc: Array(\"官兵\"),\n" +
            "\t//npcdirection: Array(//可去路径{\n" +
            "\t\tname: \"上海兵营大门\",\n" +
            "\t\ttext: \"北：兵营大门 ↑\"\n" +
            "\t})\n" +
            "},\n" +
            "{\n" +
            "\tname: \"上海小亭\",\n" +
            "\t//地图名称text: Array(\"这是一个供行人休息的亭子\",\n" +
            "\t\"西：东街\",\n" +
            "\t\"东：东海渡口 →\"),\n" +
            "\t//描述判定npc: Array(),\n" +
            "\t//npcdirection: Array(//可去路径{\n" +
            "\t\tname: \"上海东街[2]\",\n" +
            "\t\ttext: \"西：东街 ←\"\n" +
            "\t},\n" +
            "\t{\n" +
            "\t\tname: \"东海渡口\",\n" +
            "\t\ttext: \"东：东海渡口 →\"\n" +
            "\t})\n" +
            "},\n" +
            "{\n" +
            "\tname: \"东海渡口\",\n" +
            "\t//地图名称text: Array(\"深秋，东海之滨，寒风卷起的狂潮叫嚣着似乎要吞没整个天地\",\n" +
            "\t\"西：小亭 ←\"),\n" +
            "\t//描述判定npc: Array(),\n" +
            "\t//npcdirection: Array(//可去路径{\n" +
            "\t\tname: \"上海小亭\",\n" +
            "\t\ttext: \"西：小亭 ←\"\n" +
            "\t},\n" +
            "\t{\n" +
            "\t\tname: \"东海渡口大船\",\n" +
            "\t\ttext: \"大船\"\n" +
            "\t})\n" +
            "},\n" +
            "{\n" +
            "\tname: \"东海渡口大船\",\n" +
            "\t//地图名称text: Array(\"这是开往桃花岛的大船，想去的请\"),\n" +
            "\t//描述判定npc: Array(),\n" +
            "\t//npcdirection: Array(//可去路径{\n" +
            "\t\tname: \"桃花渡口\",\n" +
            "\t\ttext: \"上船\"\n" +
            "\t},\n" +
            "\t{\n" +
            "\t\tname: \"东海渡口\",\n" +
            "\t\ttext: \"返回\"\n" +
            "\t})\n" +
            "},\n" +
            "{\n" +
            "\tname: \"桃花渡口大船\",\n" +
            "\t//地图名称text: Array(\"这是开往中原的大船，想去的请\",\n" +
            "\t\"上船\"),\n" +
            "\t//描述判定npc: Array(),\n" +
            "\t//npcdirection: Array(//可去路径{\n" +
            "\t\tname: \"东海渡口\",\n" +
            "\t\ttext: \"上船\"\n" +
            "\t},\n" +
            "\t{\n" +
            "\t\tname: \"桃花渡口\",\n" +
            "\t\ttext: \"返回\"\n" +
            "\t})\n" +
            "},\n" +
            "{\n" +
            "\tname: \"桃花渡口\",\n" +
            "\t//地图名称text: Array(\"这是桃花岛前的海滩，海蓝蓝的天\",\n" +
            "\t\"东：桃花阵入口\"),\n" +
            "\t//描述判定npc: Array(),\n" +
            "\t//npcdirection: Array(//可去路径{\n" +
            "\t\tname: \"桃花阵入口\",\n" +
            "\t\ttext: \"东：桃花阵入口 →\"\n" +
            "\t},\n" +
            "\t{\n" +
            "\t\tname: \"桃花渡口大船\",\n" +
            "\t\ttext: \"大船\"\n" +
            "\t})\n" +
            "},\n" +
            "{\n" +
            "\tname: \"桃花阵入口\",\n" +
            "\t//地图名称text: Array(\"这里是桃花阵的入口处\",\n" +
            "\t\"西：桃花渡口\",\n" +
            "\t\"东：桃花阵\"),\n" +
            "\t//描述判定npc: Array(\"守岛弟子\"),\n" +
            "\t//npcdirection: Array(//可去路径{\n" +
            "\t\tname: \"桃花渡口\",\n" +
            "\t\ttext: \"西：桃花渡口 ←\"\n" +
            "\t},\n" +
            "\t{\n" +
            "\t\tname: \"桃花阵\",\n" +
            "\t\ttext: \"东：桃花阵 →\"\n" +
            "\t})\n" +
            "},\n" +
            "{\n" +
            "\tname: \"桃花阵\",\n" +
            "\t//地图名称text: Array(\"这是一片桃花的海洋，四周一望无际\",\n" +
            "\t\"西：桃花阵入口\",\n" +
            "\t\"东：绿竹林\"),\n" +
            "\t//描述判定npc: Array(),\n" +
            "\t//npcdirection: Array(//可去路径{\n" +
            "\t\tname: \"桃花岛墓地\",\n" +
            "\t\ttext: \"北：墓地 ↑\"\n" +
            "\t},\n" +
            "\t{\n" +
            "\t\tname: \"桃花阵入口\",\n" +
            "\t\ttext: \"西：桃花阵入口 ←\"\n" +
            "\t},\n" +
            "\t{\n" +
            "\t\tname: \"绿竹林\",\n" +
            "\t\ttext: \"东：绿竹林 →\"\n" +
            "\t},\n" +
            "\t{\n" +
            "\t\tname: \"桃花岛山洞\",\n" +
            "\t\ttext: \"南：山洞 ↓\"\n" +
            "\t})\n" +
            "},\n" +
            "{\n" +
            "\tname: \"桃花岛墓地\",\n" +
            "\t//地图名称text: Array(\"这里是桃花岛岛主夫人的墓地\",\n" +
            "\t\"南：桃花阵\"),\n" +
            "\t//描述判定npc: Array(),\n" +
            "\t//npcdirection: Array(//可去路径{\n" +
            "\t\tname: \"桃花阵\",\n" +
            "\t\ttext: \"南：桃花阵 ↓\"\n" +
            "\t})\n" +
            "},\n" +
            "{\n" +
            "\tname: \"桃花岛山洞\",\n" +
            "\t//地图名称text: Array(\"你正处在一个小山洞中。这里光线很暗\",\n" +
            "\t\"北：桃花阵\"),\n" +
            "\t//描述判定npc: Array(\"陈玄风\",\n" +
            "\t\"梅超风\"),\n" +
            "\t//npcdirection: Array(//可去路径{\n" +
            "\t\tname: \"桃花阵\",\n" +
            "\t\ttext: \"北：桃花阵 ↑\"\n" +
            "\t})\n" +
            "},\n" +
            "{\n" +
            "\tname: \"绿竹林\",\n" +
            "\t//地图名称text: Array(\"这里是一片郁郁葱葱的绿竹林\",\n" +
            "\t\"北：积翠亭\",\n" +
            "\t\"西：桃花阵\"),\n" +
            "\t//描述判定npc: Array(\"柯镇恶\",\n" +
            "\t\"曲灵风\",\n" +
            "\t\"曲傻姑\"),\n" +
            "\t//npcdirection: Array(//可去路径{\n" +
            "\t\tname: \"积翠亭\",\n" +
            "\t\ttext: \"北：积翠亭 ↑\"\n" +
            "\t},\n" +
            "\t{\n" +
            "\t\tname: \"桃花阵\",\n" +
            "\t\ttext: \"西：桃花阵 ←\"\n" +
            "\t},\n" +
            "\t{\n" +
            "\t\tname: \"莲花池\",\n" +
            "\t\ttext: \"东：莲花池 →\"\n" +
            "\t},\n" +
            "\t{\n" +
            "\t\tname: \"去非阁\",\n" +
            "\t\ttext: \"南：去非阁 ↓\"\n" +
            "\t})\n" +
            "},\n" +
            "{\n" +
            "\tname: \"积翠亭\",\n" +
            "\t//地图名称text: Array(\"这是座竹枝搭成的凉亭，亭中放着竹台竹椅\",\n" +
            "\t\"南：绿竹林\"),\n" +
            "\t//描述判定npc: Array(\"朱聪\",\n" +
            "\t\"韩宝驹\",\n" +
            "\t\"韩小莹\"),\n" +
            "\t//npcdirection: Array(//可去路径{\n" +
            "\t\tname: \"绿竹林\",\n" +
            "\t\ttext: \"南：绿竹林 ↓\"\n" +
            "\t})\n" +
            "},\n" +
            "{\n" +
            "\tname: \"去非阁\",\n" +
            "\t//地图名称text: Array(\"入门正对一排书架，上列几百部武学典籍\",\n" +
            "\t\"北：绿竹林\"),\n" +
            "\t//描述判定npc: Array(\"曲灵风\"),\n" +
            "\t//npcdirection: Array(//可去路径{\n" +
            "\t\tname: \"绿竹林\",\n" +
            "\t\ttext: \"北：绿竹林 ↑\"\n" +
            "\t})\n" +
            "},\n" +
            "{\n" +
            "\tname: \"莲花池\",\n" +
            "\t//地图名称text: Array(\"行走几步，可见一横列假山\",\n" +
            "\t\"西：绿竹林\",\n" +
            "\t\"东：塘中精舍\"),\n" +
            "\t//描述判定npc: Array(\"哑仆\"),\n" +
            "\t//npcdirection: Array(//可去路径{\n" +
            "\t\tname: \"试剑亭\",\n" +
            "\t\ttext: \"北：试剑亭 ↑\"\n" +
            "\t},\n" +
            "\t{\n" +
            "\t\tname: \"绿竹林\",\n" +
            "\t\ttext: \"西：绿竹林 ←\"\n" +
            "\t},\n" +
            "\t{\n" +
            "\t\tname: \"塘中精舍\",\n" +
            "\t\ttext: \"东：塘中精舍 →\"\n" +
            "\t},\n" +
            "\t{\n" +
            "\t\tname: \"桃花岛后院\",\n" +
            "\t\ttext: \"南：后院 ↓\"\n" +
            "\t})\n" +
            "},\n" +
            "{\n" +
            "\tname: \"试剑亭\",\n" +
            "\t//地图名称text: Array(\"这里是一个用白玉石砌成的亭子\",\n" +
            "\t\"南：莲花池\"),\n" +
            "\t//描述判定npc: Array(\"耶律齐\"),\n" +
            "\t//npcdirection: Array(//可去路径{\n" +
            "\t\tname: \"莲花池\",\n" +
            "\t\ttext: \"南：莲花池 ↓\"\n" +
            "\t})\n" +
            "},\n" +
            "{\n" +
            "\tname: \"桃花岛后院\",\n" +
            "\t//地图名称text: Array(\"这是山庄的后院\",\n" +
            "\t\"北：莲花池\"),\n" +
            "\t//描述判定npc: Array(\"郭靖\",\n" +
            "\t\"黄蓉\"),\n" +
            "\t//npcdirection: Array(//可去路径{\n" +
            "\t\tname: \"莲花池\",\n" +
            "\t\ttext: \"北：莲花池 ↑\"\n" +
            "\t})\n" +
            "},\n" +
            "{\n" +
            "\tname: \"塘中精舍\",\n" +
            "\t//地图名称text: Array(\"这是桃花岛主黄药师的书房\",\n" +
            "\t\"西：莲花池 ←\"),\n" +
            "\t//描述判定npc: Array(\"黄蓉\"),\n" +
            "\t//npcdirection: Array(//可去路径{\n" +
            "\t\tname: \"诗织花汀\",\n" +
            "\t\ttext: \"北：诗织花汀 ↑\"\n" +
            "\t},\n" +
            "\t{\n" +
            "\t\tname: \"莲花池\",\n" +
            "\t\ttext: \"西：莲花池 ←\"\n" +
            "\t},\n" +
            "\t{\n" +
            "\t\tname: \"融思楼\",\n" +
            "\t\ttext: \"南：融思楼 ↓\"\n" +
            "\t})\n" +
            "},\n" +
            "{\n" +
            "\tname: \"诗织花汀\",\n" +
            "\t//地图名称text: Array(\"流水潺潺，烟桥卧波，忽见翠湖画舫\",\n" +
            "\t\"南：塘中精舍\"),\n" +
            "\t//描述判定npc: Array(\"南希仁\",\n" +
            "\t\"张阿生\",\n" +
            "\t\"全金发\"),\n" +
            "\t//npcdirection: Array(//可去路径{\n" +
            "\t\tname: \"塘中精舍\",\n" +
            "\t\ttext: \"南：塘中精舍 ↓\"\n" +
            "\t})\n" +
            "},\n" +
            "{\n" +
            "\tname: \"融思楼\",\n" +
            "\t//地图名称text: Array(\"一股若有若无的甜香扑鼻而来\",\n" +
            "\t\"北：塘中精舍\"),\n" +
            "\t//描述判定npc: Array(\"程瑛\",\n" +
            "\t\"郭芙\"),\n" +
            "\t//npcdirection: Array(//可去路径{\n" +
            "\t\tname: \"塘中精舍\",\n" +
            "\t\ttext: \"北：塘中精舍 ↑\"\n" +
            "\t})\n" +
            "},\n" +
            "//--------------------------善良的分割线--------------------------{\n" +
            "\tname: \"上海南街[1]\",\n" +
            "\t//地图名称text: Array(\"你走在一条繁忙的街道上，看着操着南腔北调的人们行色匆匆\",\n" +
            "\t\"北：市中心\",\n" +
            "\t\"西：红娘庄 ←\"),\n" +
            "\t//描述判定npc: Array(),\n" +
            "\t//npcdirection: Array(//可去路径{\n" +
            "\t\tname: \"上海市中心\",\n" +
            "\t\ttext: \"北：市中心 ↑\"\n" +
            "\t},\n" +
            "\t{\n" +
            "\t\tname: \"上海红娘庄\",\n" +
            "\t\ttext: \"西：红娘庄 ←\"\n" +
            "\t},\n" +
            "\t{\n" +
            "\t\tname: \"上海南街[2]\",\n" +
            "\t\ttext: \"南：南街 ↓\"\n" +
            "\t})\n" +
            "},\n" +
            "{\n" +
            "\tname: \"上海红娘庄\",\n" +
            "\t//地图名称text: Array(\"你现在正站在红娘庄里\",\n" +
            "\t\"这里是专门替人缔结婚约和解除婚约的地方\",\n" +
            "\t\"东：南街\"),\n" +
            "\t//描述判定npc: Array(\"媒婆\"),\n" +
            "\t//npcdirection: Array(//可去路径{\n" +
            "\t\tname: \"上海南街[1]\",\n" +
            "\t\ttext: \"东：南街 →\"\n" +
            "\t})\n" +
            "},\n" +
            "{\n" +
            "\tname: \"上海南街[2]\",\n" +
            "\t//地图名称text: Array(\"南大街乃是城里的繁华地段\",\n" +
            "\t\"西：园林\",\n" +
            "\t\"南：上海南城门\"),\n" +
            "\t//描述判定npc: Array(\"卖艺人\"),\n" +
            "\t//npcdirection: Array(//可去路径{\n" +
            "\t\tname: \"上海南街[1]\",\n" +
            "\t\ttext: \"北：南街 ↑\"\n" +
            "\t},\n" +
            "\t{\n" +
            "\t\tname: \"上海园林\",\n" +
            "\t\ttext: \"西：园林 ←\"\n" +
            "\t},\n" +
            "\t{\n" +
            "\t\tname: \"上海南城门\",\n" +
            "\t\ttext: \"南：上海南城门 ↓\"\n" +
            "\t})\n" +
            "},\n" +
            "{\n" +
            "\tname: \"上海园林\",\n" +
            "\t//地图名称text: Array(\"一走入这个庭园，扑鼻而来的便是一股若有似无\",\n" +
            "\t\"东：南街\",\n" +
            "\t\"庭园甚是宽敞\"),\n" +
            "\t//描述判定npc: Array(\"公主\",\n" +
            "\t\"方怡\"),\n" +
            "\t//npcdirection: Array(//可去路径{\n" +
            "\t\tname: \"上海南街[2]\",\n" +
            "\t\ttext: \"东：南街 →\"\n" +
            "\t})\n" +
            "},\n" +
            "{\n" +
            "\tname: \"上海南城门\",\n" +
            "\t//地图名称text: Array(\"这是上海的南城门\",\n" +
            "\t\"北：南街\",\n" +
            "\t\"南：驿道\"),\n" +
            "\t//描述判定npc: Array(\"官兵\"),\n" +
            "\t//npcdirection: Array(//可去路径{\n" +
            "\t\tname: \"上海南街[2]\",\n" +
            "\t\ttext: \"北：南街 ↑\"\n" +
            "\t},\n" +
            "\t{\n" +
            "\t\tname: \"上海南驿道[1]\",\n" +
            "\t\ttext: \"南：驿道 ↓\"\n" +
            "\t})\n" +
            "},\n" +
            "{\n" +
            "\tname: \"上海南驿道[1]\",\n" +
            "\t//地图名称text: Array(\"一条驿道静静的向远方延伸\",\n" +
            "\t\"北：上海南城门\",\n" +
            "\t\"南：杭州北门\"),\n" +
            "\t//描述判定npc: Array(),\n" +
            "\t//npcdirection: Array(//可去路径{\n" +
            "\t\tname: \"上海南城门\",\n" +
            "\t\ttext: \"北：上海南城门 ↑\"\n" +
            "\t},\n" +
            "\t{\n" +
            "\t\tname: \"杭州城外\",\n" +
            "\t\ttext: \"东：杭州城外 →\"\n" +
            "\t},\n" +
            "\t{\n" +
            "\t\tname: \"杭州北门\",\n" +
            "\t\ttext: \"南：杭州北门 ↓\"\n" +
            "\t})\n" +
            "},\n" +
            "{\n" +
            "\tname: \"杭州城外\",\n" +
            "\t//地图名称text: Array(\"江湖中人都说，上有天堂，下有苏杭\",\n" +
            "\t\"西：驿道 ←\",\n" +
            "\t\"南：大马路 ↓\"),\n" +
            "\t//描述判定npc: Array(\"守城小兵\",\n" +
            "\t\"守城武将\"),\n" +
            "\t//npcdirection: Array(//可去路径{\n" +
            "\t\tname: \"上海南驿道[1]\",\n" +
            "\t\ttext: \"西：驿道 ←\"\n" +
            "\t},\n" +
            "\t{\n" +
            "\t\tname: \"杭州城外大马路\",\n" +
            "\t\ttext: \"南：大马路 ↓\"\n" +
            "\t})\n" +
            "},\n" +
            "{\n" +
            "\tname: \"杭州城外大马路\",\n" +
            "\t//地图名称text: Array(\"杭州城外的一条大马路，熙熙攘攘的行人，十分热闹\",\n" +
            "\t\"北：杭州城外 ↑\",\n" +
            "\t\"东：大堤 →\"),\n" +
            "\t//描述判定npc: Array(),\n" +
            "\t//npcdirection: Array(//可去路径{\n" +
            "\t\tname: \"杭州城外\",\n" +
            "\t\ttext: \"北：杭州城外 ↑\"\n" +
            "\t},\n" +
            "\t{\n" +
            "\t\tname: \"杭州城外大堤\",\n" +
            "\t\ttext: \"东：大堤 →\"\n" +
            "\t})\n" +
            "},\n" +
            "{\n" +
            "\tname: \"杭州城外大堤\",\n" +
            "\t//地图名称text: Array(\"一条青翠的堤防\",\n" +
            "\t\"西：大马路 ←\",\n" +
            "\t\"东：梅庄正门 →\"),\n" +
            "\t//描述判定npc: Array(\"游人\"),\n" +
            "\t//npcdirection: Array(//可去路径{\n" +
            "\t\tname: \"杭州城外大马路\",\n" +
            "\t\ttext: \"西：大马路 ←\"\n" +
            "\t},\n" +
            "\t{\n" +
            "\t\tname: \"梅庄正门\",\n" +
            "\t\ttext: \"东：梅庄正门 →\"\n" +
            "\t})\n" +
            "},\n" +
            "{\n" +
            "\tname: \"梅庄正门\",\n" +
            "\t//地图名称text: Array(\"西湖之畔，但见碧波如镜，垂柳拂水，景物之美，直如神仙境地\",\n" +
            "\t\"西：大堤 ←\",\n" +
            "\t\"东：天井 →\"),\n" +
            "\t//描述判定npc: Array(\"丁坚\"),\n" +
            "\t//npcdirection: Array(//可去路径{\n" +
            "\t\tname: \"大堤\",\n" +
            "\t\ttext: \"西：大堤 ←\"\n" +
            "\t},\n" +
            "\t{\n" +
            "\t\tname: \"天井\",\n" +
            "\t\ttext: \"东：天井 →\"\n" +
            "\t})\n" +
            "},\n" +
            "{\n" +
            "\tname: \"天井\",\n" +
            "\t//地图名称text: Array(\"天井左右各植一棵老梅，枝干如铁，极是苍劲\",\n" +
            "\t\"北：酒窖 ↑\",\n" +
            "\t\"西：梅庄正门 ←\"),\n" +
            "\t//描述判定npc: Array(\"施令威\"),\n" +
            "\t//npcdirection: Array(//可去路径{\n" +
            "\t\tname: \"酒窖\",\n" +
            "\t\ttext: \"北：酒窖 ↑\"\n" +
            "\t},\n" +
            "\t{\n" +
            "\t\tname: \"梅庄正门\",\n" +
            "\t\ttext: \"西：梅庄正门 ←\"\n" +
            "\t},\n" +
            "\t{\n" +
            "\t\tname: \"画室\",\n" +
            "\t\ttext: \"东：画室 →\"\n" +
            "\t})\n" +
            "},\n" +
            "{\n" +
            "\tname: \"酒窖\",\n" +
            "\t//地图名称text: Array(\"这里酒香四益\",\n" +
            "\t\"珍藏的美酒佳酿不计其数\",\n" +
            "\t\"南：天井 ↓\"),\n" +
            "\t//描述判定npc: Array(),\n" +
            "\t//npcdirection: Array(//可去路径{\n" +
            "\t\tname: \"天井\",\n" +
            "\t\ttext: \"南：天井 ↓\"\n" +
            "\t})\n" +
            "},\n" +
            "{\n" +
            "\tname: \"画室\",\n" +
            "\t//地图名称text: Array(\"室中悬挂着一幅画。画中墨意淋漓\",\n" +
            "\t\"北：书房 ↑\",\n" +
            "\t\"西：天井 ←\"),\n" +
            "\t//描述判定npc: Array(\"丹青生\"),\n" +
            "\t//npcdirection: Array(//可去路径{\n" +
            "\t\tname: \"杭州城外书房\",\n" +
            "\t\ttext: \"北：书房 ↑\"\n" +
            "\t},\n" +
            "\t{\n" +
            "\t\tname: \"天井\",\n" +
            "\t\ttext: \"西：天井 ←\"\n" +
            "\t},\n" +
            "\t{\n" +
            "\t\tname: \"抚琴阁\",\n" +
            "\t\ttext: \"东：抚琴阁 →\"\n" +
            "\t},\n" +
            "\t{\n" +
            "\t\tname: \"棋室\",\n" +
            "\t\ttext: \"南：棋室 ↓\"\n" +
            "\t})\n" +
            "},\n" +
            "{\n" +
            "\tname: \"杭州城外书房\",\n" +
            "\t//地图名称text: Array(\"房中墨渍点点\",\n" +
            "\t\"一副副大字挂在墙上，显得黑白分明\",\n" +
            "\t\"南：画室 ↓\"),\n" +
            "\t//描述判定npc: Array(\"秃笔翁\"),\n" +
            "\t//npcdirection: Array(//可去路径{\n" +
            "\t\tname: \"画室\",\n" +
            "\t\ttext: \"南：画室 ↓\"\n" +
            "\t})\n" +
            "},\n" +
            "{\n" +
            "\tname: \"棋室\",\n" +
            "\t//地图名称text: Array(\"室中空空荡荡\",\n" +
            "\t\"只有一张石几，石几上刻着纵横十九道棋路\",\n" +
            "\t\"北：画室 ↑\"),\n" +
            "\t//描述判定npc: Array(\"黑白子\"),\n" +
            "\t//npcdirection: Array(//可去路径{\n" +
            "\t\tname: \"画室\",\n" +
            "\t\ttext: \"北：画室 ↑\"\n" +
            "\t})\n" +
            "},\n" +
            "{\n" +
            "\tname: \"抚琴阁\",\n" +
            "\t//地图名称text: Array(\"一条清幽的花径\",\n" +
            "\t\"西：画室 ←\",\n" +
            "\t\"东：湖底密道 →\"),\n" +
            "\t//描述判定npc: Array(\"黄钟公\"),\n" +
            "\t//npcdirection: Array(//可去路径{\n" +
            "\t\tname: \"画室\",\n" +
            "\t\ttext: \"西：画室 ←\"\n" +
            "\t},\n" +
            "\t{\n" +
            "\t\tname: \"湖底密道\",\n" +
            "\t\ttext: \"东：湖底密道 →\"\n" +
            "\t})\n" +
            "},\n" +
            "{\n" +
            "\tname: \"湖底密道\",\n" +
            "\t//地图名称text: Array(\"一条潮湿阴暗的密道\",\n" +
            "\t\"不知通向何处\",\n" +
            "\t\"西：抚琴阁 ←\",\n" +
            "\t\"东：囚牢 →\"),\n" +
            "\t//描述判定npc: Array(),\n" +
            "\t//npcdirection: Array(//可去路径{\n" +
            "\t\tname: \"抚琴阁\",\n" +
            "\t\ttext: \"西：抚琴阁 ←\"\n" +
            "\t},\n" +
            "\t{\n" +
            "\t\tname: \"囚牢\",\n" +
            "\t\ttext: \"东：囚牢 →\"\n" +
            "\t})\n" +
            "},\n" +
            "{\n" +
            "\tname: \"囚牢\",\n" +
            "\t//地图名称text: Array(\"一间十分狭小的囚牢\",\n" +
            "\t\"位于西湖湖底。如若被囚于此\",\n" +
            "\t\"任是通天本领也插翅难飞\",\n" +
            "\t\"西：湖底密道 ←\"),\n" +
            "\t//描述判定npc: Array(\"任我行\"),\n" +
            "\t//npcdirection: Array(//可去路径{\n" +
            "\t\tname: \"湖底密道\",\n" +
            "\t\ttext: \"西：湖底密道 ←\"\n" +
            "\t})\n" +
            "},\n" +
            "{\n" +
            "\tname: \"杭州北门\",\n" +
            "\t//地图名称text: Array(\"你来到素来与苏州以风景秀丽齐名的杭州城，\",\n" +
            "\t\"北：驿道\",\n" +
            "\t\"南：德胜大街\"),\n" +
            "\t//描述判定npc: Array(\"守城小兵\",\n" +
            "\t\"守城武将\"),\n" +
            "\t//npcdirection: Array(//可去路径{\n" +
            "\t\tname: \"上海南驿道[1]\",\n" +
            "\t\ttext: \"北：驿道 ↑\"\n" +
            "\t},\n" +
            "\t{\n" +
            "\t\tname: \"德胜大街\",\n" +
            "\t\ttext: \"南：德胜大街 ↓\"\n" +
            "\t})\n" +
            "},\n" +
            "{\n" +
            "\tname: \"德胜大街\",\n" +
            "\t//地图名称text: Array(\"你走在一条热闹但祥和的街道上，只见两边满是小摊，上面摆满了\",\n" +
            "\t\"北：杭州北门\",\n" +
            "\t\"南：武林广场\"),\n" +
            "\t//描述判定npc: Array(),\n" +
            "\t//npcdirection: Array(//可去路径{\n" +
            "\t\tname: \"杭州北门\",\n" +
            "\t\ttext: \"北：杭州北门 ↑\"\n" +
            "\t},\n" +
            "\t{\n" +
            "\t\tname: \"武林广场\",\n" +
            "\t\ttext: \"南：武林广场 ↓\"\n" +
            "\t})\n" +
            "},\n" +
            "{\n" +
            "\tname: \"武林广场\",\n" +
            "\t//地图名称text: Array(\"这是杭州交通要道武林广场，东边是一家医院\",\n" +
            "\t\"北：德胜大街 ↑\",\n" +
            "\t\"西：望江楼 ←\"),\n" +
            "\t//描述判定npc: Array(\"紫袍老人(任务)\",\n" +
            "\t\"萱萱\",\n" +
            "\t\"春游女子\"),\n" +
            "\t//npcdirection: Array(//可去路径{\n" +
            "\t\tname: \"德胜大街\",\n" +
            "\t\ttext: \"北：德胜大街 ↑\"\n" +
            "\t},\n" +
            "\t{\n" +
            "\t\tname: \"望江楼\",\n" +
            "\t\ttext: \"西：望江楼 ←\"\n" +
            "\t},\n" +
            "\t{\n" +
            "\t\tname: \"庆春大街\",\n" +
            "\t\ttext: \"南：庆春大街 ↓\"\n" +
            "\t})\n" +
            "},\n" +
            "{\n" +
            "\tname: \"望江楼\",\n" +
            "\t//地图名称text: Array(\"楼阁前面的空地上有一些少年在一起互相谈笑\",\n" +
            "\t\"北：宝珠山庄 ↑\",\n" +
            "\t\"西：来凤亭 ←\"),\n" +
            "\t//描述判定npc: Array(\"游人\",\n" +
            "\t\"书生\"),\n" +
            "\t//npcdirection: Array(//可去路径{\n" +
            "\t\tname: \"宝珠山庄\",\n" +
            "\t\ttext: \"北：宝珠山庄 ↑\"\n" +
            "\t},\n" +
            "\t{\n" +
            "\t\tname: \"来凤亭\",\n" +
            "\t\ttext: \"西：来凤亭 ←\"\n" +
            "\t},\n" +
            "\t{\n" +
            "\t\tname: \"武林广场\",\n" +
            "\t\ttext: \"东：武林广场 →\"\n" +
            "\t},\n" +
            "\t{\n" +
            "\t\tname: \"杭州西湖\",\n" +
            "\t\ttext: \"南：西湖 ↓\"\n" +
            "\t})\n" +
            "},\n" +
            "{\n" +
            "\tname: \"宝珠山庄\",\n" +
            "\t//地图名称text: Array(\"这儿繁花似锦，草木茂盛，在绿荫丛中\",\n" +
            "\t\"你忽然发现一道门，门里面有一条小道，直通向深处\",\n" +
            "\t\"南：望江楼 \"),\n" +
            "\t//描述判定npc: Array(\"朱八太爷\",\n" +
            "\t\"段飞熊\"),\n" +
            "\t//npcdirection: Array(//可去路径{\n" +
            "\t\tname: \"望江楼\",\n" +
            "\t\ttext: \"南：望江楼 ↓\"\n" +
            "\t})\n" +
            "},\n" +
            "{\n" +
            "\tname: \"杭州西湖\",\n" +
            "\t//地图名称text: Array(\"这里就是闻名的人间天堂：西湖\",\n" +
            "\t\"北：望江楼 ↑\",\n" +
            "\t\"西：苏堤 ←\"),\n" +
            "\t//描述判定npc: Array(),\n" +
            "\t//npcdirection: Array(//可去路径{\n" +
            "\t\tname: \"望江楼\",\n" +
            "\t\ttext: \"北：望江楼 ↑\"\n" +
            "\t},\n" +
            "\t{\n" +
            "\t\tname: \"杭州苏堤[1]\",\n" +
            "\t\ttext: \"西：苏堤 ←\"\n" +
            "\t},\n" +
            "\t{\n" +
            "\t\tname: \"三雅园\",\n" +
            "\t\ttext: \"东：三雅园 →\"\n" +
            "\t})\n" +
            "},\n" +
            "{\n" +
            "\tname: \"三雅园\",\n" +
            "\t//地图名称text: Array(\"这里是有名的三雅园\",\n" +
            "\t\"西：西湖 ←\"),\n" +
            "\t//描述判定npc: Array(\"花夜来\",\n" +
            "\t\"恶僧\",\n" +
            "\t\"段玉\",\n" +
            "\t\"华华凤\"),\n" +
            "\t//npcdirection: Array(//可去路径{\n" +
            "\t\tname: \"杭州西湖\",\n" +
            "\t\ttext: \"西：西湖 ←\"\n" +
            "\t})\n" +
            "},\n" +
            "{\n" +
            "\tname: \"杭州苏堤[1]\",\n" +
            "\t//地图名称text: Array(\"游西湖，最好是携至亲至爱的人骑马漫步苏堤\",\n" +
            "\t\"北：杭州香格 ↑\",\n" +
            "\t\"东：西湖 →\"),\n" +
            "\t//描述判定npc: Array(),\n" +
            "\t//npcdirection: Array(//可去路径{\n" +
            "\t\tname: \"杭州香格\",\n" +
            "\t\ttext: \"北：杭州香格 ↑\"\n" +
            "\t},\n" +
            "\t{\n" +
            "\t\tname: \"杭州西湖\",\n" +
            "\t\ttext: \"东：西湖 →\"\n" +
            "\t},\n" +
            "\t{\n" +
            "\t\tname: \"杭州苏堤[2]\",\n" +
            "\t\ttext: \"南：苏堤 ↓\"\n" +
            "\t})\n" +
            "},\n" +
            "{\n" +
            "\tname: \"杭州苏堤[2]\",\n" +
            "\t//地图名称text: Array(\"游西湖，最好是携至亲至爱的人骑马漫步苏堤\",\n" +
            "\t\"北：苏堤 ↑\"),\n" +
            "\t//描述判定npc: Array(\"花夜来\",\n" +
            "\t\"恶僧\",\n" +
            "\t\"段玉\",\n" +
            "\t\"华华凤\"),\n" +
            "\t//npcdirection: Array(//可去路径{\n" +
            "\t\tname: \"杭州苏堤[1]\",\n" +
            "\t\ttext: \"北：苏堤 ↑\"\n" +
            "\t})\n" +
            "},\n" +
            "{\n" +
            "\tname: \"来凤亭\",\n" +
            "\t//地图名称text: Array(\"亭子滂水而建，部分甚至已经伸出水面\",\n" +
            "\t\"北：黄龙洞 ↑\",\n" +
            "\t\"西：杭州香格 ←\"),\n" +
            "\t//描述判定npc: Array(\"游人\"),\n" +
            "\t//npcdirection: Array(//可去路径{\n" +
            "\t\tname: \"黄龙洞\",\n" +
            "\t\ttext: \"北：黄龙洞 ↑\"\n" +
            "\t},\n" +
            "\t{\n" +
            "\t\tname: \"杭州香格\",\n" +
            "\t\ttext: \"西：杭州香格 ←\"\n" +
            "\t},\n" +
            "\t{\n" +
            "\t\tname: \"望江楼\",\n" +
            "\t\ttext: \"东：望江楼 →\"\n" +
            "\t})\n" +
            "},\n" +
            "{\n" +
            "\tname: \"黄龙洞\",\n" +
            "\t//地图名称text: Array(\"此处就是著名的黄龙洞了\",\n" +
            "\t\"南：来凤亭 ↓\"),\n" +
            "\t//描述判定npc: Array(),\n" +
            "\t//npcdirection: Array(//可去路径{\n" +
            "\t\tname: \"来凤亭\",\n" +
            "\t\ttext: \"南：来凤亭 ↓\"\n" +
            "\t})\n" +
            "},\n" +
            "{\n" +
            "\tname: \"杭州香格\",\n" +
            "\t//地图名称text: Array(\"这是西湖边供游人租画舫，游艇到湖上游览的地方\",\n" +
            "\t\"西：岳坟 ←\"),\n" +
            "\t//描述判定npc: Array(\"老板\"),\n" +
            "\t//npcdirection: Array(//可去路径{\n" +
            "\t\tname: \"岳坟\",\n" +
            "\t\ttext: \"西：岳坟 ←\"\n" +
            "\t},\n" +
            "\t{\n" +
            "\t\tname: \"来凤亭\",\n" +
            "\t\ttext: \"东：来凤亭 →\"\n" +
            "\t},\n" +
            "\t{\n" +
            "\t\tname: \"杭州苏堤[1]\",\n" +
            "\t\ttext: \"南：苏堤 ↓\"\n" +
            "\t})\n" +
            "},\n" +
            "{\n" +
            "\tname: \"岳坟\",\n" +
            "\t//地图名称text: Array(\"这是南宋民族英雄岳飞的祀庙\",\n" +
            "\t\"西：桃源岭 ←\",\n" +
            "\t\"东：杭州香格 →\"),\n" +
            "\t//描述判定npc: Array(\"铁水\"),\n" +
            "\t//npcdirection: Array(//可去路径{\n" +
            "\t\tname: \"桃源岭\",\n" +
            "\t\ttext: \"西：桃源岭 ←\"\n" +
            "\t},\n" +
            "\t{\n" +
            "\t\tname: \"杭州香格\",\n" +
            "\t\ttext: \"东：杭州香格 →\"\n" +
            "\t},\n" +
            "\t{\n" +
            "\t\tname: \"曲院风荷\",\n" +
            "\t\ttext: \"南：曲院风荷 ↓\"\n" +
            "\t})\n" +
            "},\n" +
            "{\n" +
            "\tname: \"桃源岭\",\n" +
            "\t//地图名称text: Array(\"古人道:人间四月芳菲尽，山寺桃花始盛开\",\n" +
            "\t\"西：一线天\",\n" +
            "\t\"东：岳坟\"),\n" +
            "\t//描述判定npc: Array(\"少年剑客\",\n" +
            "\t\"少年剑客\"),\n" +
            "\t//npcdirection: Array(//可去路径{\n" +
            "\t\tname: \"杭州一线天\",\n" +
            "\t\ttext: \"西：一线天 ←\"\n" +
            "\t},\n" +
            "\t{\n" +
            "\t\tname: \"岳坟\",\n" +
            "\t\ttext: \"东：岳坟 →\"\n" +
            "\t})\n" +
            "},\n" +
            "{\n" +
            "\tname: \"杭州一线天\",\n" +
            "\t//地图名称text: Array(\"只见岩顶裂开一罅，就像是利斧劈开一样\",\n" +
            "\t\"西：灵隐寺\",\n" +
            "\t\"东：桃源岭\"),\n" +
            "\t//描述判定npc: Array(),\n" +
            "\t//npcdirection: Array(//可去路径{\n" +
            "\t\tname: \"灵隐寺\",\n" +
            "\t\ttext: \"西：灵隐寺 ←\"\n" +
            "\t},\n" +
            "\t{\n" +
            "\t\tname: \"桃源岭\",\n" +
            "\t\ttext: \"东：桃源岭 →\"\n" +
            "\t})\n" +
            "},\n" +
            "{\n" +
            "\tname: \"灵隐寺\",\n" +
            "\t//地图名称text: Array(\"这儿有许多进香客，虔诚地祈祷\",\n" +
            "\t\"同其它庙宇没有什么不同得是。这儿也有许多佛像\",\n" +
            "\t\"东：一线天 →\"),\n" +
            "\t//描述判定npc: Array(\"济公和尚\"),\n" +
            "\t//npcdirection: Array(//可去路径{\n" +
            "\t\tname: \"杭州一线天\",\n" +
            "\t\ttext: \"东：一线天 →\"\n" +
            "\t})\n" +
            "},\n" +
            "{\n" +
            "\tname: \"曲院风荷\",\n" +
            "\t//地图名称text: Array(\"人常说江南的春色若有十分，那么有七分是在杭州\",\n" +
            "\t\"北：岳坟 ↑\"),\n" +
            "\t//描述判定npc: Array(\"怜儿\",\n" +
            "\t\"贵妇人\",\n" +
            "\t\"纨绔公子\"),\n" +
            "\t//npcdirection: Array(//可去路径{\n" +
            "\t\tname: \"岳坟\",\n" +
            "\t\ttext: \"北：岳坟 ↑\"\n" +
            "\t},\n" +
            "\t{\n" +
            "\t\tname: \"西山大道[2]\",\n" +
            "\t\ttext: \"南：西山大道 ↓\"\n" +
            "\t})\n" +
            "},\n" +
            "{\n" +
            "\tname: \"西山大道[1]\",\n" +
            "\t//地图名称text: Array(\"西山大道是联结曲院风荷与西湖乡，花港观鱼的纽带\",\n" +
            "\t\"北：曲院风荷 ↑\",\n" +
            "\t\"南：西山大道 ↓\"),\n" +
            "\t//描述判定npc: Array(\"老妇人\"),\n" +
            "\t//npcdirection: Array(//可去路径{\n" +
            "\t\tname: \"曲院风荷\",\n" +
            "\t\ttext: \"北：曲院风荷 ↑\"\n" +
            "\t},\n" +
            "\t{\n" +
            "\t\tname: \"西山大道[2]\",\n" +
            "\t\ttext: \"南：西山大道 ↓\"\n" +
            "\t})\n" +
            "},\n" +
            "{\n" +
            "\tname: \"西山大道[2]\",\n" +
            "\t//地图名称text: Array(\"西山大道是联结曲院风荷与西湖乡，花港观鱼的纽带\",\n" +
            "\t\"北：西山大道 ↑\",\n" +
            "\t\"西：西湖乡 ←\"),\n" +
            "\t//描述判定npc: Array(),\n" +
            "\t//npcdirection: Array(//可去路径{\n" +
            "\t\tname: \"西山大道[1]\",\n" +
            "\t\ttext: \"北：西山大道 ↑\"\n" +
            "\t},\n" +
            "\t{\n" +
            "\t\tname: \"西湖乡\",\n" +
            "\t\ttext: \"西：西湖乡 ←\"\n" +
            "\t})\n" +
            "},\n" +
            "{\n" +
            "\tname: \"西湖乡\",\n" +
            "\t//地图名称text: Array(\"这是杭州盛产鲜鱼的地方\",\n" +
            "\t\"西：龙井乡\",\n" +
            "\t\"东：西山大道\"),\n" +
            "\t//描述判定npc: Array(\"渔家少年\",\n" +
            "\t\"渔家少女\"),\n" +
            "\t//npcdirection: Array(//可去路径{\n" +
            "\t\tname: \"龙井乡\",\n" +
            "\t\ttext: \"西：龙井乡 ←\"\n" +
            "\t},\n" +
            "\t{\n" +
            "\t\tname: \"西山大道[2]\",\n" +
            "\t\ttext: \"东：西山大道 →\"\n" +
            "\t})\n" +
            "},\n" +
            "{\n" +
            "\tname: \"龙井乡\",\n" +
            "\t//地图名称text: Array(\"天下大概没有几个人不知道龙井茶的名字\",\n" +
            "\t\"但天下大概也没有几个。人会知道龙井村名\",\n" +
            "\t\"东：西湖乡 →\"),\n" +
            "\t//描述判定npc: Array(\"商人\",\n" +
            "\t\"老人\"),\n" +
            "\t//npcdirection: Array(//可去路径{\n" +
            "\t\tname: \"西湖乡\",\n" +
            "\t\ttext: \"东：西湖乡 →\"\n" +
            "\t})\n" +
            "},\n" +
            "{\n" +
            "\tname: \"庆春大街\",\n" +
            "\t//地图名称text: Array(\"庆春街是杭州的商业地区与风景地区的界限\",\n" +
            "\t\"北：武林广场 ↑\",\n" +
            "\t\"南：河坊街 ↓\"),\n" +
            "\t//描述判定npc: Array(),\n" +
            "\t//npcdirection: Array(//可去路径{\n" +
            "\t\tname: \"武林广场\",\n" +
            "\t\ttext: \"北：武林广场 ↑\"\n" +
            "\t},\n" +
            "\t{\n" +
            "\t\tname: \"南山大道[1]\",\n" +
            "\t\ttext: \"西：南山大道 ←\"\n" +
            "\t},\n" +
            "\t{\n" +
            "\t\tname: \"河坊街\",\n" +
            "\t\ttext: \"南：河坊街 ↓\"\n" +
            "\t})\n" +
            "},\n" +
            "{\n" +
            "\tname: \"南山大道[1]\",\n" +
            "\t//地图名称text: Array(\"西湖东边的一条大道，往北边不远就是庆春大街\",\n" +
            "\t\"往西南边有一家。客栈\",\n" +
            "\t\"东：庆春大街 →\"),\n" +
            "\t//描述判定npc: Array(\"观光客\"),\n" +
            "\t//npcdirection: Array(//可去路径{\n" +
            "\t\tname: \"庆春大街\",\n" +
            "\t\ttext: \"东：庆春大街 →\"\n" +
            "\t})\n" +
            "},\n" +
            "{\n" +
            "\tname: \"河坊街\",\n" +
            "\t//地图名称text: Array(\"河坊街是杭州城东南部的一条较繁华的街道\",\n" +
            "\t\"北：庆春大街 ↑\",\n" +
            "\t\"南：复兴街 ↓\"),\n" +
            "\t//描述判定npc: Array(),\n" +
            "\t//npcdirection: Array(//可去路径{\n" +
            "\t\tname: \"庆春大街\",\n" +
            "\t\ttext: \"北：庆春大街 ↑\"\n" +
            "\t},\n" +
            "\t{\n" +
            "\t\tname: \"西子客栈\",\n" +
            "\t\ttext: \"西：西子客栈 ←\"\n" +
            "\t},\n" +
            "\t{\n" +
            "\t\tname: \"复兴街[1]\",\n" +
            "\t\ttext: \"南：复兴街 ↓\"\n" +
            "\t})\n" +
            "},\n" +
            "{\n" +
            "\tname: \"西子客栈\",\n" +
            "\t//地图名称text: Array(\"这儿可以睡觉，而且不必担心被人打扰\",\n" +
            "\t\"西：南山大道 ←\",\n" +
            "\t\"东：河坊街 →\"),\n" +
            "\t//描述判定npc: Array(\"浣纱女孩\"),\n" +
            "\t//npcdirection: Array(//可去路径{\n" +
            "\t\tname: \"南山大道[2]\",\n" +
            "\t\ttext: \"西：南山大道 ←\"\n" +
            "\t},\n" +
            "\t{\n" +
            "\t\tname: \"河坊街\",\n" +
            "\t\ttext: \"东：河坊街 →\"\n" +
            "\t})\n" +
            "},\n" +
            "{\n" +
            "\tname: \"南山大道[2]\",\n" +
            "\t//地图名称text: Array(\"一条紧靠西湖的大道\",\n" +
            "\t\"西：十字路口 ←\",\n" +
            "\t\"东：西子客栈 →\"),\n" +
            "\t//描述判定npc: Array(),\n" +
            "\t//npcdirection: Array(//可去路径{\n" +
            "\t\tname: \"十字路口\",\n" +
            "\t\ttext: \"西：十字路口 ←\"\n" +
            "\t},\n" +
            "\t{\n" +
            "\t\tname: \"西子客栈\",\n" +
            "\t\ttext: \"东：西子客栈 →\"\n" +
            "\t})\n" +
            "},\n" +
            "{\n" +
            "\tname: \"十字路口\",\n" +
            "\t//地图名称text: Array(\"这儿是杭州的交通要道\",\n" +
            "\t\"西：满陇桂雨 ←\",\n" +
            "\t\"东：南山大道 →\"),\n" +
            "\t//描述判定npc: Array(),\n" +
            "\t//npcdirection: Array(//可去路径{\n" +
            "\t\tname: \"满陇桂雨\",\n" +
            "\t\ttext: \"西：满陇桂雨 ←\"\n" +
            "\t},\n" +
            "\t{\n" +
            "\t\tname: \"南山大道[2]\",\n" +
            "\t\ttext: \"东：南山大道 →\"\n" +
            "\t})\n" +
            "},\n" +
            "{\n" +
            "\tname: \"满陇桂雨\",\n" +
            "\t//地图名称text: Array(\"虎跑泉涌出的水流到这儿\",\n" +
            "\t\"汇成一个水池\",\n" +
            "\t\"东：十字路口 →\"),\n" +
            "\t//描述判定npc: Array(\"春游女孩\"),\n" +
            "\t//npcdirection: Array(//可去路径{\n" +
            "\t\tname: \"十字路口\",\n" +
            "\t\ttext: \"东：十字路口 →\"\n" +
            "\t})\n" +
            "},\n" +
            "{\n" +
            "\tname: \"复兴街[1]\",\n" +
            "\t//地图名称text: Array(\"北边是一些店铺\",\n" +
            "\t\"都关着门\",\n" +
            "\t\"主人大概到江边凑热闹去了\",\n" +
            "\t\"北：河坊街 ↑\",\n" +
            "\t\"西：复兴街 ←\"),\n" +
            "\t//描述判定npc: Array(),\n" +
            "\t//npcdirection: Array(//可去路径{\n" +
            "\t\tname: \"河坊街\",\n" +
            "\t\ttext: \"北：河坊街 ↑\"\n" +
            "\t},\n" +
            "\t{\n" +
            "\t\tname: \"复兴街[2]\",\n" +
            "\t\ttext: \"西：复兴街 ←\"\n" +
            "\t})\n" +
            "},\n" +
            "{\n" +
            "\tname: \"复兴街[2]\",\n" +
            "\t//地图名称text: Array(\"起潮落。北边。是一些店铺\",\n" +
            "\t\"都关着门，主人大概到江边凑热闹去了\",\n" +
            "\t\"西：复兴街 ←\",\n" +
            "\t\"东：复兴街 →\"),\n" +
            "\t//描述判定npc: Array(),\n" +
            "\t//npcdirection: Array(//可去路径{\n" +
            "\t\tname: \"复兴街[3]\",\n" +
            "\t\ttext: \"西：复兴街 ←\"\n" +
            "\t},\n" +
            "\t{\n" +
            "\t\tname: \"复兴街[1]\",\n" +
            "\t\ttext: \"东：复兴街 →\"\n" +
            "\t})\n" +
            "},\n" +
            "{\n" +
            "\tname: \"复兴街[3]\",\n" +
            "\t//地图名称text: Array(\"这是一条繁华的街道\",\n" +
            "\t\"由于南边不远就是钱塘江，所以临江一边开\",\n" +
            "\t\"西：十字广场 ←\",\n" +
            "\t\"东：复兴街 →\"),\n" +
            "\t//描述判定npc: Array(\"春游女孩\"),\n" +
            "\t//npcdirection: Array(//可去路径{\n" +
            "\t\tname: \"十字广场\",\n" +
            "\t\ttext: \"西：十字广场 ←\"\n" +
            "\t},\n" +
            "\t{\n" +
            "\t\tname: \"复兴街[2]\",\n" +
            "\t\ttext: \"东：复兴街 →\"\n" +
            "\t})\n" +
            "},\n" +
            "{\n" +
            "\tname: \"十字广场\",\n" +
            "\t//地图名称text: Array(\"这儿是杭州的一个交通要道\",\n" +
            "\t\"西：钱塘大堤 ←\",\n" +
            "\t\"东：复兴街 →\"),\n" +
            "\t//描述判定npc: Array(),\n" +
            "\t//npcdirection: Array(//可去路径{\n" +
            "\t\tname: \"钱塘大堤\",\n" +
            "\t\ttext: \"西：钱塘大堤 ←\"\n" +
            "\t},\n" +
            "\t{\n" +
            "\t\tname: \"复兴街[3]\",\n" +
            "\t\ttext: \"东：复兴街 →\"\n" +
            "\t},\n" +
            "\t{\n" +
            "\t\tname: \"钱塘江石桥\",\n" +
            "\t\ttext: \"南：钱塘江石桥 ↓\"\n" +
            "\t})\n" +
            "},\n" +
            "{\n" +
            "\tname: \"钱塘大堤\",\n" +
            "\t//地图名称text: Array(\"迎面一排浪头凌空而下，似乎要把你吞噬\",\n" +
            "\t\"西：五云山 ←\",\n" +
            "\t\"东：十字广场 →\"),\n" +
            "\t//描述判定npc: Array(),\n" +
            "\t//npcdirection: Array(//可去路径{\n" +
            "\t\tname: \"杭州五云山\",\n" +
            "\t\ttext: \"西：五云山 ←\"\n" +
            "\t},\n" +
            "\t{\n" +
            "\t\tname: \"十字广场\",\n" +
            "\t\ttext: \"东：十字广场 →\"\n" +
            "\t})\n" +
            "},\n" +
            "{\n" +
            "\tname: \"杭州五云山\",\n" +
            "\t//地图名称text: Array(\"此山处在钱塘江和西湖两水相夹之间\",\n" +
            "\t\"水汽充沛\",\n" +
            "\t\"东：钱塘大堤 →\"),\n" +
            "\t//描述判定npc: Array(),\n" +
            "\t//npcdirection: Array(//可去路径{\n" +
            "\t\tname: \"钱塘大堤\",\n" +
            "\t\ttext: \"东：钱塘大堤 →\"\n" +
            "\t})\n" +
            "},\n" +
            "{\n" +
            "\tname: \"钱塘江石桥\",\n" +
            "\t//地图名称text: Array(\"这是钱塘江石桥，远远望去，上面有零零星星几个人\",\n" +
            "\t\"北：十字广场 ↑\",\n" +
            "\t\"南：南门 ↓\"),\n" +
            "\t//描述判定npc: Array(),\n" +
            "\t//npcdirection: Array(//可去路径{\n" +
            "\t\tname: \"十字广场\",\n" +
            "\t\ttext: \"北：十字广场 ↑\"\n" +
            "\t},\n" +
            "\t{\n" +
            "\t\tname: \"杭州南门\",\n" +
            "\t\ttext: \"南：南门 ↓\"\n" +
            "\t})\n" +
            "},\n" +
            "{\n" +
            "\tname: \"杭州南门\",\n" +
            "\t//地图名称text: Array(\"你来到素来与苏州以风景秀丽齐名的杭州城\",\n" +
            "\t\"只见不少游人，过客来来。往往，显的十分热闹\",\n" +
            "\t\"北：钱塘江石桥 ↑\"),\n" +
            "\t//描述判定npc: Array(),\n" +
            "\t//npcdirection: Array(//可去路径{\n" +
            "\t\tname: \"钱塘江石桥\",\n" +
            "\t\ttext: \"北：钱塘江石桥 ↑\"\n" +
            "\t})\n" +
            "},\n" +
            "//----------------------------邪恶的分割线-----------------------------{\n" +
            "\tname: \"武汉南驿道[1]\",\n" +
            "\t//地图名称text: Array(\"一条驿道静静的向远方延伸\",\n" +
            "\t\"北：武汉\",\n" +
            "\t\"南：驿道\"),\n" +
            "\t//描述判定npc: Array(),\n" +
            "\t//npcdirection: Array(//可去路径{\n" +
            "\t\tname: \"武汉\",\n" +
            "\t\ttext: \"北：武汉 ↑\"\n" +
            "\t},\n" +
            "\t{\n" +
            "\t\tname: \"武汉南驿道[2]\",\n" +
            "\t\ttext: \"南：驿道 ↓\"\n" +
            "\t})\n" +
            "},\n" +
            "{\n" +
            "\tname: \"武汉南驿道[2]\",\n" +
            "\t//地图名称text: Array(\"一条驿道静静的向远方延伸\",\n" +
            "\t\"东：衡山山脚 →\",\n" +
            "\t\"北：驿道 ↑\"),\n" +
            "\t//描述判定npc: Array(),\n" +
            "\t//npcdirection: Array(//可去路径{\n" +
            "\t\tname: \"武汉南驿道[1]\",\n" +
            "\t\ttext: \"北：驿道 ↑\"\n" +
            "\t},\n" +
            "\t{\n" +
            "\t\tname: \"岳阳东门\",\n" +
            "\t\ttext: \"西：岳阳东门 ←\"\n" +
            "\t},\n" +
            "\t{\n" +
            "\t\tname: \"衡山山脚\",\n" +
            "\t\ttext: \"东：衡山山脚 →\"\n" +
            "\t},\n" +
            "\t{\n" +
            "\t\tname: \"武汉南驿道[3]\",\n" +
            "\t\ttext: \"南：驿道 ↓\"\n" +
            "\t})\n" +
            "},\n" +
            "{\n" +
            "\tname: \"衡山山脚\",\n" +
            "\t//地图名称text: Array(\"这里是衡山的山脚\",\n" +
            "\t\"西：驿道\",\n" +
            "\t\"南：小亭\"),\n" +
            "\t//描述判定npc: Array(\"彩衣少女\"),\n" +
            "\t//npcdirection: Array(//可去路径{\n" +
            "\t\tname: \"武汉南驿道[2]\",\n" +
            "\t\ttext: \"西：驿道 ←\"\n" +
            "\t},\n" +
            "\t{\n" +
            "\t\tname: \"五岳小亭\",\n" +
            "\t\ttext: \"南：小亭 ↓\"\n" +
            "\t})\n" +
            "},\n" +
            "{\n" +
            "\tname: \"五岳小亭\",\n" +
            "\t//地图名称text: Array(\"你沿着山路一路上行，来到了一间小亭\",\n" +
            "\t\"北：衡山山脚\",\n" +
            "\t\"南：瀑布\"),\n" +
            "\t//描述判定npc: Array(\"美珊\",\n" +
            "\t\"曲馥琪\"),\n" +
            "\t//npcdirection: Array(//可去路径{\n" +
            "\t\tname: \"衡山山脚\",\n" +
            "\t\ttext: \"北：衡山山脚 ↑\"\n" +
            "\t},\n" +
            "\t{\n" +
            "\t\tname: \"五岳瀑布\",\n" +
            "\t\ttext: \"南：瀑布 ↓\"\n" +
            "\t})\n" +
            "},\n" +
            "{\n" +
            "\tname: \"五岳瀑布\",\n" +
            "\t//地图名称text: Array(\"你转过一块大石，一阵水声吓了你一大跳\",\n" +
            "\t\"北：小亭\",\n" +
            "\t\"东：晚月庄\"),\n" +
            "\t//描述判定npc: Array(\"忘情人瑷伦\",\n" +
            "\t\"护庄神像凤凰\"),\n" +
            "\t//npcdirection: Array(//可去路径{\n" +
            "\t\tname: \"五岳小亭\",\n" +
            "\t\ttext: \"北：小亭 ↑\"\n" +
            "\t},\n" +
            "\t{\n" +
            "\t\tname: \"五岳晚月庄\",\n" +
            "\t\ttext: \"东：晚月庄 →\"\n" +
            "\t},\n" +
            "\t{\n" +
            "\t\tname: \"衡山山腰\",\n" +
            "\t\ttext: \"南：衡山山腰 ↓\"\n" +
            "\t})\n" +
            "},\n" +
            "{\n" +
            "\tname: \"五岳晚月庄\",\n" +
            "\t//地图名称text: Array(\"走进大厅，抬头迎面看见的是一面紫红绣金挂幔\",\n" +
            "\t\"西：瀑布\"),\n" +
            "\t//描述判定npc: Array(\"梵音神尼\"),\n" +
            "\t//npcdirection: Array(//可去路径{\n" +
            "\t\tname: \"五岳瀑布\",\n" +
            "\t\ttext: \"西：瀑布 ←\"\n" +
            "\t})\n" +
            "},\n" +
            "{\n" +
            "\tname: \"衡山山腰\",\n" +
            "\t//地图名称text: Array(\"你来到了半山腰，沿途的美景已经让你暗爽到内伤\",\n" +
            "\t\"北：瀑布\",\n" +
            "\t\"东：练剑池\"),\n" +
            "\t//描述判定npc: Array(\"芳绫\",\n" +
            "\t\"蓝小蝶\"),\n" +
            "\t//npcdirection: Array(//可去路径{\n" +
            "\t\tname: \"五岳瀑布\",\n" +
            "\t\ttext: \"北：瀑布 ↑\"\n" +
            "\t},\n" +
            "\t{\n" +
            "\t\tname: \"五岳练剑池\",\n" +
            "\t\ttext: \"东：练剑池 →\"\n" +
            "\t},\n" +
            "\t{\n" +
            "\t\tname: \"五岳松林\",\n" +
            "\t\ttext: \"南：松林 ↓\"\n" +
            "\t})\n" +
            "},\n" +
            "{\n" +
            "\tname: \"五岳练剑池\",\n" +
            "\t//地图名称text: Array(\"练剑池是一个并不很大的池子\",\n" +
            "\t\"据说终年不会干涸\",\n" +
            "\t\"西：衡山山腰\"),\n" +
            "\t//描述判定npc: Array(\"金仪彤\"),\n" +
            "\t//npcdirection: Array(//可去路径{\n" +
            "\t\tname: \"衡山山腰\",\n" +
            "\t\ttext: \"西：衡山山腰 ←\"\n" +
            "\t})\n" +
            "},\n" +
            "{\n" +
            "\tname: \"五岳松林\",\n" +
            "\t//地图名称text: Array(\"一片郁郁葱葱的松林，充满了泥土与青草的芳香\",\n" +
            "\t\"北：衡山山腰\",\n" +
            "\t\"南：石屋\"),\n" +
            "\t//描述判定npc: Array(\"回音仙子蓝止萍\"),\n" +
            "\t//npcdirection: Array(//可去路径{\n" +
            "\t\tname: \"衡山山腰\",\n" +
            "\t\ttext: \"北：衡山山腰 ↑\"\n" +
            "\t},\n" +
            "\t{\n" +
            "\t\tname: \"五岳石屋[1]\",\n" +
            "\t\ttext: \"南：石屋 ↓\"\n" +
            "\t})\n" +
            "},\n" +
            "{\n" +
            "\tname: \"五岳石屋[1]\",\n" +
            "\t//地图名称text: Array(\"一间神秘的石屋，位于山脊上\",\n" +
            "\t\"北：松林\",\n" +
            "\t\"南：石屋\"),\n" +
            "\t//描述判定npc: Array(\"袭人\"),\n" +
            "\t//npcdirection: Array(//可去路径{\n" +
            "\t\tname: \"五岳松林\",\n" +
            "\t\ttext: \"北：松林 ↑\"\n" +
            "\t},\n" +
            "\t{\n" +
            "\t\tname: \"五岳石屋[2]\",\n" +
            "\t\ttext: \"南：石屋 ↓\"\n" +
            "\t})\n" +
            "},\n" +
            "{\n" +
            "\tname: \"五岳石屋[2]\",\n" +
            "\t//地图名称text: Array(\"一间神秘的石屋，位于山脊上\",\n" +
            "\t\"北：石屋\",\n" +
            "\t\"南：石屋\"),\n" +
            "\t//描述判定npc: Array(\"颜慧如\"),\n" +
            "\t//npcdirection: Array(//可去路径{\n" +
            "\t\tname: \"五岳石屋[1]\",\n" +
            "\t\ttext: \"北：石屋 ↑\"\n" +
            "\t},\n" +
            "\t{\n" +
            "\t\tname: \"五岳石屋[3]\",\n" +
            "\t\ttext: \"南：石屋 ↓\"\n" +
            "\t})\n" +
            "},\n" +
            "{\n" +
            "\tname: \"五岳石屋[3]\",\n" +
            "\t//地图名称text: Array(\"一间神秘的石屋，位于山脊上\",\n" +
            "\t\"北：石屋\",\n" +
            "\t\"南：石屋\"),\n" +
            "\t//描述判定npc: Array(\"红衣少女\"),\n" +
            "\t//npcdirection: Array(//可去路径{\n" +
            "\t\tname: \"五岳石屋[2]\",\n" +
            "\t\ttext: \"北：石屋 ↑\"\n" +
            "\t},\n" +
            "\t{\n" +
            "\t\tname: \"五岳石屋[4]\",\n" +
            "\t\ttext: \"南：石屋 ↓\"\n" +
            "\t})\n" +
            "},\n" +
            "{\n" +
            "\tname: \"五岳石屋[4]\",\n" +
            "\t//地图名称text: Array(\"一间神秘的石屋，位于山脊上\",\n" +
            "\t\"东：休息室\",\n" +
            "\t\"南：剑气居 ↓\"),\n" +
            "\t//描述判定npc: Array(\"蓝雨梅\"),\n" +
            "\t//npcdirection: Array(//可去路径{\n" +
            "\t\tname: \"五岳石屋[3]\",\n" +
            "\t\ttext: \"北：石屋 ↑\"\n" +
            "\t},\n" +
            "\t{\n" +
            "\t\tname: \"五岳休息室\",\n" +
            "\t\ttext: \"东：休息室 →\"\n" +
            "\t},\n" +
            "\t{\n" +
            "\t\tname: \"五岳剑气居\",\n" +
            "\t\ttext: \"南：剑气居 ↓\"\n" +
            "\t})\n" +
            "},\n" +
            "{\n" +
            "\tname: \"五岳休息室\",\n" +
            "\t//地图名称text: Array(\"五岳剑派弟子休息的地方\"),\n" +
            "\t//描述判定npc: Array(),\n" +
            "\t//npcdirection: Array(//可去路径{\n" +
            "\t\tname: \"五岳石屋[4]\",\n" +
            "\t\ttext: \"西：石屋 ←\"\n" +
            "\t})\n" +
            "},\n" +
            "{\n" +
            "\tname: \"五岳剑气居\",\n" +
            "\t//地图名称text: Array(\"一间很大的屋子\",\n" +
            "\t\"北：石屋\",\n" +
            "\t\"南：修为斋\"),\n" +
            "\t//描述判定npc: Array(),\n" +
            "\t//npcdirection: Array(//可去路径{\n" +
            "\t\tname: \"五岳石屋[4]\",\n" +
            "\t\ttext: \"北：石屋 ↑\"\n" +
            "\t},\n" +
            "\t{\n" +
            "\t\tname: \"五岳修为斋\",\n" +
            "\t\ttext: \"南：修为斋 ↓\"\n" +
            "\t})\n" +
            "},\n" +
            "{\n" +
            "\tname: \"五岳修为斋\",\n" +
            "\t//地图名称text: Array(\"一间布置得很雅致的屋子\",\n" +
            "\t\"北：剑气居\"),\n" +
            "\t//描述判定npc: Array(\"柳逸风\"),\n" +
            "\t//npcdirection: Array(//可去路径{\n" +
            "\t\tname: \"五岳剑气居\",\n" +
            "\t\ttext: \"北：剑气居 ↑\"\n" +
            "\t})\n" +
            "},\n" +
            "{\n" +
            "\tname: \"岳阳东门\",\n" +
            "\t//地图名称text: Array(\"这是岳阳东城门\",\n" +
            "\t\"北：青竹林 ↑\",\n" +
            "\t\"西：东大街 ←\"),\n" +
            "\t//描述判定npc: Array(\"官兵\"),\n" +
            "\t//npcdirection: Array(//可去路径{\n" +
            "\t\tname: \"岳阳青竹林[1]\",\n" +
            "\t\ttext: \"北：青竹林 ↑\"\n" +
            "\t},\n" +
            "\t{\n" +
            "\t\tname: \"岳阳东大街\",\n" +
            "\t\ttext: \"西：东大街 ←\"\n" +
            "\t},\n" +
            "\t{\n" +
            "\t\tname: \"武汉南驿道[2]\",\n" +
            "\t\ttext: \"东：驿道 →\"\n" +
            "\t})\n" +
            "},\n" +
            "{\n" +
            "\tname: \"岳阳青竹林[1]\",\n" +
            "\t//地图名称text: Array(\"这是一片茂密的青竹林\",\n" +
            "\t\"南：岳阳东门 ↓\"),\n" +
            "\t//描述判定npc: Array(\"托钵僧\"),\n" +
            "\t//npcdirection: Array(//可去路径{\n" +
            "\t\tname: \"岳阳东门\",\n" +
            "\t\ttext: \"南：岳阳东门 ↓\"\n" +
            "\t})\n" +
            "},\n" +
            "{\n" +
            "\tname: \"岳阳东大街\",\n" +
            "\t//地图名称text: Array(\"里面不时地传来学生们抑扬顿挫的读书声\",\n" +
            "\t\"北：书院 ↑\",\n" +
            "\t\"东：岳阳东门 →\"),\n" +
            "\t//描述判定npc: Array(),\n" +
            "\t//npcdirection: Array(//可去路径{\n" +
            "\t\tname: \"岳阳书院\",\n" +
            "\t\ttext: \"北：书院 ↑\"\n" +
            "\t},\n" +
            "\t{\n" +
            "\t\tname: \"岳阳中央广场\",\n" +
            "\t\ttext: \"西：中央广场 ←\"\n" +
            "\t},\n" +
            "\t{\n" +
            "\t\tname: \"岳阳东门\",\n" +
            "\t\ttext: \"东：岳阳东门 →\"\n" +
            "\t},\n" +
            "\t{\n" +
            "\t\tname: \"岳阳东驿站\",\n" +
            "\t\ttext: \"南：驿站 ↓\"\n" +
            "\t})\n" +
            "},\n" +
            "{\n" +
            "\tname: \"岳阳书院\",\n" +
            "\t//地图名称text: Array(\"这里是书院的讲堂，窗明几净\",\n" +
            "\t\"南：东大街 ↓\"),\n" +
            "\t//描述判定npc: Array(\"朱熹\"),\n" +
            "\t//npcdirection: Array(//可去路径{\n" +
            "\t\tname: \"岳阳东大街\",\n" +
            "\t\ttext: \"南：东大街 ↓\"\n" +
            "\t})\n" +
            "},\n" +
            "{\n" +
            "\tname: \"岳阳东驿站\",\n" +
            "\t//地图名称text: Array(\"还有一个车老板坐在旁边等生意\",\n" +
            "\t\"北：东大街 ↑\"),\n" +
            "\t//描述判定npc: Array(\"孙长汉\"),\n" +
            "\t//npcdirection: Array(//可去路径{\n" +
            "\t\tname: \"岳阳东大街\",\n" +
            "\t\ttext: \"北：东大街 ↑\"\n" +
            "\t})\n" +
            "},\n" +
            "{\n" +
            "\tname: \"岳阳中央广场\",\n" +
            "\t//地图名称text: Array(\"这里是城市的正中心，一个很宽阔的广场\",\n" +
            "\t\"北：北大街 ↑\",\n" +
            "\t\"东：东大街 →\"),\n" +
            "\t//描述判定npc: Array(\"流氓\",\n" +
            "\t\"流氓头\"),\n" +
            "\t//npcdirection: Array(//可去路径{\n" +
            "\t\tname: \"岳阳北大街[1]\",\n" +
            "\t\ttext: \"北：北大街 ↑\"\n" +
            "\t},\n" +
            "\t{\n" +
            "\t\tname: \"岳阳西大街\",\n" +
            "\t\ttext: \"西：西大街 ←\"\n" +
            "\t},\n" +
            "\t{\n" +
            "\t\tname: \"岳阳东大街\",\n" +
            "\t\ttext: \"东：东大街 →\"\n" +
            "\t},\n" +
            "\t{\n" +
            "\t\tname: \"岳阳南大街\",\n" +
            "\t\ttext: \"南：南大街 ↓\"\n" +
            "\t})\n" +
            "},\n" +
            "{\n" +
            "\tname: \"岳阳北大街[1]\",\n" +
            "\t//地图名称text: Array(\"东边是一家生意兴隆的客栈\",\n" +
            "\t\"西：钱庄 ←\",\n" +
            "\t\"东：客店 →\"),\n" +
            "\t//描述判定npc: Array(),\n" +
            "\t//npcdirection: Array(//可去路径{\n" +
            "\t\tname: \"岳阳北大街[2]\",\n" +
            "\t\ttext: \"北：北大街 ↑\"\n" +
            "\t},\n" +
            "\t{\n" +
            "\t\tname: \"岳阳钱庄\",\n" +
            "\t\ttext: \"西：钱庄 ←\"\n" +
            "\t},\n" +
            "\t{\n" +
            "\t\tname: \"岳阳客店\",\n" +
            "\t\ttext: \"东：客店 →\"\n" +
            "\t},\n" +
            "\t{\n" +
            "\t\tname: \"岳阳中央广场\",\n" +
            "\t\ttext: \"南：中央广场 ↓\"\n" +
            "\t})\n" +
            "},\n" +
            "{\n" +
            "\tname: \"岳阳钱庄\",\n" +
            "\t//地图名称text: Array(\"这是一家老字号的钱庄，已有几百年的历史\",\n" +
            "\t\"东：北大街 →\"),\n" +
            "\t//描述判定npc: Array(),\n" +
            "\t//npcdirection: Array(//可去路径{\n" +
            "\t\tname: \"岳阳北大街[1]\",\n" +
            "\t\ttext: \"东：北大街 →\"\n" +
            "\t})\n" +
            "},\n" +
            "{\n" +
            "\tname: \"岳阳客店\",\n" +
            "\t//地图名称text: Array(\"这是一家价钱低廉的客栈，生意非常兴隆\",\n" +
            "\t\"南：客店二楼 ↓\"),\n" +
            "\t//描述判定npc: Array(\"店小二\",\n" +
            "\t\"水笙(任务)\"),\n" +
            "\t//npcdirection: Array(//可去路径{\n" +
            "\t\tname: \"岳阳北大街[1]\",\n" +
            "\t\ttext: \"西：北大街 ←\"\n" +
            "\t})\n" +
            "},\n" +
            "{\n" +
            "\tname: \"岳阳北大街[2]\",\n" +
            "\t//地图名称text: Array(\"北：北门 ↑\",\n" +
            "\t\"西：道法场 ←\",\n" +
            "\t\"南：北大街 ↓\"),\n" +
            "\t//描述判定npc: Array(),\n" +
            "\t//npcdirection: Array(//可去路径{\n" +
            "\t\tname: \"岳阳北门\",\n" +
            "\t\ttext: \"北：北门 ↑\"\n" +
            "\t},\n" +
            "\t{\n" +
            "\t\tname: \"岳阳道法场\",\n" +
            "\t\ttext: \"西：道法场 ←\"\n" +
            "\t},\n" +
            "\t{\n" +
            "\t\tname: \"岳阳北大街[1]\",\n" +
            "\t\ttext: \"南：北大街 ↓\"\n" +
            "\t})\n" +
            "},\n" +
            "{\n" +
            "\tname: \"岳阳道法场\",\n" +
            "\t//地图名称text: Array(\"这里是和尚道士们给死人做法事\",\n" +
            "\t\"东：北大街 →\"),\n" +
            "\t//描述判定npc: Array(\"法师\"),\n" +
            "\t//npcdirection: Array(//可去路径{\n" +
            "\t\tname: \"岳阳北大街[2]\",\n" +
            "\t\ttext: \"东：北大街 →\"\n" +
            "\t})\n" +
            "},\n" +
            "{\n" +
            "\tname: \"岳阳北门\",\n" +
            "\t//地图名称text: Array(\"这是北城门，因为曾经失火\",\n" +
            "\t\"东：树洞内部 →\",\n" +
            "\t\"南：北大街 ↓\"),\n" +
            "\t//描述判定npc: Array(\"官兵\"),\n" +
            "\t//npcdirection: Array(//可去路径{\n" +
            "\t\tname: \"树洞内部\",\n" +
            "\t\ttext: \"东：树洞内部 →\"\n" +
            "\t},\n" +
            "\t{\n" +
            "\t\tname: \"岳阳北大街[2]\",\n" +
            "\t\ttext: \"南：北大街 ↓\"\n" +
            "\t})\n" +
            "},\n" +
            "{\n" +
            "\tname: \"树洞内部\",\n" +
            "\t//地图名称text: Array(\"这是岳阳城中央广场的老槐树内部\",\n" +
            "\t\"北：树洞下 ↑\",\n" +
            "\t\"西：北门 ←\"),\n" +
            "\t//描述判定npc: Array(\"左全\"),\n" +
            "\t//npcdirection: Array(//可去路径{\n" +
            "\t\tname: \"树洞下\",\n" +
            "\t\ttext: \"北：树洞下 ↑\"\n" +
            "\t},\n" +
            "\t{\n" +
            "\t\tname: \"岳阳北门\",\n" +
            "\t\ttext: \"西：北门 ←\"\n" +
            "\t})\n" +
            "},\n" +
            "{\n" +
            "\tname: \"树洞下\",\n" +
            "\t//地图名称text: Array(\"这是老槐树底部，四周光线昏暗\",\n" +
            "\t\"北：储藏室 ↑\",\n" +
            "\t\"南：树洞内部 ↓\"),\n" +
            "\t//描述判定npc: Array(\"梁长老\"),\n" +
            "\t//npcdirection: Array(//可去路径{\n" +
            "\t\tname: \"丐帮储藏室\",\n" +
            "\t\ttext: \"北：储藏室 ↑\"\n" +
            "\t},\n" +
            "\t{\n" +
            "\t\tname: \"丐帮暗道[1]\",\n" +
            "\t\ttext: \"东：暗道 →\"\n" +
            "\t},\n" +
            "\t{\n" +
            "\t\tname: \"树洞内部\",\n" +
            "\t\ttext: \"南：树洞内部 ↓\"\n" +
            "\t})\n" +
            "},\n" +
            "{\n" +
            "\tname: \"丐帮储藏室\",\n" +
            "\t//地图名称text: Array(\"这里是丐帮的储藏室\",\n" +
            "\t\"西：密室 ←\",\n" +
            "\t\"南：树洞下 ↓\"),\n" +
            "\t//描述判定npc: Array(\"何师我\"),\n" +
            "\t//npcdirection: Array(//可去路径{\n" +
            "\t\tname: \"丐帮密室\",\n" +
            "\t\ttext: \"西：密室 ←\"\n" +
            "\t},\n" +
            "\t{\n" +
            "\t\tname: \"树洞下\",\n" +
            "\t\ttext: \"南：树洞下 ↓\"\n" +
            "\t})\n" +
            "},\n" +
            "{\n" +
            "\tname: \"丐帮密室\",\n" +
            "\t//地图名称text: Array(\"这是一间光线阴暗的密室\",\n" +
            "\t\"东：储藏室 →\"),\n" +
            "\t//描述判定npc: Array(),\n" +
            "\t//npcdirection: Array(//可去路径{\n" +
            "\t\tname: \"丐帮储藏室\",\n" +
            "\t\ttext: \"东：储藏室 →\"\n" +
            "\t})\n" +
            "},\n" +
            "{\n" +
            "\tname: \"丐帮暗道[1]\",\n" +
            "\t//地图名称text: Array(\"这是丐帮。极其秘密的地下通道\",\n" +
            "\t\"西：树洞下 ←\",\n" +
            "\t\"东：暗道 →\"),\n" +
            "\t//描述判定npc: Array(),\n" +
            "\t//npcdirection: Array(//可去路径{\n" +
            "\t\tname: \"树洞下\",\n" +
            "\t\ttext: \"西：树洞下 ←\"\n" +
            "\t},\n" +
            "\t{\n" +
            "\t\tname: \"丐帮暗道[2]\",\n" +
            "\t\ttext: \"东：暗道 →\"\n" +
            "\t})\n" +
            "},\n" +
            "{\n" +
            "\tname: \"丐帮暗道[2]\",\n" +
            "\t//地图名称text: Array(\"这是丐帮。极其秘密的地下通道\",\n" +
            "\t\"西：暗道 ←\",\n" +
            "\t\"东：破庙密室 →\"),\n" +
            "\t//描述判定npc: Array(\"莫不收\"),\n" +
            "\t//npcdirection: Array(//可去路径{\n" +
            "\t\tname: \"丐帮暗道[1]\",\n" +
            "\t\ttext: \"西：暗道 ←\"\n" +
            "\t},\n" +
            "\t{\n" +
            "\t\tname: \"丐帮破庙密室\",\n" +
            "\t\ttext: \"东：破庙密室 →\"\n" +
            "\t})\n" +
            "},\n" +
            "{\n" +
            "\tname: \"丐帮破庙密室\",\n" +
            "\t//地图名称text: Array(\"这是丐帮重要密道之一\",\n" +
            "\t\"西：暗道 ←\",\n" +
            "\t\"南：土地庙 ↓\"),\n" +
            "\t//描述判定npc: Array(\"快活三\"),\n" +
            "\t//npcdirection: Array(//可去路径{\n" +
            "\t\tname: \"丐帮暗道[2]\",\n" +
            "\t\ttext: \"西：暗道 ←\"\n" +
            "\t},\n" +
            "\t{\n" +
            "\t\tname: \"丐帮土地庙\",\n" +
            "\t\ttext: \"南：土地庙 ↓\"\n" +
            "\t})\n" +
            "},\n" +
            "{\n" +
            "\tname: \"丐帮土地庙\",\n" +
            "\t//地图名称text: Array(\"这是一间破破烂烂的土地庙\",\n" +
            "\t\"北：破庙密室 ↑\",\n" +
            "\t\"南：青竹林 ↓\"),\n" +
            "\t//描述判定npc: Array(\"彭有敬\",\n" +
            "\t\"鲁有脚\"),\n" +
            "\t//npcdirection: Array(//可去路径{\n" +
            "\t\tname: \"丐帮破庙密室\",\n" +
            "\t\ttext: \"北：破庙密室 ↑\"\n" +
            "\t},\n" +
            "\t{\n" +
            "\t\tname: \"丐帮暗道[3]\",\n" +
            "\t\ttext: \"东：暗道 →\"\n" +
            "\t},\n" +
            "\t{\n" +
            "\t\tname: \"岳阳青竹林[1]\",\n" +
            "\t\ttext: \"南：青竹林 ↓\"\n" +
            "\t})\n" +
            "},\n" +
            "{\n" +
            "\tname: \"丐帮暗道[3]\",\n" +
            "\t//地图名称text: Array(\"一条狭窄的地下秘密通道\",\n" +
            "\t\"西：土地庙 ←\",\n" +
            "\t\"东：林间小屋 →\"),\n" +
            "\t//描述判定npc: Array(\"简长老\"),\n" +
            "\t//npcdirection: Array(//可去路径{\n" +
            "\t\tname: \"丐帮土地庙\",\n" +
            "\t\ttext: \"西：土地庙 ←\"\n" +
            "\t},\n" +
            "\t{\n" +
            "\t\tname: \"丐帮林间小屋\",\n" +
            "\t\ttext: \"东：林间小屋 →\"\n" +
            "\t})\n" +
            "},\n" +
            "{\n" +
            "\tname: \"丐帮林间小屋\",\n" +
            "\t//地图名称text: Array(\"但一阵扑鼻而来的狗肉香味\",\n" +
            "\t\"西：暗道 ←\"),\n" +
            "\t//描述判定npc: Array(\"洪七公\",\n" +
            "\t\"赵狗儿\"),\n" +
            "\t//npcdirection: Array(//可去路径{\n" +
            "\t\tname: \"丐帮暗道[3]\",\n" +
            "\t\ttext: \"西：暗道 ←\"\n" +
            "\t})\n" +
            "},\n" +
            "{\n" +
            "\tname: \"岳阳南大街\",\n" +
            "\t//地图名称text: Array(\"南大街乃是城里的繁华地段\",\n" +
            "\t\"北：中央广场 ↑\",\n" +
            "\t\"南：南门 ↓\"),\n" +
            "\t//描述判定npc: Array(),\n" +
            "\t//npcdirection: Array(//可去路径{\n" +
            "\t\tname: \"岳阳中央广场\",\n" +
            "\t\ttext: \"北：中央广场 ↑\"\n" +
            "\t},\n" +
            "\t{\n" +
            "\t\tname: \"岳阳大门紧闭\",\n" +
            "\t\ttext: \"东：（大门紧闭）\"\n" +
            "\t},\n" +
            "\t{\n" +
            "\t\tname: \"岳阳南门\",\n" +
            "\t\ttext: \"南：南门 ↓\"\n" +
            "\t})\n" +
            "},\n" +
            "{\n" +
            "\tname: \"岳阳南门\",\n" +
            "\t//地图名称text: Array(\"这是岳阳南城门\",\n" +
            "\t\"北：南大街 ↑\"),\n" +
            "\t//描述判定npc: Array(\"官兵\"),\n" +
            "\t//npcdirection: Array(//可去路径{\n" +
            "\t\tname: \"岳阳南大街\",\n" +
            "\t\ttext: \"北：南大街 ↑\"\n" +
            "\t})\n" +
            "},\n" +
            "{\n" +
            "\tname: \"武汉南驿道[3]\",\n" +
            "\t//地图名称text: Array(\"一条驿道静静的向远方延伸\",\n" +
            "\t\"南：广州北门\",\n" +
            "\t\"北：驿道\"),\n" +
            "\t//描述判定npc: Array(\"陆得财\"),\n" +
            "\t//npcdirection: Array(//可去路径{\n" +
            "\t\tname: \"武汉南驿道[2]\",\n" +
            "\t\ttext: \"北：驿道 ↑\"\n" +
            "\t},\n" +
            "\t{\n" +
            "\t\tname: \"广州北门\",\n" +
            "\t\ttext: \"南：广州北门 ↓\"\n" +
            "\t})\n" +
            "},\n" +
            "{\n" +
            "\tname: \"广州北门\",\n" +
            "\t//地图名称text: Array(\"这是北城门，因为曾经失火\",\n" +
            "\t\"到现在城墙还是黑乎乎的\",\n" +
            "\t\"广州北门\",\n" +
            "\t\"南：北大街\"),\n" +
            "\t//描述判定npc: Array(\"官兵\"),\n" +
            "\t//npcdirection: Array(//可去路径{\n" +
            "\t\tname: \"武汉南驿道[3]\",\n" +
            "\t\ttext: \"北：驿道 ↑\"\n" +
            "\t},\n" +
            "\t{\n" +
            "\t\tname: \"广州北大街\",\n" +
            "\t\ttext: \"南：北大街 ↓\"\n" +
            "\t})\n" +
            "},\n" +
            "{\n" +
            "\tname: \"广州北大街\",\n" +
            "\t//地图名称text: Array(\"北：广州北门\",\n" +
            "\t\"东：早茶\",\n" +
            "\t\"南：中央广场 ↓\"),\n" +
            "\t//描述判定npc: Array(\"托钵僧\"),\n" +
            "\t//npcdirection: Array(//可去路径{\n" +
            "\t\tname: \"广州北门\",\n" +
            "\t\ttext: \"北：广州北门 ↑\"\n" +
            "\t},\n" +
            "\t{\n" +
            "\t\tname: \"广州钱庄\",\n" +
            "\t\ttext: \"西：钱庄 ←\"\n" +
            "\t},\n" +
            "\t{\n" +
            "\t\tname: \"广州早茶\",\n" +
            "\t\ttext: \"东：早茶 →\"\n" +
            "\t},\n" +
            "\t{\n" +
            "\t\tname: \"广州中央广场\",\n" +
            "\t\ttext: \"南：中央广场 ↓\"\n" +
            "\t})\n" +
            "},\n" +
            "{\n" +
            "\tname: \"广州钱庄\",\n" +
            "\t//地图名称text: Array(\"这是一家老字号的钱庄\",\n" +
            "\t\"东：北大街\"),\n" +
            "\t//描述判定npc: Array(\"书剑侠潘军禅\",\n" +
            "\t\"小天邪萧辟尘\"),\n" +
            "\t//npcdirection: Array(//可去路径{\n" +
            "\t\tname: \"广州北大街\",\n" +
            "\t\ttext: \"东：北大街 →\"\n" +
            "\t})\n" +
            "},\n" +
            "{\n" +
            "\tname: \"广州早茶\",\n" +
            "\t//地图名称text: Array(\"这是一家价钱低廉的客栈，生意非常兴隆\",\n" +
            "\t\"西：北大街\"),\n" +
            "\t//描述判定npc: Array(\"店小二\"),\n" +
            "\t//npcdirection: Array(//可去路径{\n" +
            "\t\tname: \"广州北大街\",\n" +
            "\t\ttext: \"西：北大街 ←\"\n" +
            "\t})\n" +
            "},\n" +
            "{\n" +
            "\tname: \"广州中央广场\",\n" +
            "\t//地图名称text: Array(\"这里是城市的正中心，一个很宽阔的广场，铺着青石地面\",\n" +
            "\t\"北：北大街\",\n" +
            "\t\"东：东大街\"),\n" +
            "\t//描述判定npc: Array(\"水烟阁武士\",\n" +
            "\t\"天邪虎\"),\n" +
            "\t//npcdirection: Array(//可去路径{\n" +
            "\t\tname: \"广州北大街\",\n" +
            "\t\ttext: \"北：北大街 ↑\"\n" +
            "\t},\n" +
            "\t{\n" +
            "\t\tname: \"广州西大街\",\n" +
            "\t\ttext: \"西：西大街 ←\"\n" +
            "\t},\n" +
            "\t{\n" +
            "\t\tname: \"广州东大街\",\n" +
            "\t\ttext: \"东：东大街 →\"\n" +
            "\t},\n" +
            "\t{\n" +
            "\t\tname: \"广州南大街\",\n" +
            "\t\ttext: \"南：南大街 ↓\"\n" +
            "\t})\n" +
            "},\n" +
            "{\n" +
            "\tname: \"广州南大街\",\n" +
            "\t//地图名称text: Array(\"南大街乃是城里的繁华地段\",\n" +
            "\t\"西：广州药铺\",\n" +
            "\t\"东：兴隆当铺\"),\n" +
            "\t//描述判定npc: Array(\"流氓头\",\n" +
            "\t\"流氓\"),\n" +
            "\t//npcdirection: Array(//可去路径{\n" +
            "\t\tname: \"广州中央广场\",\n" +
            "\t\ttext: \"北：中央广场 ↑\"\n" +
            "\t},\n" +
            "\t{\n" +
            "\t\tname: \"广州药铺\",\n" +
            "\t\ttext: \"西：广州药铺 ←\"\n" +
            "\t},\n" +
            "\t{\n" +
            "\t\tname: \"兴隆当铺\",\n" +
            "\t\ttext: \"东：兴隆当铺 →\"\n" +
            "\t},\n" +
            "\t{\n" +
            "\t\tname: \"广州南门\",\n" +
            "\t\ttext: \"南：广州南门 ↓\"\n" +
            "\t})\n" +
            "},\n" +
            "{\n" +
            "\tname: \"广州药铺\",\n" +
            "\t//地图名称text: Array(\"这是一家药铺，一股浓浓的药味让你几欲窒息\",\n" +
            "\t\"东：南大街\"),\n" +
            "\t//描述判定npc: Array(\"药铺伙计\"),\n" +
            "\t//npcdirection: Array(//可去路径{\n" +
            "\t\tname: \"广州南大街\",\n" +
            "\t\ttext: \"东：南大街 →\"\n" +
            "\t})\n" +
            "},\n" +
            "{\n" +
            "\tname: \"兴隆当铺\",\n" +
            "\t//地图名称text: Array(\"这是一家中等规模的当铺\",\n" +
            "\t\"西边有一扇木雕门通往大街\",\n" +
            "\t\"西：南大街\"),\n" +
            "\t//描述判定npc: Array(\"骆云舟\"),\n" +
            "\t//npcdirection: Array(//可去路径{\n" +
            "\t\tname: \"广州南大街\",\n" +
            "\t\ttext: \"西：南大街 ←\"\n" +
            "\t})\n" +
            "},\n" +
            "{\n" +
            "\tname: \"广州南门\",\n" +
            "\t//地图名称text: Array(\"这是广州南城门，城墙贴着告示\",\n" +
            "\t\"北：南大街\",\n" +
            "\t\"南：驿道\"),\n" +
            "\t//描述判定npc: Array(\"官兵\"),\n" +
            "\t//npcdirection: Array(//可去路径{\n" +
            "\t\tname: \"广州南大街\",\n" +
            "\t\ttext: \"北：南大街 ↑\"\n" +
            "\t},\n" +
            "\t{\n" +
            "\t\tname: \"广州南驿道[1]\",\n" +
            "\t\ttext: \"南：驿道 ↓\"\n" +
            "\t})\n" +
            "},\n" +
            "{\n" +
            "\tname: \"广州南驿道[1]\",\n" +
            "\t//地图名称text: Array(\"一条驿道静静的向远方延伸\",\n" +
            "\t\"北：广州南门\",\n" +
            "\t\"南：驿道\"),\n" +
            "\t//描述判定npc: Array(\"青青\"),\n" +
            "\t//npcdirection: Array(//可去路径{\n" +
            "\t\tname: \"广州南门\",\n" +
            "\t\ttext: \"北：广州南门 ↑\"\n" +
            "\t},\n" +
            "\t{\n" +
            "\t\tname: \"成都南驿道[2]\",\n" +
            "\t\ttext: \"西：驿道 ←\"\n" +
            "\t},\n" +
            "\t{\n" +
            "\t\tname: \"广州南驿道[2]\",\n" +
            "\t\ttext: \"南：驿道 ↓\"\n" +
            "\t})\n" +
            "},\n" +
            "{\n" +
            "\tname: \"广州南驿道[2]\",\n" +
            "\t//地图名称text: Array(\"一条驿道静静的向远方延伸\",\n" +
            "\t\"北：驿道\",\n" +
            "\t\"南：海滩 ↓\"),\n" +
            "\t//描述判定npc: Array(\"丁鹏\",\n" +
            "\t\"黄药师\"),\n" +
            "\t//npcdirection: Array(//可去路径{\n" +
            "\t\tname: \"广州南驿道[1]\",\n" +
            "\t\ttext: \"北：驿道 ↑\"\n" +
            "\t},\n" +
            "\t{\n" +
            "\t\tname: \"广州海滩\",\n" +
            "\t\ttext: \"南：海滩 ↓\"\n" +
            "\t})\n" +
            "},\n" +
            "{\n" +
            "\tname: \"广州海滩\",\n" +
            "\t//地图名称text: Array(\"一片银色的海滩\",\n" +
            "\t\"北：驿道\",\n" +
            "\t\"大船\"),\n" +
            "\t//描述判定npc: Array(),\n" +
            "\t//npcdirection: Array(//可去路径{\n" +
            "\t\tname: \"广州南驿道[2]\",\n" +
            "\t\ttext: \"北：驿道 ↑\"\n" +
            "\t},\n" +
            "\t{\n" +
            "\t\tname: \"广州海滩大船\",\n" +
            "\t\ttext: \"大船\"\n" +
            "\t})\n" +
            "},\n" +
            "{\n" +
            "\tname: \"广州海滩大船\",\n" +
            "\t//地图名称text: Array(\"这是开往一处神秘海岛的大船，想去的请\"),\n" +
            "\t//描述判定npc: Array(),\n" +
            "\t//npcdirection: Array(//可去路径{\n" +
            "\t\tname: \"广州海岛\",\n" +
            "\t\ttext: \"上船\"\n" +
            "\t},\n" +
            "\t{\n" +
            "\t\tname: \"广州海滩\",\n" +
            "\t\ttext: \"返回\"\n" +
            "\t})\n" +
            "},\n" +
            "{\n" +
            "\tname: \"广州海岛大船\",\n" +
            "\t//地图名称text: Array(\"这是开往中原的大船，想去的请\",\n" +
            "\t\"上船\"),\n" +
            "\t//描述判定npc: Array(),\n" +
            "\t//npcdirection: Array(//可去路径{\n" +
            "\t\tname: \"广州海滩\",\n" +
            "\t\ttext: \"上船\"\n" +
            "\t},\n" +
            "\t{\n" +
            "\t\tname: \"广州海岛\",\n" +
            "\t\ttext: \"返回\"\n" +
            "\t})\n" +
            "},\n" +
            "{\n" +
            "\tname: \"广州海岛\",\n" +
            "\t//地图名称text: Array(\"一个郁郁葱葱的海岛。海边泊着一艘\",\n" +
            "\t\"南：常春岛入口 ↓\"),\n" +
            "\t//描述判定npc: Array(),\n" +
            "\t//npcdirection: Array(//可去路径{\n" +
            "\t\tname: \"广州海岛大船\",\n" +
            "\t\ttext: \"大船\"\n" +
            "\t},\n" +
            "\t{\n" +
            "\t\tname: \"常春岛入口\",\n" +
            "\t\ttext: \"南：常春岛入口 ↓\"\n" +
            "\t})\n" +
            "},\n" +
            "{\n" +
            "\tname: \"常春岛入口\",\n" +
            "\t//地图名称text: Array(\"这里是常春岛的入口。只见大海茫茫\",\n" +
            "\t\"北：海岛 ↑\"),\n" +
            "\t//描述判定npc: Array(\"老王\"),\n" +
            "\t//npcdirection: Array(//可去路径{\n" +
            "\t\tname: \"广州海岛\",\n" +
            "\t\ttext: \"北：海岛 ↑\"\n" +
            "\t},\n" +
            "\t{\n" +
            "\t\tname: \"常春岛山庄前院\",\n" +
            "\t\ttext: \"南：山庄前院 ↓\"\n" +
            "\t})\n" +
            "},\n" +
            "{\n" +
            "\tname: \"常春岛山庄前院\",\n" +
            "\t//地图名称text: Array(\"这里是常春岛麻衣客朱藻的山庄\",\n" +
            "\t\"北：常春岛入口 ↑\",\n" +
            "\t\"南：山庄正厅 ↓\"),\n" +
            "\t//描述判定npc: Array(),\n" +
            "\t//npcdirection: Array(//可去路径{\n" +
            "\t\tname: \"常春岛入口\",\n" +
            "\t\ttext: \"北：常春岛入口 ↑\"\n" +
            "\t},\n" +
            "\t{\n" +
            "\t\tname: \"常春岛红门\",\n" +
            "\t\ttext: \"东：（大门紧闭）\"\n" +
            "\t},\n" +
            "\t{\n" +
            "\t\tname: \"常春岛山庄正厅\",\n" +
            "\t\ttext: \"南：山庄正厅 ↓\"\n" +
            "\t})\n" +
            "},\n" +
            "{\n" +
            "\tname: \"常春岛山庄正厅\",\n" +
            "\t//地图名称text: Array(\"你来到了山庄的正厅。东边有一扇紧锁着的橙门\",\n" +
            "\t\"北：山庄前院 ↑\",\n" +
            "\t\"南：山庄后院 ↓\"),\n" +
            "\t//描述判定npc: Array(\"朱藻\"),\n" +
            "\t//npcdirection: Array(//可去路径{\n" +
            "\t\tname: \"常春岛山庄前院\",\n" +
            "\t\ttext: \"北：山庄前院 ↑\"\n" +
            "\t},\n" +
            "\t{\n" +
            "\t\tname: \"常春岛橙门\",\n" +
            "\t\ttext: \"东：（大门紧闭）\"\n" +
            "\t},\n" +
            "\t{\n" +
            "\t\tname: \"常春岛山庄后院\",\n" +
            "\t\ttext: \"南：山庄后院 ↓\"\n" +
            "\t})\n" +
            "},\n" +
            "{\n" +
            "\tname: \"常春岛山庄后院\",\n" +
            "\t//地图名称text: Array(\"这里是山庄的后院。东边有一扇紧锁着的黄门\",\n" +
            "\t\"北：山庄正厅 ↑\",\n" +
            "\t\"南：后花园 ↓\"),\n" +
            "\t//描述判定npc: Array(),\n" +
            "\t//npcdirection: Array(//可去路径{\n" +
            "\t\tname: \"常春岛山庄正厅\",\n" +
            "\t\ttext: \"北：山庄正厅 ↑\"\n" +
            "\t},\n" +
            "\t{\n" +
            "\t\tname: \"常春岛黄门\",\n" +
            "\t\ttext: \"东：（大门紧闭）\"\n" +
            "\t},\n" +
            "\t{\n" +
            "\t\tname: \"常春岛山庄后花园[1]\",\n" +
            "\t\ttext: \"南：后花园 ↓\"\n" +
            "\t})\n" +
            "},\n" +
            "{\n" +
            "\tname: \"常春岛山庄后花园[1]\",\n" +
            "\t//地图名称text: Array(\"这里是山庄的后花园。东边有一扇紧锁着的绿门\",\n" +
            "\t\"北：山庄后院 ↑\",\n" +
            "\t\"南：后花园 ↓\"),\n" +
            "\t//描述判定npc: Array(),\n" +
            "\t//npcdirection: Array(//可去路径{\n" +
            "\t\tname: \"常春岛山庄后院\",\n" +
            "\t\ttext: \"北：山庄后院 ↑\"\n" +
            "\t},\n" +
            "\t{\n" +
            "\t\tname: \"常春岛绿门\",\n" +
            "\t\ttext: \"东：（大门紧闭）\"\n" +
            "\t},\n" +
            "\t{\n" +
            "\t\tname: \"常春岛山庄后花园[2]\",\n" +
            "\t\ttext: \"南：后花园 ↓\"\n" +
            "\t})\n" +
            "},\n" +
            "{\n" +
            "\tname: \"常春岛山庄后花园[2]\",\n" +
            "\t//地图名称text: Array(\"这里是山庄的后花园\",\n" +
            "\t\"北：后花园 ↑\",\n" +
            "\t\"南：后花园 ↓\"),\n" +
            "\t//描述判定npc: Array(\"守卫\"),\n" +
            "\t//npcdirection: Array(//可去路径{\n" +
            "\t\tname: \"常春岛山庄后花园[1]\",\n" +
            "\t\ttext: \"北：后花园 ↑\"\n" +
            "\t},\n" +
            "\t{\n" +
            "\t\tname: \"常春岛山庄青门\",\n" +
            "\t\ttext: \"东：青门 →\"\n" +
            "\t},\n" +
            "\t{\n" +
            "\t\tname: \"常春岛山庄后花园[3]\",\n" +
            "\t\ttext: \"南：后花园 ↓\"\n" +
            "\t})\n" +
            "},\n" +
            "{\n" +
            "\tname: \"常春岛山庄后花园[3]\",\n" +
            "\t//地图名称text: Array(\"这里是山庄的后花园\",\n" +
            "\t\"北：后花园 ↑\",\n" +
            "\t\"南：后花园 ↓\"),\n" +
            "\t//描述判定npc: Array(\"守卫\"),\n" +
            "\t//npcdirection: Array(//可去路径{\n" +
            "\t\tname: \"常春岛山庄后花园[2]\",\n" +
            "\t\ttext: \"北：后花园 ↑\"\n" +
            "\t},\n" +
            "\t{\n" +
            "\t\tname: \"常春岛山庄蓝门\",\n" +
            "\t\ttext: \"东：蓝门 →\"\n" +
            "\t},\n" +
            "\t{\n" +
            "\t\tname: \"常春岛山庄后花园[4]\",\n" +
            "\t\ttext: \"南：后花园 ↓\"\n" +
            "\t})\n" +
            "},\n" +
            "{\n" +
            "\tname: \"常春岛山庄后花园[4]\",\n" +
            "\t//地图名称text: Array(\"这里是山庄的后花园\",\n" +
            "\t\"北：后花园 ↑\",\n" +
            "\t\"南：山洞入口 ↓\"),\n" +
            "\t//描述判定npc: Array(\"守卫\"),\n" +
            "\t//npcdirection: Array(//可去路径{\n" +
            "\t\tname: \"常春岛山庄后花园[3]\",\n" +
            "\t\ttext: \"北：后花园 ↑\"\n" +
            "\t},\n" +
            "\t{\n" +
            "\t\tname: \"常春岛山庄紫门\",\n" +
            "\t\ttext: \"东：紫门 →\"\n" +
            "\t},\n" +
            "\t{\n" +
            "\t\tname: \"常春岛山洞入口\",\n" +
            "\t\ttext: \"南：山洞入口 ↓\"\n" +
            "\t})\n" +
            "},\n" +
            "{\n" +
            "\tname: \"常春岛山洞入口\",\n" +
            "\t//地图名称text: Array(\"一处山洞的入口\",\n" +
            "\t\"北：后花园 ↑\",\n" +
            "\t\"南：山洞 ↓\"),\n" +
            "\t//描述判定npc: Array(\"铁中棠\"),\n" +
            "\t//npcdirection: Array(//可去路径{\n" +
            "\t\tname: \"常春岛山庄后花园[4]\",\n" +
            "\t\ttext: \"北：后花园 ↑\"\n" +
            "\t},\n" +
            "\t{\n" +
            "\t\tname: \"常春岛山庄紫门\",\n" +
            "\t\ttext: \"东：紫门 →\"\n" +
            "\t},\n" +
            "\t{\n" +
            "\t\tname: \"常春岛山洞[1]\",\n" +
            "\t\ttext: \"南：山洞 ↓\"\n" +
            "\t})\n" +
            "},\n" +
            "{\n" +
            "\tname: \"常春岛山洞[1]\",\n" +
            "\t//地图名称text: Array(\"一个黑漆漆的山洞，伸手不见五指\",\n" +
            "\t\"北：山洞 ↑\",\n" +
            "\t\"南：山洞 ↓\"),\n" +
            "\t//描述判定npc: Array(\"守卫\"),\n" +
            "\t//npcdirection: Array(//可去路径{\n" +
            "\t\tname: \"常春岛山洞\",\n" +
            "\t\ttext: \"北：山洞 ↑\"\n" +
            "\t},\n" +
            "\t{\n" +
            "\t\tname: \"常春岛山洞\",\n" +
            "\t\ttext: \"西：山洞 ←\"\n" +
            "\t},\n" +
            "\t{\n" +
            "\t\tname: \"常春岛山洞\",\n" +
            "\t\ttext: \"东：山洞 →\"\n" +
            "\t},\n" +
            "\t{\n" +
            "\t\tname: \"常春岛山洞\",\n" +
            "\t\ttext: \"南：山洞 ↓\"\n" +
            "\t},\n" +
            "\t{\n" +
            "\t\tname: \"返回首页\",\n" +
            "\t\ttext: \"长安客栈\"\n" +
            "\t})\n" +
            "},\n" +
            "{\n" +
            "\tname: \"广州东大街\",\n" +
            "\t//地图名称text: Array(\"东边不时地传来金属撞击声，西边人声嘈杂\",\n" +
            "\t\"西：中央广场\",\n" +
            "\t\"东：广州东门\"),\n" +
            "\t//描述判定npc: Array(\"官兵\"),\n" +
            "\t//npcdirection: Array(//可去路径{\n" +
            "\t\tname: \"广州中央广场\",\n" +
            "\t\ttext: \"西：中央广场 ←\"\n" +
            "\t},\n" +
            "\t{\n" +
            "\t\tname: \"广州东门\",\n" +
            "\t\ttext: \"东：广州东门 →\"\n" +
            "\t},\n" +
            "\t{\n" +
            "\t\tname: \"猪笼前街\",\n" +
            "\t\ttext: \"南：猪笼前街 ↓\"\n" +
            "\t})\n" +
            "},\n" +
            "{\n" +
            "\tname: \"猪笼前街\",\n" +
            "\t//地图名称text: Array(\"这里是条狭窄的巷道，弯弯曲曲但是有很多岔路\",\n" +
            "\t\"西：鳄鱼帮 ←\",\n" +
            "\t\"东：赌场正门 →\"),\n" +
            "\t//描述判定npc: Array(\"阿星\"),\n" +
            "\t//npcdirection: Array(//可去路径{\n" +
            "\t\tname: \"广州东大街\",\n" +
            "\t\ttext: \"北：东大街 ↑\"\n" +
            "\t},\n" +
            "\t{\n" +
            "\t\tname: \"鳄鱼帮\",\n" +
            "\t\ttext: \"西：鳄鱼帮 ←\"\n" +
            "\t},\n" +
            "\t{\n" +
            "\t\tname: \"广州赌场正门\",\n" +
            "\t\ttext: \"东：赌场正门 →\"\n" +
            "\t},\n" +
            "\t{\n" +
            "\t\tname: \"猪笼城寨\",\n" +
            "\t\ttext: \"南：猪笼城寨 ↓\"\n" +
            "\t})\n" +
            "},\n" +
            "{\n" +
            "\tname: \"鳄鱼帮\",\n" +
            "\t//地图名称text: Array(\"这里是一群小混混聚集的地方，黑衣黑裤\",\n" +
            "\t\"东：猪笼前街 →\"),\n" +
            "\t//描述判定npc: Array(\"鳄鱼帮老大\"),\n" +
            "\t//npcdirection: Array(//可去路径{\n" +
            "\t\tname: \"猪笼前街\",\n" +
            "\t\ttext: \"东：猪笼前街 →\"\n" +
            "\t})\n" +
            "},\n" +
            "{\n" +
            "\tname: \"广州赌场正门\",\n" +
            "\t//地图名称text: Array(\"这里是金碧辉煌的赌场正门\",\n" +
            "\t\"西：猪笼前街 ←\"),\n" +
            "\t//描述判定npc: Array(\"师爷\"),\n" +
            "\t//npcdirection: Array(//可去路径{\n" +
            "\t\tname: \"猪笼前街\",\n" +
            "\t\ttext: \"西：猪笼前街 ←\"\n" +
            "\t},\n" +
            "\t{\n" +
            "\t\tname: \"广州赌场\",\n" +
            "\t\ttext: \"东：赌场 →\"\n" +
            "\t})\n" +
            "},\n" +
            "{\n" +
            "\tname: \"广州赌场\",\n" +
            "\t//地图名称text: Array(\"形形色色的人都喜欢到这里来试试运气玩上两把\",\n" +
            "\t\"东：斧头帮大堂 →\"),\n" +
            "\t//描述判定npc: Array(\"二当家\"),\n" +
            "\t//npcdirection: Array(//可去路径{\n" +
            "\t\tname: \"广州赌场正门\",\n" +
            "\t\ttext: \"西：赌场正门 ←\"\n" +
            "\t},\n" +
            "\t{\n" +
            "\t\tname: \"斧头帮大堂\",\n" +
            "\t\ttext: \"东：斧头帮大堂 →\"\n" +
            "\t})\n" +
            "},\n" +
            "{\n" +
            "\tname: \"斧头帮大堂\",\n" +
            "\t//地图名称text: Array(\"这里是斧头帮的聚集地点\",\n" +
            "\t\"西：赌场 ←\"),\n" +
            "\t//描述判定npc: Array(\"大佬琛\"),\n" +
            "\t//npcdirection: Array(//可去路径{\n" +
            "\t\tname: \"广州赌场\",\n" +
            "\t\ttext: \"西：赌场 ←\"\n" +
            "\t})\n" +
            "},\n" +
            "{\n" +
            "\tname: \"猪笼城寨\",\n" +
            "\t//地图名称text: Array(\"这里是一片高高矮矮的拥挤民房\",\n" +
            "\t\"南：猪笼后街 ↓\"),\n" +
            "\t//描述判定npc: Array(\"肥婆四\",\n" +
            "\t\"二叔公\"),\n" +
            "\t//npcdirection: Array(//可去路径{\n" +
            "\t\tname: \"猪笼前街\",\n" +
            "\t\ttext: \"北：猪笼前街 ↑\"\n" +
            "\t},\n" +
            "\t{\n" +
            "\t\tname: \"猪笼后街\",\n" +
            "\t\ttext: \"南：猪笼后街 ↓\"\n" +
            "\t})\n" +
            "},\n" +
            "{\n" +
            "\tname: \"猪笼后街\",\n" +
            "\t//地图名称text: Array(\"这里是猪笼城寨后的一条狭窄巷道\",\n" +
            "\t\"南：神秘小屋 ↓\"),\n" +
            "\t//描述判定npc: Array(\"芳\",\n" +
            "\t\"肥仔聪\",\n" +
            "\t\"苦力强\"),\n" +
            "\t//npcdirection: Array(//可去路径{\n" +
            "\t\tname: \"猪笼城寨\",\n" +
            "\t\ttext: \"北：猪笼城寨 ↑\"\n" +
            "\t},\n" +
            "\t{\n" +
            "\t\tname: \"猪笼神秘小屋\",\n" +
            "\t\ttext: \"南：神秘小屋 ↓\"\n" +
            "\t})\n" +
            "},\n" +
            "{\n" +
            "\tname: \"猪笼神秘小屋\",\n" +
            "\t//地图名称text: Array(\"这是一间又黑又破的小屋子\",\n" +
            "\t\"北：猪笼后街 ↑\"),\n" +
            "\t//描述判定npc: Array(\"火云邪神\"),\n" +
            "\t//npcdirection: Array(//可去路径{\n" +
            "\t\tname: \"猪笼后街\",\n" +
            "\t\ttext: \"北：猪笼后街 ↑\"\n" +
            "\t})\n" +
            "},\n" +
            "{\n" +
            "\tname: \"广州东门\",\n" +
            "\t//地图名称text: Array(\"这是广州东城门\",\n" +
            "\t\"西：东大街 ←\"),\n" +
            "\t//描述判定npc: Array(\"官兵\"),\n" +
            "\t//npcdirection: Array(//可去路径{\n" +
            "\t\tname: \"广州东大街\",\n" +
            "\t\ttext: \"西：东大街 ←\"\n" +
            "\t})\n" +
            "},\n" +
            "{\n" +
            "\tname: \"广州西大街\",\n" +
            "\t//地图名称text: Array(\"行人稀少，静悄悄地很是冷清\",\n" +
            "\t\"西：广州西城门 ←\",\n" +
            "\t\"南：越秀园 ↓\"),\n" +
            "\t//描述判定npc: Array(\"托钵僧\",\n" +
            "\t\"大狼狗\"),\n" +
            "\t//npcdirection: Array(//可去路径{\n" +
            "\t\tname: \"广州西城门\",\n" +
            "\t\ttext: \"西：广州西城门 ←\"\n" +
            "\t},\n" +
            "\t{\n" +
            "\t\tname: \"广州中央广场\",\n" +
            "\t\ttext: \"东：中央广场 →\"\n" +
            "\t},\n" +
            "\t{\n" +
            "\t\tname: \"越秀园\",\n" +
            "\t\ttext: \"南：越秀园 ↓\"\n" +
            "\t})\n" +
            "},\n" +
            "{\n" +
            "\tname: \"越秀园\",\n" +
            "\t//地图名称text: Array(\"你走进越秀园，只见迎面一带翠嶂，挡在北面\",\n" +
            "\t\"北：西大街 ↑\"),\n" +
            "\t//描述判定npc: Array(\"水烟阁红衣武士\",\n" +
            "\t\"水烟阁司事\"),\n" +
            "\t//npcdirection: Array(//可去路径{\n" +
            "\t\tname: \"广州西大街\",\n" +
            "\t\ttext: \"北：西大街 ↑\"\n" +
            "\t})\n" +
            "},\n" +
            "{\n" +
            "\tname: \"广州西城门\",\n" +
            "\t//地图名称text: Array(\"这是西城门，几年前曾经遭到土匪的攻打，因此显得有些破败\",\n" +
            "\t\"东：西大街\"),\n" +
            "\t//描述判定npc: Array(\"官兵\"),\n" +
            "\t//npcdirection: Array(//可去路径{\n" +
            "\t\tname: \"广州西大街\",\n" +
            "\t\ttext: \"东：西大街 →\"\n" +
            "\t})\n" +
            "},\n" +
            "//---------------------------顽强的分割线-----------------------------{\n" +
            "\tname: \"武汉西驿道[1]\",\n" +
            "\t//地图名称text: Array(\"一条驿道静静的向远方延伸\",\n" +
            "\t\"西：驿道\",\n" +
            "\t\"东：武汉\"),\n" +
            "\t//描述判定npc: Array(),\n" +
            "\t//npcdirection: Array(//可去路径{\n" +
            "\t\tname: \"武当山门\",\n" +
            "\t\ttext: \"北：武当山门 ↑\"\n" +
            "\t},\n" +
            "\t{\n" +
            "\t\tname: \"武汉西驿道[2]\",\n" +
            "\t\ttext: \"西：驿道 ←\"\n" +
            "\t},\n" +
            "\t{\n" +
            "\t\tname: \"武汉\",\n" +
            "\t\ttext: \"东：武汉 →\"\n" +
            "\t})\n" +
            "},\n" +
            "{\n" +
            "\tname: \"武汉西驿道[2]\",\n" +
            "\t//地图名称text: Array(\"一条驿道静静的向远方延伸\",\n" +
            "\t\"南：乱石岗\",\n" +
            "\t\"西：驿道\"),\n" +
            "\t//描述判定npc: Array(),\n" +
            "\t//npcdirection: Array(//可去路径{\n" +
            "\t\tname: \"武汉西驿道[3]\",\n" +
            "\t\ttext: \"西：驿道 ←\"\n" +
            "\t},\n" +
            "\t{\n" +
            "\t\tname: \"武汉西驿道[1]\",\n" +
            "\t\ttext: \"东：驿道 →\"\n" +
            "\t},\n" +
            "\t{\n" +
            "\t\tname: \"乱石岗\",\n" +
            "\t\ttext: \"南：乱石岗 ↓\"\n" +
            "\t})\n" +
            "},\n" +
            "{\n" +
            "\tname: \"乱石岗\",\n" +
            "\t//地图名称text: Array(\"一个小山岗，堆满了乱石\",\n" +
            "\t\"北：驿道\"),\n" +
            "\t//描述判定npc: Array(\"东方不败\"),\n" +
            "\t//npcdirection: Array(//可去路径{\n" +
            "\t\tname: \"武汉西驿道[2]\",\n" +
            "\t\ttext: \"北：驿道 ↑\"\n" +
            "\t})\n" +
            "},\n" +
            "{\n" +
            "\tname: \"武汉西驿道[3]\",\n" +
            "\t//地图名称text: Array(\"一条驿道静静的向远方延伸\",\n" +
            "\t\"西：成都东门\",\n" +
            "\t\"东：驿道\"),\n" +
            "\t//描述判定npc: Array(),\n" +
            "\t//npcdirection: Array(//可去路径{\n" +
            "\t\tname: \"成都东门\",\n" +
            "\t\ttext: \"西：成都东门 ←\"\n" +
            "\t},\n" +
            "\t{\n" +
            "\t\tname: \"武汉西驿道[2]\",\n" +
            "\t\ttext: \"东：驿道 →\"\n" +
            "\t})\n" +
            "},\n" +
            "{\n" +
            "\tname: \"成都东门\",\n" +
            "\t//地图名称text: Array(\"这是东城门\",\n" +
            "\t\"官兵们警惕地注视着过往行人，你最好小心为妙\",\n" +
            "\t\"西：东大街\"),\n" +
            "\t//描述判定npc: Array(\"唐圆\"),\n" +
            "\t//npcdirection: Array(//可去路径{\n" +
            "\t\tname: \"成都东大街[1]\",\n" +
            "\t\ttext: \"西：东大街 ←\"\n" +
            "\t},\n" +
            "\t{\n" +
            "\t\tname: \"武汉西驿道[3]\",\n" +
            "\t\ttext: \"东：驿道 →\"\n" +
            "\t})\n" +
            "},\n" +
            "{\n" +
            "\tname: \"成都东大街[1]\",\n" +
            "\t//地图名称text: Array(\"东边是东城门，可以听到守城官兵的吆喝声\",\n" +
            "\t\"北：成都药铺\",\n" +
            "\t\"南：唐记当铺\"),\n" +
            "\t//描述判定npc: Array(\"唐梅\"),\n" +
            "\t//npcdirection: Array(//可去路径{\n" +
            "\t\tname: \"成都药铺\",\n" +
            "\t\ttext: \"北：成都药铺 ↑\"\n" +
            "\t},\n" +
            "\t{\n" +
            "\t\tname: \"成都东大街[2]\",\n" +
            "\t\ttext: \"西：东大街 ←\"\n" +
            "\t},\n" +
            "\t{\n" +
            "\t\tname: \"成都东门\",\n" +
            "\t\ttext: \"东：成都东门 →\"\n" +
            "\t},\n" +
            "\t{\n" +
            "\t\tname: \"唐记当铺\",\n" +
            "\t\ttext: \"南：唐记当铺 ↓\"\n" +
            "\t})\n" +
            "},\n" +
            "{\n" +
            "\tname: \"成都药铺\",\n" +
            "\t//地图名称text: Array(\"这是一家药铺，一股浓浓的药味让你几欲窒息\",\n" +
            "\t\"南：东大街\"),\n" +
            "\t//描述判定npc: Array(\"药铺伙计\"),\n" +
            "\t//npcdirection: Array(//可去路径{\n" +
            "\t\tname: \"成都东大街[1]\",\n" +
            "\t\ttext: \"南：东大街 ↓\"\n" +
            "\t})\n" +
            "},\n" +
            "{\n" +
            "\tname: \"唐记当铺\",\n" +
            "\t//地图名称text: Array(\"这是蜀中最大的一家当铺了\",\n" +
            "\t\"北：东大街\"),\n" +
            "\t//描述判定npc: Array(\"唐冰\"),\n" +
            "\t//npcdirection: Array(//可去路径{\n" +
            "\t\tname: \"成都东大街[1]\",\n" +
            "\t\ttext: \"北：东大街 ↑\"\n" +
            "\t})\n" +
            "},\n" +
            "{\n" +
            "\tname: \"成都东大街[2]\",\n" +
            "\t//地图名称text: Array(\"北：散花楼\",\n" +
            "\t\"西：市中心\",\n" +
            "\t\"南：天府钱庄 ↓\"),\n" +
            "\t//描述判定npc: Array(\"唐梦\"),\n" +
            "\t//npcdirection: Array(//可去路径{\n" +
            "\t\tname: \"散花楼\",\n" +
            "\t\ttext: \"北：散花楼 ↑\"\n" +
            "\t},\n" +
            "\t{\n" +
            "\t\tname: \"成都市中心\",\n" +
            "\t\ttext: \"西：市中心 ←\"\n" +
            "\t},\n" +
            "\t{\n" +
            "\t\tname: \"成都东大街[1]\",\n" +
            "\t\ttext: \"东：东大街 →\"\n" +
            "\t},\n" +
            "\t{\n" +
            "\t\tname: \"天府钱庄\",\n" +
            "\t\ttext: \"南：天府钱庄 ↓\"\n" +
            "\t})\n" +
            "},\n" +
            "{\n" +
            "\tname: \"散花楼\",\n" +
            "\t//地图名称text: Array(\"方圆数百里内提起散花楼可以说是无人不知，无人不晓\",\n" +
            "\t\"西：北大街\",\n" +
            "\t\"南：东大街\"),\n" +
            "\t//描述判定npc: Array(),\n" +
            "\t//npcdirection: Array(//可去路径{\n" +
            "\t\tname: \"成都北大街\",\n" +
            "\t\ttext: \"西：北大街 ←\"\n" +
            "\t},\n" +
            "\t{\n" +
            "\t\tname: \"成都东大街[2]\",\n" +
            "\t\ttext: \"南：东大街 ↓\"\n" +
            "\t})\n" +
            "},\n" +
            "{\n" +
            "\tname: \"天府钱庄\",\n" +
            "\t//地图名称text: Array(\"这是一家老字号的钱庄，已有几百年的历史，在全国各地都有分店\",\n" +
            "\t\"北：东大街\"),\n" +
            "\t//描述判定npc: Array(),\n" +
            "\t//npcdirection: Array(//可去路径{\n" +
            "\t\tname: \"成都东大街[2]\",\n" +
            "\t\ttext: \"北：东大街 ↑\"\n" +
            "\t})\n" +
            "},\n" +
            "{\n" +
            "\tname: \"成都市中心\",\n" +
            "\t//地图名称text: Array(\"这里是成都的正中心，首先入目是数之不尽的花灯\",\n" +
            "\t\"北：北大街\",\n" +
            "\t\"西：西大街\"),\n" +
            "\t//描述判定npc: Array(\"柳莺\"),\n" +
            "\t//npcdirection: Array(//可去路径{\n" +
            "\t\tname: \"成都北大街\",\n" +
            "\t\ttext: \"北：北大街 ↑\"\n" +
            "\t},\n" +
            "\t{\n" +
            "\t\tname: \"成都西大街\",\n" +
            "\t\ttext: \"西：西大街 ←\"\n" +
            "\t},\n" +
            "\t{\n" +
            "\t\tname: \"成都东大街[2]\",\n" +
            "\t\ttext: \"东：东大街 →\"\n" +
            "\t},\n" +
            "\t{\n" +
            "\t\tname: \"成都南大街\",\n" +
            "\t\ttext: \"南：南大街 ↓\"\n" +
            "\t})\n" +
            "},\n" +
            "{\n" +
            "\tname: \"成都北大街\",\n" +
            "\t//地图名称text: Array(\"北：成都北门\",\n" +
            "\t\"西：听雨居\",\n" +
            "\t\"南：市中心 ↓\"),\n" +
            "\t//描述判定npc: Array(),\n" +
            "\t//npcdirection: Array(//可去路径{\n" +
            "\t\tname: \"成都北门\",\n" +
            "\t\ttext: \"北：成都北门 ↑\"\n" +
            "\t},\n" +
            "\t{\n" +
            "\t\tname: \"听雨居\",\n" +
            "\t\ttext: \"西：听雨居 ←\"\n" +
            "\t},\n" +
            "\t{\n" +
            "\t\tname: \"散花楼\",\n" +
            "\t\ttext: \"东：散花楼 →\"\n" +
            "\t},\n" +
            "\t{\n" +
            "\t\tname: \"成都市中心\",\n" +
            "\t\ttext: \"南：市中心 ↓\"\n" +
            "\t})\n" +
            "},\n" +
            "{\n" +
            "\tname: \"听雨居\",\n" +
            "\t//地图名称text: Array(\"这是成都市内最有名气的一家客栈\",\n" +
            "\t\"当年徐子陵入川之时，曾与仙子师妃暄在此相聚\",\n" +
            "\t\"东：北大街\"),\n" +
            "\t//描述判定npc: Array(\"店小二\"),\n" +
            "\t//npcdirection: Array(//可去路径{\n" +
            "\t\tname: \"成都北大街\",\n" +
            "\t\ttext: \"东：北大街 →\"\n" +
            "\t})\n" +
            "},\n" +
            "{\n" +
            "\tname: \"成都北门\",\n" +
            "\t//地图名称text: Array(\"这是北城门\",\n" +
            "\t\"出了城往东北方向走就到了剑门关了\",\n" +
            "\t\"北方是一片崇山峻岭\"),\n" +
            "\t//描述判定npc: Array(\"唐方\"),\n" +
            "\t//npcdirection: Array(//可去路径{\n" +
            "\t\tname: \"成都北驿道[1]\",\n" +
            "\t\ttext: \"北：驿道 ↑\"\n" +
            "\t},\n" +
            "\t{\n" +
            "\t\tname: \"成都北大街\",\n" +
            "\t\ttext: \"南：北大街 ↓\"\n" +
            "\t})\n" +
            "},\n" +
            "{\n" +
            "\tname: \"成都北驿道[1]\",\n" +
            "\t//地图名称text: Array(\"一条驿道静静的向远方延伸\",\n" +
            "\t\"北：山岭 ↑\",\n" +
            "\t\"南：成都北门\"),\n" +
            "\t//描述判定npc: Array(),\n" +
            "\t//npcdirection: Array(//可去路径{\n" +
            "\t\tname: \"长安山岭\",\n" +
            "\t\ttext: \"北：山岭 ↑\"\n" +
            "\t},\n" +
            "\t{\n" +
            "\t\tname: \"成都北门\",\n" +
            "\t\ttext: \"南：成都北门 ↓\"\n" +
            "\t})\n" +
            "},\n" +
            "{\n" +
            "\tname: \"终南山草地\",\n" +
            "\t//地图名称text: Array(\"这里是一片草地，草很深，几乎淹没了小腿\",\n" +
            "\t\"东：墓门\",\n" +
            "\t\"南：终南山脚\"),\n" +
            "\t//描述判定npc: Array(\"玉蜂\"),\n" +
            "\t//npcdirection: Array(//可去路径{\n" +
            "\t\tname: \"终南山墓门\",\n" +
            "\t\ttext: \"东：墓门 →\"\n" +
            "\t},\n" +
            "\t{\n" +
            "\t\tname: \"终南山脚\",\n" +
            "\t\ttext: \"南：终南山脚 ↓\"\n" +
            "\t})\n" +
            "},\n" +
            "{\n" +
            "\tname: \"终南山墓门\",\n" +
            "\t//地图名称text: Array(\"你走过了草地，眼前突兀地耸立着一座大墓\",\n" +
            "\t\"西：草地\"),\n" +
            "\t//描述判定npc: Array(),\n" +
            "\t//npcdirection: Array(//可去路径{\n" +
            "\t\tname: \"终南山草地\",\n" +
            "\t\ttext: \"西：草地 ←\"\n" +
            "\t})\n" +
            "},\n" +
            "{\n" +
            "\tname: \"成都南大街\",\n" +
            "\t//地图名称text: Array(\"南：成都南门\",\n" +
            "\t\"北：市中心 ↑\"),\n" +
            "\t//描述判定npc: Array(\"男花痴段誉\"),\n" +
            "\t//npcdirection: Array(//可去路径{\n" +
            "\t\tname: \"成都市中心\",\n" +
            "\t\ttext: \"北：市中心 ↑\"\n" +
            "\t},\n" +
            "\t{\n" +
            "\t\tname: \"成都南门\",\n" +
            "\t\ttext: \"南：成都南门 ↓\"\n" +
            "\t})\n" +
            "},\n" +
            "{\n" +
            "\tname: \"成都南门\",\n" +
            "\t//地图名称text: Array(\"这是南城门，城门上贴着告示\",\n" +
            "\t\"西：大雪山山路\",\n" +
            "\t\"北：南大街\"),\n" +
            "\t//描述判定npc: Array(\"林忌\"),\n" +
            "\t//npcdirection: Array(//可去路径{\n" +
            "\t\tname: \"成都南大街\",\n" +
            "\t\ttext: \"北：南大街 ↑\"\n" +
            "\t},\n" +
            "\t{\n" +
            "\t\tname: \"大雪山山路\",\n" +
            "\t\ttext: \"西：大雪山山路 ←\"\n" +
            "\t},\n" +
            "\t{\n" +
            "\t\tname: \"成都南驿道[1]\",\n" +
            "\t\ttext: \"南：驿道 ↓\"\n" +
            "\t})\n" +
            "},\n" +
            "{\n" +
            "\tname: \"成都南驿道[1]\",\n" +
            "\t//地图名称text: Array(\"一条驿道静静的向远方延伸，好象永远没有尽头\",\n" +
            "\t\"北：成都南门\",\n" +
            "\t\"南：驿道\"),\n" +
            "\t//描述判定npc: Array(),\n" +
            "\t//npcdirection: Array(//可去路径{\n" +
            "\t\tname: \"成都南门\",\n" +
            "\t\ttext: \"北：成都南门 ↑\"\n" +
            "\t},\n" +
            "\t{\n" +
            "\t\tname: \"成都南驿道[2]\",\n" +
            "\t\ttext: \"南：驿道 ↓\"\n" +
            "\t})\n" +
            "},\n" +
            "{\n" +
            "\tname: \"成都南驿道[2]\",\n" +
            "\t//地图名称text: Array(\"一条驿道静静的向远方延伸，好象永远没有尽头\",\n" +
            "\t\"北：驿道\",\n" +
            "\t\"西：大理东门\",\n" +
            "\t\"东：驿道\"),\n" +
            "\t//描述判定npc: Array(),\n" +
            "\t//npcdirection: Array(//可去路径{\n" +
            "\t\tname: \"成都南驿道[1]\",\n" +
            "\t\ttext: \"北：驿道 ↑\"\n" +
            "\t},\n" +
            "\t{\n" +
            "\t\tname: \"大理东门\",\n" +
            "\t\ttext: \"西：大理东门 ←\"\n" +
            "\t},\n" +
            "\t{\n" +
            "\t\tname: \"广州南驿道[1]\",\n" +
            "\t\ttext: \"东：驿道 →\"\n" +
            "\t})\n" +
            "},\n" +
            "{\n" +
            "\tname: \"成都西大街\",\n" +
            "\t//地图名称text: Array(\"这是一条宽阔的青石板街道，向东西两头延伸\",\n" +
            "\t\"西：成都西门 ←\",\n" +
            "\t\"东：市中心 →\"),\n" +
            "\t//描述判定npc: Array(),\n" +
            "\t//npcdirection: Array(//可去路径{\n" +
            "\t\tname: \"成都西门\",\n" +
            "\t\ttext: \"西：成都西门 ←\"\n" +
            "\t},\n" +
            "\t{\n" +
            "\t\tname: \"成都市中心\",\n" +
            "\t\ttext: \"东：市中心 →\"\n" +
            "\t},\n" +
            "\t{\n" +
            "\t\tname: \"唐门山道\",\n" +
            "\t\ttext: \"南：唐门山道 ↓\"\n" +
            "\t})\n" +
            "},\n" +
            "{\n" +
            "\tname: \"成都西门\",\n" +
            "\t//地图名称text: Array(\"这里是成都的西城门\",\n" +
            "\t\"北：青城山\",\n" +
            "\t\"南：峨嵋山\"),\n" +
            "\t//描述判定npc: Array(\"文虚师太\"),\n" +
            "\t//npcdirection: Array(//可去路径{\n" +
            "\t\tname: \"青城山\",\n" +
            "\t\ttext: \"北：青城山 ↑\"\n" +
            "\t},\n" +
            "\t{\n" +
            "\t\tname: \"成都西驿道[1]\",\n" +
            "\t\ttext: \"西：驿道 ←\"\n" +
            "\t},\n" +
            "\t{\n" +
            "\t\tname: \"成都西大街\",\n" +
            "\t\ttext: \"东：西大街 →\"\n" +
            "\t},\n" +
            "\t{\n" +
            "\t\tname: \"峨嵋山\",\n" +
            "\t\ttext: \"南：峨嵋山 ↓\"\n" +
            "\t})\n" +
            "},\n" +
            "{\n" +
            "\tname: \"成都西驿道[1]\",\n" +
            "\t//地图名称text: Array(\"一条驿道静静的向远方延伸\",\n" +
            "\t\"北：百花谷\",\n" +
            "\t\"东：成都西门\"),\n" +
            "\t//描述判定npc: Array(),\n" +
            "\t//npcdirection: Array(//可去路径{\n" +
            "\t\tname: \"百花谷\",\n" +
            "\t\ttext: \"北：百花谷 ↑\"\n" +
            "\t},\n" +
            "\t{\n" +
            "\t\tname: \"成都西驿道[2]\",\n" +
            "\t\ttext: \"西：驿道 ←\"\n" +
            "\t},\n" +
            "\t{\n" +
            "\t\tname: \"成都西门\",\n" +
            "\t\ttext: \"东：成都西门 →\"\n" +
            "\t})\n" +
            "},\n" +
            "{\n" +
            "\tname: \"百花谷\",\n" +
            "\t//地图名称text: Array(\"一个美丽的山谷，开满了各式各样的花\",\n" +
            "\t\"花香四溢，有如仙境\",\n" +
            "\t\"南：驿道\"),\n" +
            "\t//描述判定npc: Array(\"江枫\",\n" +
            "\t\"金丝雀\",\n" +
            "\t\"圆春\",\n" +
            "\t\"苗郁手\",\n" +
            "\t\"昭仪\"),\n" +
            "\t//npcdirection: Array(//可去路径{\n" +
            "\t\tname: \"成都西驿道[1]\",\n" +
            "\t\ttext: \"南：驿道\"\n" +
            "\t})\n" +
            "},\n" +
            "{\n" +
            "\tname: \"成都西驿道[2]\",\n" +
            "\t//地图名称text: Array(\"一条驿道静静的向远方延伸\",\n" +
            "\t\"西：驿道\",\n" +
            "\t\"东：驿道\"),\n" +
            "\t//描述判定npc: Array(\"陆得财\"),\n" +
            "\t//npcdirection: Array(//可去路径{\n" +
            "\t\tname: \"成都西驿道[3]\",\n" +
            "\t\ttext: \"西：驿道 ←\"\n" +
            "\t},\n" +
            "\t{\n" +
            "\t\tname: \"成都西驿道[1]\",\n" +
            "\t\ttext: \"东：驿道 →\"\n" +
            "\t})\n" +
            "},\n" +
            "{\n" +
            "\tname: \"成都西驿道[3]\",\n" +
            "\t//地图名称text: Array(\"一条驿道静静的向远方延伸\",\n" +
            "\t\"西：驿道\",\n" +
            "\t\"东：驿道\"),\n" +
            "\t//描述判定npc: Array(),\n" +
            "\t//npcdirection: Array(//可去路径{\n" +
            "\t\tname: \"成都西驿道[4]\",\n" +
            "\t\ttext: \"西：驿道 ←\"\n" +
            "\t},\n" +
            "\t{\n" +
            "\t\tname: \"成都西驿道[2]\",\n" +
            "\t\ttext: \"东：驿道 →\"\n" +
            "\t})\n" +
            "},\n" +
            "{\n" +
            "\tname: \"成都西驿道[4]\",\n" +
            "\t//地图名称text: Array(\"一条驿道静静的向远方延伸\",\n" +
            "\t\"西：拉萨\",\n" +
            "\t\"东：驿道\"),\n" +
            "\t//描述判定npc: Array(),\n" +
            "\t//npcdirection: Array(//可去路径{\n" +
            "\t\tname: \"拉萨\",\n" +
            "\t\ttext: \"西：拉萨 ←\"\n" +
            "\t},\n" +
            "\t{\n" +
            "\t\tname: \"成都西驿道[3]\",\n" +
            "\t\ttext: \"东：驿道 →\"\n" +
            "\t})\n" +
            "},\n" +
            "{\n" +
            "\tname: \"拉萨\",\n" +
            "\t//地图名称text: Array(\"青藏高原上的神秘之城\",\n" +
            "\t\"北：戈壁\",\n" +
            "\t\"东：驿道\"),\n" +
            "\t//描述判定npc: Array(\"灵空\",\n" +
            "\t\"卜鹰\"),\n" +
            "\t//npcdirection: Array(//可去路径{\n" +
            "\t\tname: \"戈壁\",\n" +
            "\t\ttext: \"北：戈壁 ↑\"\n" +
            "\t},\n" +
            "\t{\n" +
            "\t\tname: \"成都西驿道[4]\",\n" +
            "\t\ttext: \"东：驿道 →\"\n" +
            "\t})\n" +
            "},\n" +
            "{\n" +
            "\tname: \"戈壁\",\n" +
            "\t//地图名称text: Array(\"眼前是一望无际的戈壁滩\",\n" +
            "\t\"北：昆仑山下\",\n" +
            "\t\"南：拉萨\"),\n" +
            "\t//描述判定npc: Array(),\n" +
            "\t//npcdirection: Array(//可去路径{\n" +
            "\t\tname: \"昆仑山下\",\n" +
            "\t\ttext: \"北：昆仑山下 ↑\"\n" +
            "\t},\n" +
            "\t{\n" +
            "\t\tname: \"拉萨\",\n" +
            "\t\ttext: \"南：拉萨 ↓\"\n" +
            "\t})\n" +
            "},\n" +
            "{\n" +
            "\tname: \"昆仑山下\",\n" +
            "\t//地图名称text: Array(\"这里是千里昆仑的东麓，远望苍天浩浩，白云悠悠\",\n" +
            "\t\"北：明教山门\",\n" +
            "\t\"南：戈壁\"),\n" +
            "\t//描述判定npc: Array(\"大汉\"),\n" +
            "\t//npcdirection: Array(//可去路径{\n" +
            "\t\tname: \"明教山门\",\n" +
            "\t\ttext: \"北：明教山门 ↑\"\n" +
            "\t},\n" +
            "\t{\n" +
            "\t\tname: \"昆仑山小道\",\n" +
            "\t\ttext: \"东：小道 →\"\n" +
            "\t},\n" +
            "\t{\n" +
            "\t\tname: \"戈壁\",\n" +
            "\t\ttext: \"南：戈壁 ↓\"\n" +
            "\t})\n" +
            "},\n" +
            "{\n" +
            "\tname: \"昆仑山小道\",\n" +
            "\t//地图名称text: Array(\"一条蜿蜒的小道\",\n" +
            "\t\"西：昆仑山下 ←\",\n" +
            "\t\"东：山洞 →\"),\n" +
            "\t//描述判定npc: Array(),\n" +
            "\t//npcdirection: Array(//可去路径{\n" +
            "\t\tname: \"昆仑山下\",\n" +
            "\t\ttext: \"西：昆仑山下 ←\"\n" +
            "\t},\n" +
            "\t{\n" +
            "\t\tname: \"昆仑山山洞\",\n" +
            "\t\ttext: \"东：山洞 →\"\n" +
            "\t})\n" +
            "},\n" +
            "{\n" +
            "\tname: \"昆仑山山洞\",\n" +
            "\t//地图名称text: Array(\"一座阴暗的山洞\",\n" +
            "\t\"西：小道 ←\",\n" +
            "\t\"东：（大门紧闭）\"),\n" +
            "\t//描述判定npc: Array(),\n" +
            "\t//npcdirection: Array(//可去路径{\n" +
            "\t\tname: \"昆仑山小道\",\n" +
            "\t\ttext: \"西：小道 ←\"\n" +
            "\t},\n" +
            "\t{\n" +
            "\t\tname: \"（大门紧闭）\",\n" +
            "\t\ttext: \"东：（大门紧闭）\"\n" +
            "\t})\n" +
            "},\n" +
            "{\n" +
            "\tname: \"大理东门\",\n" +
            "\t//地图名称text: Array(\"城门正上方刻着“东门”两个楷书大字\",\n" +
            "\t\"西：大街\",\n" +
            "\t\"东：驿道\"),\n" +
            "\t//描述判定npc: Array(\"神策军士兵\"),\n" +
            "\t//npcdirection: Array(//可去路径{\n" +
            "\t\tname: \"大理东大街\",\n" +
            "\t\ttext: \"西：大街 ←\"\n" +
            "\t},\n" +
            "\t{\n" +
            "\t\tname: \"成都南驿道[2]\",\n" +
            "\t\ttext: \"东：驿道 →\"\n" +
            "\t})\n" +
            "},\n" +
            "{\n" +
            "\tname: \"大理东大街\",\n" +
            "\t//地图名称text: Array(\"北：第二钱庄\",\n" +
            "\t\"西：中心广场\",\n" +
            "\t\"东：大理东门\",\n" +
            "\t\"南：山昆当铺 ↓\"),\n" +
            "\t//描述判定npc: Array(\"游人\"),\n" +
            "\t//npcdirection: Array(//可去路径{\n" +
            "\t\tname: \"第二钱庄\",\n" +
            "\t\ttext: \"北：第二钱庄 ↑\"\n" +
            "\t},\n" +
            "\t{\n" +
            "\t\tname: \"大理中心广场\",\n" +
            "\t\ttext: \"西：中心广场 ←\"\n" +
            "\t},\n" +
            "\t{\n" +
            "\t\tname: \"大理东门\",\n" +
            "\t\ttext: \"东：大理东门 →\"\n" +
            "\t},\n" +
            "\t{\n" +
            "\t\tname: \"山昆当铺\",\n" +
            "\t\ttext: \"南：山昆当铺 ↓\"\n" +
            "\t})\n" +
            "},\n" +
            "{\n" +
            "\tname: \"山昆当铺\",\n" +
            "\t//地图名称text: Array(\"西边有一扇木雕门通往大街\",\n" +
            "\t\"北：大街\"),\n" +
            "\t//描述判定npc: Array(\"山昆\"),\n" +
            "\t//npcdirection: Array(//可去路径{\n" +
            "\t\tname: \"大理东大街\",\n" +
            "\t\ttext: \"北：大街 ↑\"\n" +
            "\t})\n" +
            "},\n" +
            "{\n" +
            "\tname: \"第二钱庄\",\n" +
            "\t//地图名称text: Array(\"一家装饰极为奢华的钱庄\",\n" +
            "\t\"南：大街\"),\n" +
            "\t//描述判定npc: Array(\"贾第二\"),\n" +
            "\t//npcdirection: Array(//可去路径{\n" +
            "\t\tname: \"大理东大街\",\n" +
            "\t\ttext: \"南：大街 ↓\"\n" +
            "\t})\n" +
            "},\n" +
            "{\n" +
            "\tname: \"大理中心广场\",\n" +
            "\t//地图名称text: Array(\"这里是大理城的中心广场\",\n" +
            "\t\"北：大街\",\n" +
            "\t\"西：大街\",\n" +
            "\t\"东：大街\",\n" +
            "\t\"南：大街\"),\n" +
            "\t//描述判定npc: Array(\"辛双清\",\n" +
            "\t\"游人\",\n" +
            "\t\"神策军士兵\"),\n" +
            "\t//npcdirection: Array(//可去路径{\n" +
            "\t\tname: \"大理北大街\",\n" +
            "\t\ttext: \"北：大街 ↑\"\n" +
            "\t},\n" +
            "\t{\n" +
            "\t\tname: \"大理西大街\",\n" +
            "\t\ttext: \"西：大街 ←\"\n" +
            "\t},\n" +
            "\t{\n" +
            "\t\tname: \"大理东大街\",\n" +
            "\t\ttext: \"东：大街 →\"\n" +
            "\t},\n" +
            "\t{\n" +
            "\t\tname: \"大理南大街\",\n" +
            "\t\ttext: \"南：大街 ↓\"\n" +
            "\t})\n" +
            "},\n" +
            "{\n" +
            "\tname: \"大理北大街\",\n" +
            "\t//地图名称text: Array(\"熙熙攘攘的大街上\",\n" +
            "\t\"人来人往\",\n" +
            "\t\"十分热闹\"),\n" +
            "\t//描述判定npc: Array(\"辛双清\",\n" +
            "\t\"游人\",\n" +
            "\t\"神策军士兵\"),\n" +
            "\t//npcdirection: Array(//可去路径{\n" +
            "\t\tname: \"大理北门\",\n" +
            "\t\ttext: \"北：大理北门 ↑\"\n" +
            "\t},\n" +
            "\t{\n" +
            "\t\tname: \"玉虚道观\",\n" +
            "\t\ttext: \"西：玉虚道观 ←\"\n" +
            "\t},\n" +
            "\t{\n" +
            "\t\tname: \"大理中心广场\",\n" +
            "\t\ttext: \"南：中心广场 ↓\"\n" +
            "\t})\n" +
            "},\n" +
            "{\n" +
            "\tname: \"大理北门\",\n" +
            "\t//地图名称text: Array(\"城门正上方刻着“北门”两个楷书大字\",\n" +
            "\t\"大理北门\",\n" +
            "\t\"南：大街\"),\n" +
            "\t//描述判定npc: Array(\"神策军士兵\"),\n" +
            "\t//npcdirection: Array(//可去路径{\n" +
            "\t\tname: \"神教圣地\",\n" +
            "\t\ttext: \"北：神教圣地 ↑\"\n" +
            "\t},\n" +
            "\t{\n" +
            "\t\tname: \"大理北大街\",\n" +
            "\t\ttext: \"南：大街 ↓\"\n" +
            "\t})\n" +
            "},\n" +
            "{\n" +
            "\tname: \"玉虚道观\",\n" +
            "\t//地图名称text: Array(\"绿柳从中一处道观，典雅清幽\",\n" +
            "\t\"东：大街\"),\n" +
            "\t//描述判定npc: Array(\"刀白凤\"),\n" +
            "\t//npcdirection: Array(//可去路径{\n" +
            "\t\tname: \"大理北大街\",\n" +
            "\t\ttext: \"东：大街 →\"\n" +
            "\t})\n" +
            "},\n" +
            "{\n" +
            "\tname: \"大理南大街\",\n" +
            "\t//地图名称text: Array(\"熙熙攘攘的大街上，人来人往，十分热闹\"),\n" +
            "\t//描述判定npc: Array(\"左子穆\"),\n" +
            "\t//npcdirection: Array(//可去路径{\n" +
            "\t\tname: \"大理中心广场\",\n" +
            "\t\ttext: \"北：中心广场 ↑\"\n" +
            "\t},\n" +
            "\t{\n" +
            "\t\tname: \"镇南王府\",\n" +
            "\t\ttext: \"西：镇南王府 ←\"\n" +
            "\t},\n" +
            "\t{\n" +
            "\t\tname: \"大理议事厅\",\n" +
            "\t\ttext: \"东：议事厅 →\"\n" +
            "\t},\n" +
            "\t{\n" +
            "\t\tname: \"大理南门\",\n" +
            "\t\ttext: \"南：大理南门 ↓\"\n" +
            "\t})\n" +
            "},\n" +
            "{\n" +
            "\tname: \"大理南门\",\n" +
            "\t//地图名称text: Array(\"这是南城门，城门正上方刻着“南门”两个楷书大字\",\n" +
            "\t\"大理南门\",\n" +
            "\t\"北：大街\"),\n" +
            "\t//描述判定npc: Array(\"神策军士兵\"),\n" +
            "\t//npcdirection: Array(//可去路径{\n" +
            "\t\tname: \"大理南大街\",\n" +
            "\t\ttext: \"北：大街 ↑\"\n" +
            "\t})\n" +
            "},\n" +
            "{\n" +
            "\tname: \"镇南王府\",\n" +
            "\t//地图名称text: Array(\"豪门大宅，气势不凡\",\n" +
            "\t\"西：大堂 ←\",\n" +
            "\t\"东：大街 →\"),\n" +
            "\t//描述判定npc: Array(\"神策军士兵\"),\n" +
            "\t//npcdirection: Array(//可去路径{\n" +
            "\t\tname: \"大理大堂\",\n" +
            "\t\ttext: \"西：大堂 ←\"\n" +
            "\t},\n" +
            "\t{\n" +
            "\t\tname: \"大理南大街\",\n" +
            "\t\ttext: \"东：大街 →\"\n" +
            "\t})\n" +
            "},\n" +
            "{\n" +
            "\tname: \"大理大堂\",\n" +
            "\t//地图名称text: Array(\"王府大堂，会客之所\",\n" +
            "\t\"西：书房\",\n" +
            "\t\"东：镇南王府\",\n" +
            "\t\"南：暖阁\"),\n" +
            "\t//描述判定npc: Array(\"傅思归\",\n" +
            "\t\"朱丹臣\"),\n" +
            "\t//npcdirection: Array(//可去路径{\n" +
            "\t\tname: \"大理书房\",\n" +
            "\t\ttext: \"西：书房 ←\"\n" +
            "\t},\n" +
            "\t{\n" +
            "\t\tname: \"镇南王府\",\n" +
            "\t\ttext: \"东：镇南王府 →\"\n" +
            "\t},\n" +
            "\t{\n" +
            "\t\tname: \"大理暖阁\",\n" +
            "\t\ttext: \"南：暖阁 ↓\"\n" +
            "\t})\n" +
            "},\n" +
            "{\n" +
            "\tname: \"大理书房\",\n" +
            "\t//地图名称text: Array(\"一间书房，四周摆满图书字画，墨香浓郁\",\n" +
            "\t\"东：大堂\"),\n" +
            "\t//描述判定npc: Array(\"古笃诚\",\n" +
            "\t\"褚万里\",\n" +
            "\t\"霍先生\"),\n" +
            "\t//npcdirection: Array(//可去路径{\n" +
            "\t\tname: \"大理大堂\",\n" +
            "\t\ttext: \"东：大堂 →\"\n" +
            "\t})\n" +
            "},\n" +
            "{\n" +
            "\tname: \"大理暖阁\",\n" +
            "\t//地图名称text: Array(\"十分暖和的房间\",\n" +
            "\t\"北：大堂 ↑\"),\n" +
            "\t//描述判定npc: Array(\"段正淳\"),\n" +
            "\t//npcdirection: Array(//可去路径{\n" +
            "\t\tname: \"大理大堂\",\n" +
            "\t\ttext: \"北：大堂 ↑\"\n" +
            "\t})\n" +
            "},\n" +
            "{\n" +
            "\tname: \"大理议事厅\",\n" +
            "\t//地图名称text: Array(\"这里是官员们议事的地方\",\n" +
            "\t\"西：大街\",\n" +
            "\t\"东：明德殿\"),\n" +
            "\t//描述判定npc: Array(\"巴天石\",\n" +
            "\t\"高升泰\"),\n" +
            "\t//npcdirection: Array(//可去路径{\n" +
            "\t\tname: \"大理南大街\",\n" +
            "\t\ttext: \"西：大街 ←\"\n" +
            "\t},\n" +
            "\t{\n" +
            "\t\tname: \"大理明德殿\",\n" +
            "\t\ttext: \"东：明德殿 →\"\n" +
            "\t})\n" +
            "},\n" +
            "{\n" +
            "\tname: \"大理明德殿\",\n" +
            "\t//地图名称text: Array(\"这里大理皇帝接见群臣和举行重大活动的地方\",\n" +
            "\t\"北：圣慈宫\",\n" +
            "\t\"西：议事厅\",\n" +
            "\t\"东：内书房\"),\n" +
            "\t//描述判定npc: Array(\"华赫艮\"),\n" +
            "\t//npcdirection: Array(//可去路径{\n" +
            "\t\tname: \"大理圣慈宫\",\n" +
            "\t\ttext: \"北：圣慈宫 ↑\"\n" +
            "\t},\n" +
            "\t{\n" +
            "\t\tname: \"大理议事厅\",\n" +
            "\t\ttext: \"西：议事厅 ←\"\n" +
            "\t},\n" +
            "\t{\n" +
            "\t\tname: \"大理内书房\",\n" +
            "\t\ttext: \"东：内书房 →\"\n" +
            "\t})\n" +
            "},\n" +
            "{\n" +
            "\tname: \"大理圣慈宫\",\n" +
            "\t//地图名称text: Array(\"大理皇宫，保定帝居所\",\n" +
            "\t\"南：明德殿\"),\n" +
            "\t//描述判定npc: Array(\"段正明\"),\n" +
            "\t//npcdirection: Array(//可去路径{\n" +
            "\t\tname: \"大理明德殿\",\n" +
            "\t\ttext: \"南：明德殿 ↓\"\n" +
            "\t})\n" +
            "},\n" +
            "{\n" +
            "\tname: \"大理内书房\",\n" +
            "\t//地图名称text: Array(\"皇宫内书房，是皇帝读书和批阅奏章的地方\",\n" +
            "\t\"西：明德殿\"),\n" +
            "\t//描述判定npc: Array(\"范骅\"),\n" +
            "\t//npcdirection: Array(//可去路径{\n" +
            "\t\tname: \"大理明德殿\",\n" +
            "\t\ttext: \"西：明德殿 ←\"\n" +
            "\t})\n" +
            "},\n" +
            "{\n" +
            "\tname: \"大理西大街\",\n" +
            "\t//地图名称text: Array(\"熙熙攘攘的大街上\",\n" +
            "\t\"北：铁匠铺\",\n" +
            "\t\"南：药铺\"),\n" +
            "\t//描述判定npc: Array(\"马五德\",\n" +
            "\t\"游人\"),\n" +
            "\t//npcdirection: Array(//可去路径{\n" +
            "\t\tname: \"大理铁匠铺\",\n" +
            "\t\ttext: \"北：铁匠铺 ↑\"\n" +
            "\t},\n" +
            "\t{\n" +
            "\t\tname: \"大理西门\",\n" +
            "\t\ttext: \"西：大理西门 ←\"\n" +
            "\t},\n" +
            "\t{\n" +
            "\t\tname: \"大理中心广场\",\n" +
            "\t\ttext: \"东：中心广场 →\"\n" +
            "\t},\n" +
            "\t{\n" +
            "\t\tname: \"大理药铺\",\n" +
            "\t\ttext: \"南：药铺 ↓\"\n" +
            "\t})\n" +
            "},\n" +
            "{\n" +
            "\tname: \"大理药铺\",\n" +
            "\t//地图名称text: Array(\"这是一家药铺，一股浓浓的药味让你几欲窒息\",\n" +
            "\t\"北：大街\"),\n" +
            "\t//描述判定npc: Array(\"古力\"),\n" +
            "\t//npcdirection: Array(//可去路径{\n" +
            "\t\tname: \"大理西大街\",\n" +
            "\t\ttext: \"北：大街 ↑\"\n" +
            "\t})\n" +
            "},\n" +
            "{\n" +
            "\tname: \"大理铁匠铺\",\n" +
            "\t//地图名称text: Array(\"这是一间甚是简陋的铁匠铺\",\n" +
            "\t\"南：大街\"),\n" +
            "\t//描述判定npc: Array(\"古力\"),\n" +
            "\t//npcdirection: Array(//可去路径{\n" +
            "\t\tname: \"大理西大街\",\n" +
            "\t\ttext: \"南：大街 ↓\"\n" +
            "\t})\n" +
            "},\n" +
            "{\n" +
            "\tname: \"大理西门\",\n" +
            "\t//地图名称text: Array(\"这是西城门\",\n" +
            "\t\"西：驿道\",\n" +
            "\t\"东：大街 →\"),\n" +
            "\t//描述判定npc: Array(\"神策军士兵\"),\n" +
            "\t//npcdirection: Array(//可去路径{\n" +
            "\t\tname: \"大理西驿道[1]\",\n" +
            "\t\ttext: \"西：驿道 ←\"\n" +
            "\t},\n" +
            "\t{\n" +
            "\t\tname: \"大理西大街\",\n" +
            "\t\ttext: \"东：大街 →\"\n" +
            "\t})\n" +
            "},\n" +
            "{\n" +
            "\tname: \"大理西驿道[1]\",\n" +
            "\t//地图名称text: Array(\"一条驿道静静的向远方延伸\",\n" +
            "\t\"西：驿道\",\n" +
            "\t\"东：大理西门\"),\n" +
            "\t//描述判定npc: Array(\"行人\"),\n" +
            "\t//npcdirection: Array(//可去路径{\n" +
            "\t\tname: \"大理西驿道[2]\",\n" +
            "\t\ttext: \"西：驿道 ←\"\n" +
            "\t},\n" +
            "\t{\n" +
            "\t\tname: \"大理西门\",\n" +
            "\t\ttext: \"东：大理西门 →\"\n" +
            "\t})\n" +
            "},\n" +
            "{\n" +
            "\tname: \"大理西驿道[2]\",\n" +
            "\t//地图名称text: Array(\"一条驿道静静的向远方延伸\",\n" +
            "\t\"北：善人渡\",\n" +
            "\t\"南：小路\"),\n" +
            "\t//描述判定npc: Array(\"行人\"),\n" +
            "\t//npcdirection: Array(//可去路径{\n" +
            "\t\tname: \"善人渡\",\n" +
            "\t\ttext: \"北：善人渡 ↑\"\n" +
            "\t},\n" +
            "\t{\n" +
            "\t\tname: \"大理西驿道[3]\",\n" +
            "\t\ttext: \"西：驿道 ←\"\n" +
            "\t},\n" +
            "\t{\n" +
            "\t\tname: \"大理西驿道[1]\",\n" +
            "\t\ttext: \"东：驿道 →\"\n" +
            "\t},\n" +
            "\t{\n" +
            "\t\tname: \"大理小路\",\n" +
            "\t\ttext: \"南：小路 ↓\"\n" +
            "\t})\n" +
            "},\n" +
            "{\n" +
            "\tname: \"大理小路\",\n" +
            "\t//地图名称text: Array(\"一条小路，蜿蜒崎岖，不知通往何处\",\n" +
            "\t\"北：驿道\",\n" +
            "\t\"南：幽谷\"),\n" +
            "\t//描述判定npc: Array(\"行人\"),\n" +
            "\t//npcdirection: Array(//可去路径{\n" +
            "\t\tname: \"大理西驿道[2]\",\n" +
            "\t\ttext: \"北：驿道 ↑\"\n" +
            "\t},\n" +
            "\t{\n" +
            "\t\tname: \"大理幽谷\",\n" +
            "\t\ttext: \"南：幽谷 ↓\"\n" +
            "\t})\n" +
            "},\n" +
            "{\n" +
            "\tname: \"大理幽谷\",\n" +
            "\t//地图名称text: Array(\"清幽的小谷，是个隐居的好地方\",\n" +
            "\t\"北：小路\"),\n" +
            "\t//描述判定npc: Array(\"秦红棉\",\n" +
            "\t\"木婉清\"),\n" +
            "\t//npcdirection: Array(//可去路径{\n" +
            "\t\tname: \"大理小路\",\n" +
            "\t\ttext: \"北：小路 ↑\"\n" +
            "\t})\n" +
            "},\n" +
            "{\n" +
            "\tname: \"大理西驿道[3]\",\n" +
            "\t//地图名称text: Array(\"一条驿道静静的向远方延伸\",\n" +
            "\t\"西：天龙寺 ←\",\n" +
            "\t\"东：驿道 →\"),\n" +
            "\t//描述判定npc: Array(\"行人\"),\n" +
            "\t//npcdirection: Array(//可去路径{\n" +
            "\t\tname: \"天龙寺\",\n" +
            "\t\ttext: \"西：天龙寺 ←\"\n" +
            "\t},\n" +
            "\t{\n" +
            "\t\tname: \"大理西驿道[2]\",\n" +
            "\t\ttext: \"东：驿道 →\"\n" +
            "\t})\n" +
            "},\n" +
            "{\n" +
            "\tname: \"天龙寺\",\n" +
            "\t//地图名称text: Array(\"大理皇室的家庙，寺有三阁\",\n" +
            "\t\"西：幌天门\",\n" +
            "\t\"东：驿道\",\n" +
            "\t\"南：佛堂\"),\n" +
            "\t//描述判定npc: Array(\"天龙僧人\"),\n" +
            "\t//npcdirection: Array(//可去路径{\n" +
            "\t\tname: \"幌天门\",\n" +
            "\t\ttext: \"西：幌天门 ←\"\n" +
            "\t},\n" +
            "\t{\n" +
            "\t\tname: \"大理西驿道[3]\",\n" +
            "\t\ttext: \"东：驿道 →\"\n" +
            "\t},\n" +
            "\t{\n" +
            "\t\tname: \"天龙寺佛堂\",\n" +
            "\t\ttext: \"南：佛堂 ↓\"\n" +
            "\t})\n" +
            "},\n" +
            "{\n" +
            "\tname: \"天龙寺佛堂\",\n" +
            "\t//地图名称text: Array(\"古朴的佛堂，由松木搭建而成\",\n" +
            "\t\"北：天龙寺\"),\n" +
            "\t//描述判定npc: Array(\"枯荣长老\"),\n" +
            "\t//npcdirection: Array(//可去路径{\n" +
            "\t\tname: \"天龙寺\",\n" +
            "\t\ttext: \"北：天龙寺 ↑\"\n" +
            "\t})\n" +
            "},\n" +
            "{\n" +
            "\tname: \"幌天门\",\n" +
            "\t//地图名称text: Array(\"进入寺院深处的大门，有僧兵把守\",\n" +
            "\t\"西：清都瑶台\",\n" +
            "\t\"东：天龙寺\"),\n" +
            "\t//描述判定npc: Array(\"天龙僧兵\"),\n" +
            "\t//npcdirection: Array(//可去路径{\n" +
            "\t\tname: \"清都瑶台\",\n" +
            "\t\ttext: \"西：清都瑶台 ←\"\n" +
            "\t},\n" +
            "\t{\n" +
            "\t\tname: \"天龙寺\",\n" +
            "\t\ttext: \"东：天龙寺 →\"\n" +
            "\t})\n" +
            "},\n" +
            "{\n" +
            "\tname: \"清都瑶台\",\n" +
            "\t//地图名称text: Array(\"和尚们做法事的地方\",\n" +
            "\t\"北：般若台\",\n" +
            "\t\"西：三元宫\",\n" +
            "\t\"东：幌天门\",\n" +
            "\t\"南：雨花院\"),\n" +
            "\t//描述判定npc: Array(\"天龙僧人\",\n" +
            "\t\"本相大师\"),\n" +
            "\t//npcdirection: Array(//可去路径{\n" +
            "\t\tname: \"般若台\",\n" +
            "\t\ttext: \"北：般若台 ↑\"\n" +
            "\t},\n" +
            "\t{\n" +
            "\t\tname: \"三元宫\",\n" +
            "\t\ttext: \"西：三元宫 ←\"\n" +
            "\t},\n" +
            "\t{\n" +
            "\t\tname: \"幌天门\",\n" +
            "\t\ttext: \"东：幌天门 →\"\n" +
            "\t},\n" +
            "\t{\n" +
            "\t\tname: \"雨花院\",\n" +
            "\t\ttext: \"南：雨花院 ↓\"\n" +
            "\t})\n" +
            "},\n" +
            "{\n" +
            "\tname: \"般若台\",\n" +
            "\t//地图名称text: Array(\"僧人习武之处\",\n" +
            "\t\"南：清都瑶台 ↓\"),\n" +
            "\t//描述判定npc: Array(\"天龙僧兵\"),\n" +
            "\t//npcdirection: Array(//可去路径{\n" +
            "\t\tname: \"清都瑶台\",\n" +
            "\t\ttext: \"南：清都瑶台 ↓\"\n" +
            "\t})\n" +
            "},\n" +
            "{\n" +
            "\tname: \"雨花院\",\n" +
            "\t//地图名称text: Array(\"清幽的小院，僧人们均在此读书诵经\",\n" +
            "\t\"北：清都瑶台\"),\n" +
            "\t//描述判定npc: Array(\"天龙僧人\"),\n" +
            "\t//npcdirection: Array(//可去路径{\n" +
            "\t\tname: \"清都瑶台\",\n" +
            "\t\ttext: \"北：清都瑶台 ↑\"\n" +
            "\t})\n" +
            "},\n" +
            "{\n" +
            "\tname: \"三元宫\",\n" +
            "\t//地图名称text: Array(\"雄伟壮丽的宫殿，四周金碧辉煌\",\n" +
            "\t\"西：长廊\",\n" +
            "\t\"东：清都瑶台\"),\n" +
            "\t//描述判定npc: Array(\"天龙僧人\",\n" +
            "\t\"本观大师\"),\n" +
            "\t//npcdirection: Array(//可去路径{\n" +
            "\t\tname: \"天龙寺长廊\",\n" +
            "\t\ttext: \"西：长廊 ←\"\n" +
            "\t},\n" +
            "\t{\n" +
            "\t\tname: \"清都瑶台\",\n" +
            "\t\ttext: \"东：清都瑶台 →\"\n" +
            "\t})\n" +
            "},\n" +
            "{\n" +
            "\tname: \"天龙寺长廊\",\n" +
            "\t//地图名称text: Array(\"静静的长廊，通往寺院深处\",\n" +
            "\t\"西：牟尼堂\",\n" +
            "\t\"东：三元宫\"),\n" +
            "\t//描述判定npc: Array(\"天龙僧人\"),\n" +
            "\t//npcdirection: Array(//可去路径{\n" +
            "\t\tname: \"牟尼堂\",\n" +
            "\t\ttext: \"西：牟尼堂 ←\"\n" +
            "\t},\n" +
            "\t{\n" +
            "\t\tname: \"三元宫\",\n" +
            "\t\ttext: \"东：三元宫 →\"\n" +
            "\t})\n" +
            "},\n" +
            "{\n" +
            "\tname: \"牟尼堂\",\n" +
            "\t//地图名称text: Array(\"长老们静休之所\",\n" +
            "\t\"东：长廊 →\"),\n" +
            "\t//描述判定npc: Array(\"本因大师\",\n" +
            "\t\"本参大师\",\n" +
            "\t\"枯荣长老\"),\n" +
            "\t//npcdirection: Array(//可去路径{\n" +
            "\t\tname: \"天龙寺长廊\",\n" +
            "\t\ttext: \"东：长廊 →\"\n" +
            "\t})\n" +
            "},\n" +
            "{\n" +
            "\tname: \"善人渡\",\n" +
            "\t//地图名称text: Array(\"江边渡口，南北山路崎岖，峭壁耸立\",\n" +
            "\t\"北：铁索桥\",\n" +
            "\t\"南：驿道\"),\n" +
            "\t//描述判定npc: Array(\"云中鹤\"),\n" +
            "\t//npcdirection: Array(//可去路径{\n" +
            "\t\tname: \"铁索桥\",\n" +
            "\t\ttext: \"北：铁索桥 ↑\"\n" +
            "\t},\n" +
            "\t{\n" +
            "\t\tname: \"大理西驿道[2]\",\n" +
            "\t\ttext: \"南：驿道 ↓\"\n" +
            "\t})\n" +
            "},\n" +
            "{\n" +
            "\tname: \"铁索桥\",\n" +
            "\t//地图名称text: Array(\"铁索木板桥，踩上去咯吱咯吱直响\",\n" +
            "\t\"北：万劫谷\",\n" +
            "\t\"南：善人渡\"),\n" +
            "\t//描述判定npc: Array(\"南海鳄神\"),\n" +
            "\t//npcdirection: Array(//可去路径{\n" +
            "\t\tname: \"万劫谷\",\n" +
            "\t\ttext: \"北：万劫谷 ↑\"\n" +
            "\t},\n" +
            "\t{\n" +
            "\t\tname: \"善人渡\",\n" +
            "\t\ttext: \"南：善人渡 ↓\"\n" +
            "\t})\n" +
            "},\n" +
            "{\n" +
            "\tname: \"万劫谷\",\n" +
            "\t//地图名称text: Array(\"深山小谷，谷口一棵大树上写着\",\n" +
            "\t\"西：石屋\",\n" +
            "\t\"南：铁索桥\"),\n" +
            "\t//描述判定npc: Array(\"钟万仇\"),\n" +
            "\t//npcdirection: Array(//可去路径{\n" +
            "\t\tname: \"万劫谷石屋\",\n" +
            "\t\ttext: \"西：石屋 ←\"\n" +
            "\t},\n" +
            "\t{\n" +
            "\t\tname: \"铁索桥\",\n" +
            "\t\ttext: \"南：铁索桥 ↓\"\n" +
            "\t})\n" +
            "},\n" +
            "{\n" +
            "\tname: \"万劫谷石屋\",\n" +
            "\t//地图名称text: Array(\"简陋的石屋，空无一物\",\n" +
            "\t\"东：万劫谷\"),\n" +
            "\t//描述判定npc: Array(\"黄眉和尚\",\n" +
            "\t\"段延庆\",\n" +
            "\t\"叶二娘\"),\n" +
            "\t//npcdirection: Array(//可去路径{\n" +
            "\t\tname: \"万劫谷\",\n" +
            "\t\ttext: \"东：万劫谷 →\"\n" +
            "\t})\n" +
            "},\n" +
            "{\n" +
            "\tname: \"时间之门\",\n" +
            "\t//地图名称text: Array(\"这里静悄悄的\",\n" +
            "\t\"传说时间会在这里扭曲\",\n" +
            "\t\"西：朱雀南街\"),\n" +
            "\t//描述判定npc: Array(\"宫城守卫\"),\n" +
            "\t//npcdirection: Array(//可去路径{\n" +
            "\t\tname: \"朱雀南街\",\n" +
            "\t\ttext: \"西：朱雀南街 ←\"\n" +
            "\t},\n" +
            "\t{\n" +
            "\t\tname: \"隧道[1]\",\n" +
            "\t\ttext: \"东：隧道 →\"\n" +
            "\t})\n" +
            "},\n" +
            "{\n" +
            "\tname: \"隧道[1]\",\n" +
            "\t//地图名称text: Array(\"一条黑漆漆的隧道\",\n" +
            "\t\"西：时间之门\",\n" +
            "\t\"东：隧道 →\"),\n" +
            "\t//描述判定npc: Array(),\n" +
            "\t//npcdirection: Array(//可去路径{\n" +
            "\t\tname: \"时间之门\",\n" +
            "\t\ttext: \"西：时间之门 ←\"\n" +
            "\t},\n" +
            "\t{\n" +
            "\t\tname: \"隧道[2]\",\n" +
            "\t\ttext: \"东：隧道 →\"\n" +
            "\t})\n" +
            "},\n" +
            "{\n" +
            "\tname: \"隧道[2]\",\n" +
            "\t//地图名称text: Array(\"一条黑漆漆的隧道\",\n" +
            "\t\"西：隧道\",\n" +
            "\t\"南：宫城 ↓\"),\n" +
            "\t//描述判定npc: Array(),\n" +
            "\t//npcdirection: Array(//可去路径{\n" +
            "\t\tname: \"隧道[1]\",\n" +
            "\t\ttext: \"西：隧道 ←\"\n" +
            "\t},\n" +
            "\t{\n" +
            "\t\tname: \"宫城\",\n" +
            "\t\ttext: \"南：宫城 ↓\"\n" +
            "\t})\n" +
            "},\n" +
            "{\n" +
            "\tname: \"宫城\",\n" +
            "\t//地图名称text: Array(\"一座雄伟的宫城\",\n" +
            "\t\"北：隧道\",\n" +
            "\t\"南：后宫 ↓\"),\n" +
            "\t//描述判定npc: Array(\"殷隼\",\n" +
            "\t\"厉帝\",\n" +
            "\t\"殷太常\",\n" +
            "\t\"青女\",\n" +
            "\t\"内侍监\",\n" +
            "\t\"无鸾\"),\n" +
            "\t//npcdirection: Array(//可去路径{\n" +
            "\t\tname: \"隧道[2]\",\n" +
            "\t\ttext: \"北：隧道 ↑\"\n" +
            "\t},\n" +
            "\t{\n" +
            "\t\tname: \"后宫\",\n" +
            "\t\ttext: \"南：后宫 ↓\"\n" +
            "\t})\n" +
            "},\n" +
            "{\n" +
            "\tname: \"后宫\",\n" +
            "\t//地图名称text: Array(\"绮丽的后宫\",\n" +
            "\t\"花团锦簇\",\n" +
            "\t\"北：宫城 ↑\"),\n" +
            "\t//描述判定npc: Array(\"凌儿\",\n" +
            "\t\"婉后\"),\n" +
            "\t//npcdirection: Array(//可去路径{\n" +
            "\t\tname: \"宫城\",\n" +
            "\t\ttext: \"北：宫城 ↑\"\n" +
            "\t})\n" +
            "},\n" +
            "{\n" +
            "\tname: \"朱雀门\",\n" +
            "\t//地图名称text: Array(\"这是长安城的南城门\"),\n" +
            "\t//描述判定npc: Array(\"守城武将\",\n" +
            "\t\"守城小兵\"),\n" +
            "\t//npcdirection: Array(//可去路径{\n" +
            "\t\tname: \"朱雀南街\",\n" +
            "\t\ttext: \"北：朱雀南街 ↑\"\n" +
            "\t},\n" +
            "\t{\n" +
            "\t\tname: \"长安南驿道[1]\",\n" +
            "\t\ttext: \"南：驿道 ↓\"\n" +
            "\t})\n" +
            "},\n" +
            "{\n" +
            "\tname: \"长安南驿道[1]\",\n" +
            "\t//地图名称text: Array(\"北：朱雀门\",\n" +
            "\t\"南：秦岭 ↓\"),\n" +
            "\t//描述判定npc: Array(\"白狼\",\n" +
            "\t\"崔镖头\",\n" +
            "\t\"白二\",\n" +
            "\t\"乌老大\"),\n" +
            "\t//npcdirection: Array(//可去路径{\n" +
            "\t\tname: \"朱雀门\",\n" +
            "\t\ttext: \"北：朱雀门 ↑\"\n" +
            "\t},\n" +
            "\t{\n" +
            "\t\tname: \"长安西荒野\",\n" +
            "\t\ttext: \"西：荒野 ←\"\n" +
            "\t},\n" +
            "\t{\n" +
            "\t\tname: \"长安东荒野\",\n" +
            "\t\ttext: \"东：荒野 →\"\n" +
            "\t},\n" +
            "\t{\n" +
            "\t\tname: \"秦岭\",\n" +
            "\t\ttext: \"南：秦岭 ↓\"\n" +
            "\t})\n" +
            "},\n" +
            "{\n" +
            "\tname: \"长安西荒野\",\n" +
            "\t//地图名称text: Array(\"这是长安城南门外的荒野\",\n" +
            "\t\"东：驿道 →\"),\n" +
            "\t//描述判定npc: Array(\"土匪\",\n" +
            "\t\"小猴\",\n" +
            "\t\"游坦之\",\n" +
            "\t\"土匪头\"),\n" +
            "\t//npcdirection: Array(//可去路径{\n" +
            "\t\tname: \"长安南驿道[1]\",\n" +
            "\t\ttext: \"东：驿道 →\"\n" +
            "\t})\n" +
            "},\n" +
            "{\n" +
            "\tname: \"长安东荒野\",\n" +
            "\t//地图名称text: Array(\"这是长安城南门外的荒野\",\n" +
            "\t\"西：驿道\"),\n" +
            "\t//描述判定npc: Array(\"土匪\",\n" +
            "\t\"土匪头\",\n" +
            "\t\"野兔\",\n" +
            "\t\"茅十八\"),\n" +
            "\t//npcdirection: Array(//可去路径{\n" +
            "\t\tname: \"长安南驿道[1]\",\n" +
            "\t\ttext: \"西：驿道 ←\"\n" +
            "\t})\n" +
            "},\n" +
            "{\n" +
            "\tname: \"秦岭\",\n" +
            "\t//地图名称text: Array(\"这里是有名的秦岭\",\n" +
            "\t\"崇山峻岭不断\"),\n" +
            "\t//描述判定npc: Array(\"老汉\",\n" +
            "\t\"土匪\",\n" +
            "\t\"白狼\"),\n" +
            "\t//npcdirection: Array(//可去路径{\n" +
            "\t\tname: \"长安南驿道[1]\",\n" +
            "\t\ttext: \"北：驿道 ↑\"\n" +
            "\t},\n" +
            "\t{\n" +
            "\t\tname: \"长安山岭\",\n" +
            "\t\ttext: \"南：山岭 ↓\"\n" +
            "\t})\n" +
            "},\n" +
            "{\n" +
            "\tname: \"长安山岭\",\n" +
            "\t//地图名称text: Array(\"一处险恶的山岭\"),\n" +
            "\t//描述判定npc: Array(\"吊睛白额虎\"),\n" +
            "\t//npcdirection: Array(//可去路径{\n" +
            "\t\tname: \"秦岭\",\n" +
            "\t\ttext: \"北：秦岭 ↑\"\n" +
            "\t},\n" +
            "\t{\n" +
            "\t\tname: \"终南山脚\",\n" +
            "\t\ttext: \"东：终南山脚 →\"\n" +
            "\t},\n" +
            "\t{\n" +
            "\t\tname: \"成都北驿道[1]\",\n" +
            "\t\ttext: \"南：驿道 ↓\"\n" +
            "\t})\n" +
            "},\n" +
            "{\n" +
            "\tname: \"终南山脚\",\n" +
            "\t//地图名称text: Array(\"这里是终南山的山脚\",\n" +
            "\t\"东：教碑\"),\n" +
            "\t//描述判定npc: Array(),\n" +
            "\t//npcdirection: Array(//可去路径{\n" +
            "\t\tname: \"终南山脚草地[1]\",\n" +
            "\t\ttext: \"北：草地 ↑\"\n" +
            "\t},\n" +
            "\t{\n" +
            "\t\tname: \"长安山岭\",\n" +
            "\t\ttext: \"西：山岭 ←\"\n" +
            "\t},\n" +
            "\t{\n" +
            "\t\tname: \"教碑\",\n" +
            "\t\ttext: \"东：教碑 →\"\n" +
            "\t})\n" +
            "},\n" +
            "{\n" +
            "\tname: \"少室山石阶\",\n" +
            "\t//地图名称text: Array(\"这里是嵩山南麓的少室山山脚\",\n" +
            "\t\"北：广场\"),\n" +
            "\t//描述判定npc: Array(\"守寺僧兵\",\n" +
            "\t\"清晓比丘\"),\n" +
            "\t//npcdirection: Array(//可去路径{\n" +
            "\t\tname: \"少林广场\",\n" +
            "\t\ttext: \"北：广场 ↑\"\n" +
            "\t},\n" +
            "\t{\n" +
            "\t\tname: \"洛阳东驿道[3]\",\n" +
            "\t\ttext: \"南：驿道 ↓\"\n" +
            "\t})\n" +
            "},\n" +
            "{\n" +
            "\tname: \"少林广场\",\n" +
            "\t//地图名称text: Array(\"这里是少林寺前的广场\"),\n" +
            "\t//描述判定npc: Array(\"道果禅师\",\n" +
            "\t\"守寺僧兵\",\n" +
            "\t\"道成禅师\"),\n" +
            "\t//npcdirection: Array(//可去路径{\n" +
            "\t\tname: \"山门殿\",\n" +
            "\t\ttext: \"北：山门殿 ↑\"\n" +
            "\t},\n" +
            "\t{\n" +
            "\t\tname: \"西松树林\",\n" +
            "\t\ttext: \"西：松树林 ←\"\n" +
            "\t},\n" +
            "\t{\n" +
            "\t\tname: \"东松树林\",\n" +
            "\t\ttext: \"东：松树林 →\"\n" +
            "\t},\n" +
            "\t{\n" +
            "\t\tname: \"少室山石阶\",\n" +
            "\t\ttext: \"南：少室山石阶 ↓\"\n" +
            "\t})\n" +
            "},\n" +
            "{\n" +
            "\tname: \"东松树林\",\n" +
            "\t//地图名称text: Array(\"这是一片松树林\",\n" +
            "\t\"西：广场 ←\"),\n" +
            "\t//描述判定npc: Array(\"澄思\",\n" +
            "\t\"澄心\",\n" +
            "\t\"澄信\",\n" +
            "\t\"澄行\"),\n" +
            "\t//npcdirection: Array(//可去路径{\n" +
            "\t\tname: \"少林广场\",\n" +
            "\t\ttext: \"西：广场 ←\"\n" +
            "\t})\n" +
            "},\n" +
            "{\n" +
            "\tname: \"西松树林\",\n" +
            "\t//地图名称text: Array(\"这是一片松树林。几十丈高的大松树簇在一块\",\n" +
            "\t\"东：广场\"),\n" +
            "\t//描述判定npc: Array(\"澄意\",\n" +
            "\t\"澄欲\",\n" +
            "\t\"澄知\",\n" +
            "\t\"澄斯\"),\n" +
            "\t//npcdirection: Array(//可去路径{\n" +
            "\t\tname: \"少林广场\",\n" +
            "\t\ttext: \"东：广场 →\"\n" +
            "\t})\n" +
            "},\n" +
            "{\n" +
            "\tname: \"山门殿\",\n" +
            "\t//地图名称text: Array(\"这里是少林寺的前殿山门殿。殿内青砖铺地\"),\n" +
            "\t//描述判定npc: Array(\"进香客\",\n" +
            "\t\"守寺僧兵\"),\n" +
            "\t//npcdirection: Array(//可去路径{\n" +
            "\t\tname: \"少林台阶\",\n" +
            "\t\ttext: \"北：台阶 ↑\"\n" +
            "\t},\n" +
            "\t{\n" +
            "\t\tname: \"少林广场\",\n" +
            "\t\ttext: \"南：广场 ↓\"\n" +
            "\t})\n" +
            "},\n" +
            "{\n" +
            "\tname: \"少林台阶\",\n" +
            "\t//地图名称text: Array(\"穿过山门殿，面前三道平行的青石台阶通向前方的一个高台\"),\n" +
            "\t//描述判定npc: Array(\"进香客\",\n" +
            "\t\"少林知客僧虚明\",\n" +
            "\t\"守寺僧兵\",\n" +
            "\t\"少林知客僧虚通\"),\n" +
            "\t//npcdirection: Array(//可去路径{\n" +
            "\t\tname: \"天王殿\",\n" +
            "\t\ttext: \"北：天王殿 ↑\"\n" +
            "\t},\n" +
            "\t{\n" +
            "\t\tname: \"山门殿\",\n" +
            "\t\ttext: \"南：山门殿 ↓\"\n" +
            "\t})\n" +
            "},\n" +
            "{\n" +
            "\tname: \"天王殿\",\n" +
            "\t//地图名称text: Array(\"这里是少林寺的中殿天王殿\"),\n" +
            "\t//描述判定npc: Array(\"慧洁尊者\",\n" +
            "\t\"守寺僧兵\"),\n" +
            "\t//npcdirection: Array(//可去路径{\n" +
            "\t\tname: \"大雄宝殿\",\n" +
            "\t\ttext: \"北：大雄宝殿 ↑\"\n" +
            "\t},\n" +
            "\t{\n" +
            "\t\tname: \"西习武场\",\n" +
            "\t\ttext: \"西：习武场 ←\"\n" +
            "\t},\n" +
            "\t{\n" +
            "\t\tname: \"东习武场\",\n" +
            "\t\ttext: \"东：习武场 →\"\n" +
            "\t},\n" +
            "\t{\n" +
            "\t\tname: \"少林台阶\",\n" +
            "\t\ttext: \"南：台阶 ↓\"\n" +
            "\t})\n" +
            "},\n" +
            "{\n" +
            "\tname: \"西习武场\",\n" +
            "\t//地图名称text: Array(\"少林武僧练功的地方，呼喝之声不时传来\",\n" +
            "\t\"东：天王殿\"),\n" +
            "\t//描述判定npc: Array(\"老僧\"),\n" +
            "\t//npcdirection: Array(//可去路径{\n" +
            "\t\tname: \"天王殿\",\n" +
            "\t\ttext: \"东：天王殿 →\"\n" +
            "\t})\n" +
            "},\n" +
            "{\n" +
            "\tname: \"东习武场\",\n" +
            "\t//地图名称text: Array(\"少林武僧练功的地方，呼喝之声不时传来\",\n" +
            "\t\"西：天王殿\"),\n" +
            "\t//描述判定npc: Array(\"守寺僧兵\"),\n" +
            "\t//npcdirection: Array(//可去路径{\n" +
            "\t\tname: \"天王殿\",\n" +
            "\t\ttext: \"西：天王殿 ←\"\n" +
            "\t})\n" +
            "},\n" +
            "{\n" +
            "\tname: \"大雄宝殿\",\n" +
            "\t//地图名称text: Array(\"这里是少林寺的大雄宝殿。正中供奉着如来三宝\"),\n" +
            "\t//描述判定npc: Array(\"高僧\"),\n" +
            "\t//npcdirection: Array(//可去路径{\n" +
            "\t\tname: \"少林后殿\",\n" +
            "\t\ttext: \"北：后殿 ↑\"\n" +
            "\t},\n" +
            "\t{\n" +
            "\t\tname: \"练功长廊[1]\",\n" +
            "\t\ttext: \"西：练功长廊 ←\"\n" +
            "\t},\n" +
            "\t{\n" +
            "\t\tname: \"少林休息室\",\n" +
            "\t\ttext: \"东：休息室 →\"\n" +
            "\t},\n" +
            "\t{\n" +
            "\t\tname: \"天王殿\",\n" +
            "\t\ttext: \"南：天王殿 ↓\"\n" +
            "\t})\n" +
            "},\n" +
            "{\n" +
            "\tname: \"少林休息室\",\n" +
            "\t//地图名称text: Array(\"少林弟子休息的地方\",\n" +
            "\t\"西：大雄宝殿\"),\n" +
            "\t//描述判定npc: Array(\"澄明\"),\n" +
            "\t//npcdirection: Array(//可去路径{\n" +
            "\t\tname: \"大雄宝殿\",\n" +
            "\t\ttext: \"西：大雄宝殿 ←\"\n" +
            "\t})\n" +
            "},\n" +
            "{\n" +
            "\tname: \"练功长廊[1]\",\n" +
            "\t//地图名称text: Array(\"走廊南北是为少林弟子各个等级\",\n" +
            "\t\"练功房之戒贪\"),\n" +
            "\t//描述判定npc: Array(\"比丘\"),\n" +
            "\t//npcdirection: Array(//可去路径{\n" +
            "\t\tname: \"练功房之戒贪\",\n" +
            "\t\ttext: \"北：练功房之戒贪 ↑\"\n" +
            "\t},\n" +
            "\t{\n" +
            "\t\tname: \"练功长廊[2]\",\n" +
            "\t\ttext: \"西：练功长廊 ←\"\n" +
            "\t},\n" +
            "\t{\n" +
            "\t\tname: \"大雄宝殿\",\n" +
            "\t\ttext: \"东：大雄宝殿 →\"\n" +
            "\t},\n" +
            "\t{\n" +
            "\t\tname: \"练功房之戒色\",\n" +
            "\t\ttext: \"南：练功房之戒色 ↓\"\n" +
            "\t})\n" +
            "},\n" +
            "{\n" +
            "\tname: \"练功长廊[2]\",\n" +
            "\t//地图名称text: Array(\"走廊南北是为少林弟子各个等级\",\n" +
            "\t\"练功房之戒妒\"),\n" +
            "\t//描述判定npc: Array(\"禅师\"),\n" +
            "\t//npcdirection: Array(//可去路径{\n" +
            "\t\tname: \"练功房之戒妒\",\n" +
            "\t\ttext: \"北：练功房之戒妒 ↑\"\n" +
            "\t},\n" +
            "\t{\n" +
            "\t\tname: \"练功长廊[3]\",\n" +
            "\t\ttext: \"西：练功长廊 ←\"\n" +
            "\t},\n" +
            "\t{\n" +
            "\t\tname: \"练功长廊[1]\",\n" +
            "\t\ttext: \"东：练功长廊 →\"\n" +
            "\t},\n" +
            "\t{\n" +
            "\t\tname: \"练功房之戒欲\",\n" +
            "\t\ttext: \"南：练功房之戒欲 ↓\"\n" +
            "\t})\n" +
            "},\n" +
            "{\n" +
            "\tname: \"练功长廊[3]\",\n" +
            "\t//地图名称text: Array(\"走廊南北是为少林弟子各个等级\",\n" +
            "\t\"练功房之戒嗔\"),\n" +
            "\t//描述判定npc: Array(\"尊者\"),\n" +
            "\t//npcdirection: Array(//可去路径{\n" +
            "\t\tname: \"练功长廊[2]\",\n" +
            "\t\ttext: \"东：练功长廊 →\"\n" +
            "\t},\n" +
            "\t{\n" +
            "\t\tname: \"练功房之戒嗔\",\n" +
            "\t\ttext: \"南：练功房之戒嗔 ↓\"\n" +
            "\t})\n" +
            "},\n" +
            "{\n" +
            "\tname: \"少林后殿\",\n" +
            "\t//地图名称text: Array(\"后殿规模不大。两边都是水磨石壁\"),\n" +
            "\t//描述判定npc: Array(\"慧如尊者\",\n" +
            "\t\"守寺僧兵\"),\n" +
            "\t//npcdirection: Array(//可去路径{\n" +
            "\t\tname: \"方丈室\",\n" +
            "\t\ttext: \"北：方丈室 ↑\"\n" +
            "\t},\n" +
            "\t{\n" +
            "\t\tname: \"般若堂\",\n" +
            "\t\ttext: \"西：般若堂 ←\"\n" +
            "\t},\n" +
            "\t{\n" +
            "\t\tname: \"罗汉堂\",\n" +
            "\t\ttext: \"东：罗汉堂 →\"\n" +
            "\t},\n" +
            "\t{\n" +
            "\t\tname: \"大雄宝殿\",\n" +
            "\t\ttext: \"南：大雄宝殿 ↓\"\n" +
            "\t})\n" +
            "},\n" +
            "{\n" +
            "\tname: \"罗汉堂\",\n" +
            "\t//地图名称text: Array(\"这是一间极为简陋的禅房\",\n" +
            "\t\"西：后殿\"),\n" +
            "\t//描述判定npc: Array(\"澄观\",\n" +
            "\t\"澄和\",\n" +
            "\t\"澄寂\",\n" +
            "\t\"澄坚\",\n" +
            "\t\"澄净\",\n" +
            "\t\"澄灵\",\n" +
            "\t\"澄灭\",\n" +
            "\t\"澄尚\"),\n" +
            "\t//npcdirection: Array(//可去路径{\n" +
            "\t\tname: \"少林后殿\",\n" +
            "\t\ttext: \"西：后殿 ←\"\n" +
            "\t})\n" +
            "},\n" +
            "{\n" +
            "\tname: \"般若堂\",\n" +
            "\t//地图名称text: Array(\"这是一间极为简陋的禅房\",\n" +
            "\t\"东：后殿\"),\n" +
            "\t//描述判定npc: Array(\"澄识\",\n" +
            "\t\"澄思\",\n" +
            "\t\"澄斯\",\n" +
            "\t\"澄心\",\n" +
            "\t\"澄信\",\n" +
            "\t\"澄行\",\n" +
            "\t\"澄意\",\n" +
            "\t\"澄欲\",\n" +
            "\t\"澄知\"),\n" +
            "\t//npcdirection: Array(//可去路径{\n" +
            "\t\tname: \"少林后殿\",\n" +
            "\t\ttext: \"东：后殿 →\"\n" +
            "\t})\n" +
            "},\n" +
            "{\n" +
            "\tname: \"方丈室\",\n" +
            "\t//地图名称text: Array(\"方丈室陈设简洁，正中一几\"),\n" +
            "\t//描述判定npc: Array(\"玄慈大师\",\n" +
            "\t\"玄难大师\",\n" +
            "\t\"玄苦大师\"),\n" +
            "\t//npcdirection: Array(//可去路径{\n" +
            "\t\tname: \"达摩院\",\n" +
            "\t\ttext: \"北：达摩院 ↑\"\n" +
            "\t},\n" +
            "\t{\n" +
            "\t\tname: \"藏经阁\",\n" +
            "\t\ttext: \"西：藏经阁 ←\"\n" +
            "\t},\n" +
            "\t{\n" +
            "\t\tname: \"少林武器库\",\n" +
            "\t\ttext: \"东：武器库 →\"\n" +
            "\t},\n" +
            "\t{\n" +
            "\t\tname: \"少林后殿\",\n" +
            "\t\ttext: \"南：后殿 ↓\"\n" +
            "\t})\n" +
            "},\n" +
            "{\n" +
            "\tname: \"少林藏经阁\",\n" +
            "\t//地图名称text: Array(\"不愧为中原佛法总源，少林寺此处藏经之富\"),\n" +
            "\t//描述判定npc: Array(\"无名老僧\"),\n" +
            "\t//npcdirection: Array(//可去路径{\n" +
            "\t\tname: \"方丈室\",\n" +
            "\t\ttext: \"东：方丈室 →\"\n" +
            "\t})\n" +
            "},\n" +
            "{\n" +
            "\tname: \"少林武器库\",\n" +
            "\t//地图名称text: Array(\"少林寺的武器库可称天下第一\"),\n" +
            "\t//描述判定npc: Array(\"打铁僧\"),\n" +
            "\t//npcdirection: Array(//可去路径{\n" +
            "\t\tname: \"方丈室\",\n" +
            "\t\ttext: \"西：方丈室 ←\"\n" +
            "\t})\n" +
            "},\n" +
            "{\n" +
            "\tname: \"达摩院\",\n" +
            "\t//地图名称text: Array(\"这是一座古朴的殿堂。西首的墙上挂满了各类武功图谱\"),\n" +
            "\t//描述判定npc: Array(\"扫地僧\"),\n" +
            "\t//npcdirection: Array(//可去路径{\n" +
            "\t\tname: \"少林竹林\",\n" +
            "\t\ttext: \"北：竹林 ↑\"\n" +
            "\t},\n" +
            "\t{\n" +
            "\t\tname: \"少林后山\",\n" +
            "\t\ttext: \"西：后山 ←\"\n" +
            "\t},\n" +
            "\t{\n" +
            "\t\tname: \"林中精舍\",\n" +
            "\t\ttext: \"东：林中精舍 →\"\n" +
            "\t},\n" +
            "\t{\n" +
            "\t\tname: \"方丈室\",\n" +
            "\t\ttext: \"南：方丈室 ↓\"\n" +
            "\t})\n" +
            "},\n" +
            "{\n" +
            "\tname: \"林中精舍\",\n" +
            "\t//地图名称text: Array(\"竹林深处的一间小屋，古朴典雅\",\n" +
            "\t\"西：达摩院\"),\n" +
            "\t//描述判定npc: Array(\"空闻\",\n" +
            "\t\"空智\",\n" +
            "\t\"空性\"),\n" +
            "\t//npcdirection: Array(//可去路径{\n" +
            "\t\tname: \"达摩院\",\n" +
            "\t\ttext: \"西：达摩院 ←\"\n" +
            "\t})\n" +
            "},\n" +
            "{\n" +
            "\tname: \"少林后山\",\n" +
            "\t//地图名称text: Array(\"少林后山，三棵百年青松呈品字型巍然耸立，苍劲非凡\"),\n" +
            "\t//描述判定npc: Array(\"达摩祖师\",\n" +
            "\t\"渡难\",\n" +
            "\t\"渡厄\"),\n" +
            "\t//npcdirection: Array(//可去路径{\n" +
            "\t\tname: \"达摩院\",\n" +
            "\t\ttext: \"东：达摩院 →\"\n" +
            "\t})\n" +
            "},\n" +
            "{\n" +
            "\tname: \"少林竹林\",\n" +
            "\t//地图名称text: Array(\"南：达摩院\",\n" +
            "\t\"一片绿油油的竹林\"),\n" +
            "\t//描述判定npc: Array(\"渡劫长老\"),\n" +
            "\t//npcdirection: Array(//可去路径{\n" +
            "\t\tname: \"少林竹林[1]\",\n" +
            "\t\ttext: \"北：竹林 ↑\"\n" +
            "\t},\n" +
            "\t{\n" +
            "\t\tname: \"少林竹林[2]\",\n" +
            "\t\ttext: \"西：竹林 ←\"\n" +
            "\t},\n" +
            "\t{\n" +
            "\t\tname: \"少林竹林[3]\",\n" +
            "\t\ttext: \"东：竹林 →\"\n" +
            "\t},\n" +
            "\t{\n" +
            "\t\tname: \"达摩院\",\n" +
            "\t\ttext: \"南：达摩院 ↓\"\n" +
            "\t})\n" +
            "},\n" +
            "{\n" +
            "\tname: \"少林竹林[1]\",\n" +
            "\t//地图名称text: Array(\"南：达摩院\",\n" +
            "\t\"一片绿油油的竹林\"),\n" +
            "\t//描述判定npc: Array(\"渡劫长老\"),\n" +
            "\t//npcdirection: Array(//可去路径{\n" +
            "\t\tname: \"少林竹林\",\n" +
            "\t\ttext: \"东：竹林 →\"\n" +
            "\t})\n" +
            "},\n" +
            "{\n" +
            "\tname: \"少林竹林[2]\",\n" +
            "\t//地图名称text: Array(\"南：达摩院\",\n" +
            "\t\"一片绿油油的竹林\"),\n" +
            "\t//描述判定npc: Array(\"渡劫长老\"),\n" +
            "\t//npcdirection: Array(//可去路径{\n" +
            "\t\tname: \"少林竹林\",\n" +
            "\t\ttext: \"西：竹林 ←\"\n" +
            "\t})\n" +
            "},\n" +
            "{\n" +
            "\tname: \"少林竹林[3]\",\n" +
            "\t//地图名称text: Array(\"南：达摩院\",\n" +
            "\t\"一片绿油油的竹林\"),\n" +
            "\t//描述判定npc: Array(\"渡劫长老\"),\n" +
            "\t//npcdirection: Array(//可去路径{\n" +
            "\t\tname: \"少林竹林\",\n" +
            "\t\ttext: \"北：竹林 ↑\"\n" +
            "\t})\n" +
            "},\n" +
            "//武当数据{\n" +
            "\tname: \"武当山门\",\n" +
            "\t//地图名称text: Array(\"你的面前是一座林木繁茂的高山\",\n" +
            "\t\"西：石阶 ←\"),\n" +
            "\t//描述判定npc: Array(\"宋青书\"),\n" +
            "\t//npcdirection: Array(//可去路径{\n" +
            "\t\tname: \"武当石阶[1]\",\n" +
            "\t\ttext: \"西：石阶 ←\"\n" +
            "\t},\n" +
            "\t{\n" +
            "\t\tname: \"武当黄土路[1]\",\n" +
            "\t\ttext: \"东：黄土路 →\"\n" +
            "\t},\n" +
            "\t{\n" +
            "\t\tname: \"武汉西驿道[1]\",\n" +
            "\t\ttext: \"南：驿道 ↓\"\n" +
            "\t})\n" +
            "},\n" +
            "{\n" +
            "\tname: \"武当石阶[1]\",\n" +
            "\t//地图名称text: Array(\"这是一条宽大坚实的石阶路，不时地有进香客和游人从你的身边走过\",\n" +
            "\t\"北：石阶 ↑\",\n" +
            "\t\"东：武当山门 →\"),\n" +
            "\t//描述判定npc: Array(),\n" +
            "\t//npcdirection: Array(//可去路径{\n" +
            "\t\tname: \"武当石阶[2]\",\n" +
            "\t\ttext: \"北：石阶 ↑\"\n" +
            "\t},\n" +
            "\t{\n" +
            "\t\tname: \"武当山门\",\n" +
            "\t\ttext: \"东：武当山门 →\"\n" +
            "\t})\n" +
            "},\n" +
            "{\n" +
            "\tname: \"武当石阶[2]\",\n" +
            "\t//地图名称text: Array(\"这是一条宽大坚实的石阶路，东边一条石阶通往山下\",\n" +
            "\t\"北：石阶 ↑\",\n" +
            "\t\"南：石阶 ↓\"),\n" +
            "\t//描述判定npc: Array(),\n" +
            "\t//npcdirection: Array(//可去路径{\n" +
            "\t\tname: \"武当石阶[3]\",\n" +
            "\t\ttext: \"北：石阶 ↑\"\n" +
            "\t},\n" +
            "\t{\n" +
            "\t\tname: \"武当石阶[1]\",\n" +
            "\t\ttext: \"南：石阶 ↓\"\n" +
            "\t})\n" +
            "},\n" +
            "{\n" +
            "\tname: \"武当石阶[3]\",\n" +
            "\t//地图名称text: Array(\"这是一条宽大坚实的石阶路\",\n" +
            "\t\"北：玄武门 ↑\",\n" +
            "\t\"南：石阶 ↓\"),\n" +
            "\t//描述判定npc: Array(),\n" +
            "\t//npcdirection: Array(//可去路径{\n" +
            "\t\tname: \"武当玄武门\",\n" +
            "\t\ttext: \"北：玄武门 ↑\"\n" +
            "\t},\n" +
            "\t{\n" +
            "\t\tname: \"武当石阶[2]\",\n" +
            "\t\ttext: \"南：石阶 ↓\"\n" +
            "\t})\n" +
            "},\n" +
            "{\n" +
            "\tname: \"武当玄武门\",\n" +
            "\t//地图名称text: Array(\"在你的面前是一座高大的石坊，上面写着“玄武门”三个镏金大字\",\n" +
            "\t\"北：武当广场 ↑\",\n" +
            "\t\"南：石阶 ↓\"),\n" +
            "\t//描述判定npc: Array(\"知客道长\"),\n" +
            "\t//npcdirection: Array(//可去路径{\n" +
            "\t\tname: \"武当广场\",\n" +
            "\t\ttext: \"北：武当广场 ↑\"\n" +
            "\t},\n" +
            "\t{\n" +
            "\t\tname: \"武当石阶[3]\",\n" +
            "\t\ttext: \"南：石阶 ↓\"\n" +
            "\t})\n" +
            "},\n" +
            "{\n" +
            "\tname: \"武当广场\",\n" +
            "\t//地图名称text: Array(\"这是一个由大石板铺成的广场\",\n" +
            "\t\"北：西厢走廊 ↑\"),\n" +
            "\t//描述判定npc: Array(),\n" +
            "\t//npcdirection: Array(//可去路径{\n" +
            "\t\tname: \"西厢走廊\",\n" +
            "\t\ttext: \"北：西厢走廊 ↑\"\n" +
            "\t},\n" +
            "\t{\n" +
            "\t\tname: \"武当石阶[4]\",\n" +
            "\t\ttext: \"东：石阶 →\"\n" +
            "\t},\n" +
            "\t{\n" +
            "\t\tname: \"武当玄武门\",\n" +
            "\t\ttext: \"南：玄武门 ↓\"\n" +
            "\t})\n" +
            "},\n" +
            "{\n" +
            "\tname: \"西厢走廊\",\n" +
            "\t//地图名称text: Array(\"你走在一条走廊上\",\n" +
            "\t\"向北走是藏经阁\"),\n" +
            "\t//描述判定npc: Array(),\n" +
            "\t//npcdirection: Array(//可去路径{\n" +
            "\t\tname: \"武当藏经阁\",\n" +
            "\t\ttext: \"北：藏经阁 ↑\"\n" +
            "\t},\n" +
            "\t{\n" +
            "\t\tname: \"武当三清殿\",\n" +
            "\t\ttext: \"东：三清殿 →\"\n" +
            "\t},\n" +
            "\t{\n" +
            "\t\tname: \"武当广场\",\n" +
            "\t\ttext: \"南：武当广场 ↓\"\n" +
            "\t})\n" +
            "},\n" +
            "{\n" +
            "\tname: \"武当藏经阁\",\n" +
            "\t//地图名称text: Array(\"这里是藏经阁，书架上摆满了书籍\",\n" +
            "\t\"南：西厢走廊 ↓\"),\n" +
            "\t//描述判定npc: Array(),\n" +
            "\t//npcdirection: Array(//可去路径{\n" +
            "\t\tname: \"西厢走廊\",\n" +
            "\t\ttext: \"南：西厢走廊 ↓\"\n" +
            "\t})\n" +
            "},\n" +
            "{\n" +
            "\tname: \"武当三清殿\",\n" +
            "\t//地图名称text: Array(\"这里是凌霄宫的三清殿\",\n" +
            "\t\"是武当派会客的地点\"),\n" +
            "\t//描述判定npc: Array(\"谷虚道长\",\n" +
            "\t\"宋远桥\"),\n" +
            "\t//npcdirection: Array(//可去路径{\n" +
            "\t\tname: \"武当后院\",\n" +
            "\t\ttext: \"北：后院 ↑\"\n" +
            "\t},\n" +
            "\t{\n" +
            "\t\tname: \"西厢走廊\",\n" +
            "\t\ttext: \"西：西厢走廊 ←\"\n" +
            "\t},\n" +
            "\t{\n" +
            "\t\tname: \"东厢走廊[1]\",\n" +
            "\t\ttext: \"东：东厢走廊 →\"\n" +
            "\t})\n" +
            "},\n" +
            "{\n" +
            "\tname: \"武当后院\",\n" +
            "\t//地图名称text: Array(\"这里是后院，南面是三清殿\",\n" +
            "\t\"北：后山小院 ↑\"),\n" +
            "\t//描述判定npc: Array(\"俞莲舟\"),\n" +
            "\t//npcdirection: Array(//可去路径{\n" +
            "\t\tname: \"武当后山小院\",\n" +
            "\t\ttext: \"北：后山小院 ↑\"\n" +
            "\t},\n" +
            "\t{\n" +
            "\t\tname: \"武当三清殿\",\n" +
            "\t\ttext: \"南：三清殿 ↓\"\n" +
            "\t})\n" +
            "},\n" +
            "{\n" +
            "\tname: \"武当后山小院\",\n" +
            "\t//地图名称text: Array(\"这是后山的一座小院\",\n" +
            "\t\"南：后院 ↓\"),\n" +
            "\t//描述判定npc: Array(),\n" +
            "\t//npcdirection: Array(//可去路径{\n" +
            "\t\tname: \"武当后院\",\n" +
            "\t\ttext: \"南：后院 ↓\"\n" +
            "\t})\n" +
            "},\n" +
            "{\n" +
            "\tname: \"东厢走廊[1]\",\n" +
            "\t//地图名称text: Array(\"你走在一条走廊上，东边有几间雅室\",\n" +
            "\t\"西：三清殿 ←\"),\n" +
            "\t//描述判定npc: Array(\"张松溪\"),\n" +
            "\t//npcdirection: Array(//可去路径{\n" +
            "\t\tname: \"武当三清殿\",\n" +
            "\t\ttext: \"西：三清殿 ←\"\n" +
            "\t},\n" +
            "\t{\n" +
            "\t\tname: \"东厢走廊[2]\",\n" +
            "\t\ttext: \"东：东厢走廊 →\"\n" +
            "\t})\n" +
            "},\n" +
            "{\n" +
            "\tname: \"东厢走廊[2]\",\n" +
            "\t//地图名称text: Array(\"你走在一条走廊上，隐约可以听到东边传来呼吸声\",\n" +
            "\t\"北：休息室 ↑\"),\n" +
            "\t//描述判定npc: Array(),\n" +
            "\t//npcdirection: Array(//可去路径{\n" +
            "\t\tname: \"武当休息室\",\n" +
            "\t\ttext: \"北：休息室 ↑\"\n" +
            "\t},\n" +
            "\t{\n" +
            "\t\tname: \"东厢走廊[1]\",\n" +
            "\t\ttext: \"西：东厢走廊 ←\"\n" +
            "\t},\n" +
            "\t{\n" +
            "\t\tname: \"武当练功房\",\n" +
            "\t\ttext: \"东：练功房 →\"\n" +
            "\t},\n" +
            "\t{\n" +
            "\t\tname: \"武当茶室\",\n" +
            "\t\ttext: \"南：茶室 ↓\"\n" +
            "\t})\n" +
            "},\n" +
            "{\n" +
            "\tname: \"武当休息室\",\n" +
            "\t//地图名称text: Array(\"这是间整洁的厢房\",\n" +
            "\t\"南：东厢走廊 ↓\"),\n" +
            "\t//描述判定npc: Array(),\n" +
            "\t//npcdirection: Array(//可去路径{\n" +
            "\t\tname: \"东厢走廊[2]\",\n" +
            "\t\ttext: \"南：东厢走廊 ↓\"\n" +
            "\t})\n" +
            "},\n" +
            "{\n" +
            "\tname: \"武当茶室\",\n" +
            "\t//地图名称text: Array(\"满屋的果香和茶香，沁人心脾\",\n" +
            "\t\"北：东厢走廊 ↑\"),\n" +
            "\t//描述判定npc: Array(\"小翠\"),\n" +
            "\t//npcdirection: Array(//可去路径{\n" +
            "\t\tname: \"东厢走廊[2]\",\n" +
            "\t\ttext: \"北：东厢走廊 ↑\"\n" +
            "\t})\n" +
            "},\n" +
            "{\n" +
            "\tname: \"武当练功房\",\n" +
            "\t//地图名称text: Array(\"这里是练功房\",\n" +
            "\t\"西：东厢走廊 ←\"),\n" +
            "\t//描述判定npc: Array(),\n" +
            "\t//npcdirection: Array(//可去路径{\n" +
            "\t\tname: \"东厢走廊[2]\",\n" +
            "\t\ttext: \"西：东厢走廊 ←\"\n" +
            "\t})\n" +
            "},\n" +
            "{\n" +
            "\tname: \"武当石阶[4]\",\n" +
            "\t//地图名称text: Array(\"这是一条宽大坚实的石阶路\",\n" +
            "\t\"西：武当广场 ←\"),\n" +
            "\t//描述判定npc: Array(),\n" +
            "\t//npcdirection: Array(//可去路径{\n" +
            "\t\tname: \"武当广场\",\n" +
            "\t\ttext: \"西：武当广场 ←\"\n" +
            "\t},\n" +
            "\t{\n" +
            "\t\tname: \"桃园小路[1]\",\n" +
            "\t\ttext: \"东：桃园小路 →\"\n" +
            "\t})\n" +
            "},\n" +
            "{\n" +
            "\tname: \"桃园小路[1]\",\n" +
            "\t//地图名称text: Array(\"南北方向是通向两个桃园的入口\",\n" +
            "\t\"北：桃园小路 ↑\",\n" +
            "\t\"西：石阶 ←\"),\n" +
            "\t//描述判定npc: Array(),\n" +
            "\t//npcdirection: Array(//可去路径{\n" +
            "\t\tname: \"桃园小路[2]\",\n" +
            "\t\ttext: \"北：桃园小路 ↑\"\n" +
            "\t},\n" +
            "\t{\n" +
            "\t\tname: \"武当石阶[4]\",\n" +
            "\t\ttext: \"西：石阶 ←\"\n" +
            "\t},\n" +
            "\t{\n" +
            "\t\tname: \"桃园小路[3]\",\n" +
            "\t\ttext: \"东：桃园小路 →\"\n" +
            "\t},\n" +
            "\t{\n" +
            "\t\tname: \"桃园小路[4]\",\n" +
            "\t\ttext: \"南：桃园小路 ↓\"\n" +
            "\t})\n" +
            "},\n" +
            "{\n" +
            "\tname: \"桃园小路[2]\",\n" +
            "\t//地图名称text: Array(\"这是武当山脚\",\n" +
            "\t\"西边有条陡峭的山路\",\n" +
            "\t\"南：桃园小路 ↓\"),\n" +
            "\t//描述判定npc: Array(),\n" +
            "\t//npcdirection: Array(//可去路径{\n" +
            "\t\tname: \"桃园小路[1]\",\n" +
            "\t\ttext: \"南：桃园小路 ↓\"\n" +
            "\t})\n" +
            "},\n" +
            "{\n" +
            "\tname: \"桃园小路[4]\",\n" +
            "\t//地图名称text: Array(\"这儿是武当山脚，南边是条环山的黄土路\",\n" +
            "\t\"北：桃园小路 ↑\"),\n" +
            "\t//描述判定npc: Array(),\n" +
            "\t//npcdirection: Array(//可去路径{\n" +
            "\t\tname: \"桃园小路[1]\",\n" +
            "\t\ttext: \"北：桃园小路 ↑\"\n" +
            "\t})\n" +
            "},\n" +
            "{\n" +
            "\tname: \"桃园小路[3]\",\n" +
            "\t//地图名称text: Array(\"眼前豁然开朗，你轻松地走在桃园边的小路上\",\n" +
            "\t\"西：桃园小路 ←\",\n" +
            "\t\"东：桃园小路 →\"),\n" +
            "\t//描述判定npc: Array(),\n" +
            "\t//npcdirection: Array(//可去路径{\n" +
            "\t\tname: \"桃园小路[1]\",\n" +
            "\t\ttext: \"西：桃园小路 ←\"\n" +
            "\t},\n" +
            "\t{\n" +
            "\t\tname: \"桃园小路[5]\",\n" +
            "\t\ttext: \"东：桃园小路 →\"\n" +
            "\t})\n" +
            "},\n" +
            "{\n" +
            "\tname: \"桃园小路[5]\",\n" +
            "\t//地图名称text: Array(\"北：桃园篱笆 ↑\",\n" +
            "\t\"西：桃园小路 ←\",\n" +
            "\t\"东：桃园小路 →\",\n" +
            "\t\"南：桃园木门 ↓\"),\n" +
            "\t//描述判定npc: Array(),\n" +
            "\t//npcdirection: Array(//可去路径{\n" +
            "\t\tname: \"桃园篱笆\",\n" +
            "\t\ttext: \"北：桃园篱笆 ↑\"\n" +
            "\t},\n" +
            "\t{\n" +
            "\t\tname: \"桃园小路[3]\",\n" +
            "\t\ttext: \"西：桃园小路 ←\"\n" +
            "\t},\n" +
            "\t{\n" +
            "\t\tname: \"桃园小路[6]\",\n" +
            "\t\ttext: \"东：桃园小路 →\"\n" +
            "\t},\n" +
            "\t{\n" +
            "\t\tname: \"桃园木门\",\n" +
            "\t\ttext: \"南：桃园木门 ↓\"\n" +
            "\t})\n" +
            "},\n" +
            "{\n" +
            "\tname: \"桃园篱笆\",\n" +
            "\t//地图名称text: Array(\"你走在一条通往桃树林深处的小道上\",\n" +
            "\t\"南：桃园小路 ↓\"),\n" +
            "\t//描述判定npc: Array(),\n" +
            "\t//npcdirection: Array(//可去路径{\n" +
            "\t\tname: \"桃园小路[5]\",\n" +
            "\t\ttext: \"南：桃园小路 ↓\"\n" +
            "\t})\n" +
            "},\n" +
            "{\n" +
            "\tname: \"桃园小路[6]\",\n" +
            "\t//地图名称text: Array(\"眼前豁然开朗\",\n" +
            "\t\"你轻松地走在桃园边的小路上\",\n" +
            "\t\"西：桃园小路 ←\"),\n" +
            "\t//描述判定npc: Array(),\n" +
            "\t//npcdirection: Array(//可去路径{\n" +
            "\t\tname: \"桃园小路[5]\",\n" +
            "\t\ttext: \"西：桃园小路 ←\"\n" +
            "\t})\n" +
            "},\n" +
            "{\n" +
            "\tname: \"桃园木门\",\n" +
            "\t//地图名称text: Array(\"前面有个桃木门（door）\",\n" +
            "\t\"北：桃园小路 ↑\",\n" +
            "\t\"南：沼泽 ↓\"),\n" +
            "\t//描述判定npc: Array(),\n" +
            "\t//npcdirection: Array(//可去路径{\n" +
            "\t\tname: \"桃园小路[5]\",\n" +
            "\t\ttext: \"北：桃园小路 ↑\"\n" +
            "\t},\n" +
            "\t{\n" +
            "\t\tname: \"桃园沼泽\",\n" +
            "\t\ttext: \"南：沼泽 ↓\"\n" +
            "\t})\n" +
            "},\n" +
            "{\n" +
            "\tname: \"桃园沼泽\",\n" +
            "\t//地图名称text: Array(\"这里是肮脏的沼泽\",\n" +
            "\t\"北：桃园木门 ↑\"),\n" +
            "\t//描述判定npc: Array(),\n" +
            "\t//npcdirection: Array(//可去路径{\n" +
            "\t\tname: \"桃园木门\",\n" +
            "\t\ttext: \"北：桃园木门 ↑\"\n" +
            "\t})\n" +
            "},\n" +
            "{\n" +
            "\tname: \"武当黄土路[1]\",\n" +
            "\t//地图名称text: Array(\"你走在一条尘土飞扬的黄土路上\",\n" +
            "\t\"西：武当山门 ←\"),\n" +
            "\t//描述判定npc: Array(),\n" +
            "\t//npcdirection: Array(//可去路径{\n" +
            "\t\tname: \"武当山门\",\n" +
            "\t\ttext: \"西：武当山门 ←\"\n" +
            "\t},\n" +
            "\t{\n" +
            "\t\tname: \"武当黄土路[2]\",\n" +
            "\t\ttext: \"东：黄土路 →\"\n" +
            "\t},\n" +
            "\t{\n" +
            "\t\tname: \"武当林间小路[1]\",\n" +
            "\t\ttext: \"南：林间小路 ↓\"\n" +
            "\t})\n" +
            "},\n" +
            "{\n" +
            "\tname: \"武当黄土路[2]\",\n" +
            "\t//地图名称text: Array(\"你走在一条尘土飞扬的黄土路上\",\n" +
            "\t\"西：黄土路 ←\"),\n" +
            "\t//描述判定npc: Array(),\n" +
            "\t//npcdirection: Array(//可去路径{\n" +
            "\t\tname: \"武当黄土路[1]\",\n" +
            "\t\ttext: \"西：黄土路 ←\"\n" +
            "\t})\n" +
            "},\n" +
            "{\n" +
            "\tname: \"武当林间小路[1]\",\n" +
            "\t//地图名称text: Array(\"你走在一条僻静的林中小路上\",\n" +
            "\t\"两旁是阴森森的树林\",\n" +
            "\t\"北：黄土路 ↑\",\n" +
            "\t\"南：林间小路 ↓\"),\n" +
            "\t//描述判定npc: Array(\"土匪\"),\n" +
            "\t//npcdirection: Array(//可去路径{\n" +
            "\t\tname: \"武当黄土路[1]\",\n" +
            "\t\ttext: \"北：黄土路 ↑\"\n" +
            "\t},\n" +
            "\t{\n" +
            "\t\tname: \"武当林间小路[2]\",\n" +
            "\t\ttext: \"南：林间小路 ↓\"\n" +
            "\t})\n" +
            "},\n" +
            "{\n" +
            "\tname: \"武当林间小路[2]\",\n" +
            "\t//地图名称text: Array(\"你走在一条僻静的林中小路上，两旁是阴森森的树林\",\n" +
            "\t\"北：林间小路 ↑\",\n" +
            "\t\"东：林间小路 →\"),\n" +
            "\t//描述判定npc: Array(\"张三\"),\n" +
            "\t//npcdirection: Array(//可去路径{\n" +
            "\t\tname: \"武当林间小路[1]\",\n" +
            "\t\ttext: \"北：林间小路 ↑\"\n" +
            "\t},\n" +
            "\t{\n" +
            "\t\tname: \"武当林间小路[3]\",\n" +
            "\t\ttext: \"东：林间小路 →\"\n" +
            "\t})\n" +
            "},\n" +
            "{\n" +
            "\tname: \"武当林间小路[3]\",\n" +
            "\t//地图名称text: Array(\"你走在一条僻静的林中小路上，两旁是阴森森的树林\",\n" +
            "\t\"西：林间小路 ←\"),\n" +
            "\t//描述判定npc: Array(\"土匪头\"),\n" +
            "\t//npcdirection: Array(//可去路径{\n" +
            "\t\tname: \"武当林间小路[2]\",\n" +
            "\t\ttext: \"西：林间小路 ←\"\n" +
            "\t})\n" +
            "},\n" +
            "//雪山数据{\n" +
            "\tname: \"大雪山山路\",\n" +
            "\t//地图名称text: Array(\"远处可以看见终年积雪的山尖\",\n" +
            "\t\"北：大雪山口 ↑\"),\n" +
            "\t//描述判定npc: Array(\"守寺僧兵\",\n" +
            "\t\"和尚\"),\n" +
            "\t//npcdirection: Array(//可去路径{\n" +
            "\t\tname: \"大雪山口\",\n" +
            "\t\ttext: \"北：大雪山口 ↑\"\n" +
            "\t},\n" +
            "\t{\n" +
            "\t\tname: \"清风峡谷入口\",\n" +
            "\t\ttext: \"西：清风峡谷入口 ←\"\n" +
            "\t},\n" +
            "\t{\n" +
            "\t\tname: \"成都南门\",\n" +
            "\t\ttext: \"东：成都南门 →\"\n" +
            "\t})\n" +
            "},\n" +
            "{\n" +
            "\tname: \"大雪山口\",\n" +
            "\t//地图名称text: Array(\"群山环绕，四周积雪终年不化\",\n" +
            "\t\"西：凌霄城门\"),\n" +
            "\t//描述判定npc: Array(\"央宗\",\n" +
            "\t\"卓玛\",\n" +
            "\t\"守寺僧兵\"),\n" +
            "\t//npcdirection: Array(//可去路径{\n" +
            "\t\tname: \"凌霄城门\",\n" +
            "\t\ttext: \"西：凌霄城门 ←\"\n" +
            "\t},\n" +
            "\t{\n" +
            "\t\tname: \"大雪山山谷[1]\",\n" +
            "\t\ttext: \"东：大雪山山谷 →\"\n" +
            "\t},\n" +
            "\t{\n" +
            "\t\tname: \"大雪山山路\",\n" +
            "\t\ttext: \"南：大雪山山路 ↓\"\n" +
            "\t})\n" +
            "},\n" +
            "{\n" +
            "\tname: \"凌霄城门\",\n" +
            "\t//地图名称text: Array(\"这里是凌霄城的城门\",\n" +
            "\t\"东：大雪山口\",\n" +
            "\t\"北：冰道\"),\n" +
            "\t//描述判定npc: Array(\"耿万钟\",\n" +
            "\t\"花万紫\"),\n" +
            "\t//npcdirection: Array(//可去路径{\n" +
            "\t\tname: \"雪山冰道\",\n" +
            "\t\ttext: \"北：冰道 ↑\"\n" +
            "\t},\n" +
            "\t{\n" +
            "\t\tname: \"大雪山口\",\n" +
            "\t\ttext: \"东：大雪山口 →\"\n" +
            "\t})\n" +
            "},\n" +
            "{\n" +
            "\tname: \"雪山冰道\",\n" +
            "\t//地图名称text: Array(\"这里是一片冰雕玉砌的世界\",\n" +
            "\t\"北：梅道\",\n" +
            "\t\"西：监狱\"),\n" +
            "\t//描述判定npc: Array(\"封万里\",\n" +
            "\t\"成自学\"),\n" +
            "\t//npcdirection: Array(//可去路径{\n" +
            "\t\tname: \"雪山梅道\",\n" +
            "\t\ttext: \"北：梅道 ↑\"\n" +
            "\t},\n" +
            "\t{\n" +
            "\t\tname: \"雪山监狱\",\n" +
            "\t\ttext: \"西：监狱 ←\"\n" +
            "\t},\n" +
            "\t{\n" +
            "\t\tname: \"冰雪轩\",\n" +
            "\t\ttext: \"东：冰雪轩 →\"\n" +
            "\t},\n" +
            "\t{\n" +
            "\t\tname: \"凌霄城门\",\n" +
            "\t\ttext: \"南：凌霄城门 ↓\"\n" +
            "\t})\n" +
            "},\n" +
            "{\n" +
            "\tname: \"冰雪轩\",\n" +
            "\t//地图名称text: Array(\"这里是凌霄城里最大的酒楼冰雪轩，同时也是凌霄城的名迹之一\",\n" +
            "\t\"西：冰道\"),\n" +
            "\t//描述判定npc: Array(\"廖自砺\",\n" +
            "\t\"梁自进\"),\n" +
            "\t//npcdirection: Array(//可去路径{\n" +
            "\t\tname: \"雪山冰道\",\n" +
            "\t\ttext: \"西：冰道 ←\"\n" +
            "\t})\n" +
            "},\n" +
            "{\n" +
            "\tname: \"雪山监狱\",\n" +
            "\t//地图名称text: Array(\"这里就是凌霄城的监狱入口\",\n" +
            "\t\"东：冰道\"),\n" +
            "\t//描述判定npc: Array(\"陆万通\"),\n" +
            "\t//npcdirection: Array(//可去路径{\n" +
            "\t\tname: \"雪山冰道\",\n" +
            "\t\ttext: \"东：冰道 →\"\n" +
            "\t})\n" +
            "},\n" +
            "{\n" +
            "\tname: \"雪山梅道\",\n" +
            "\t//地图名称text: Array(\"这是一条充满了梅花清香的大道\",\n" +
            "\t\"北：凌霄殿\"),\n" +
            "\t//描述判定npc: Array(\"齐自勉\"),\n" +
            "\t//npcdirection: Array(//可去路径{\n" +
            "\t\tname: \"凌霄殿\",\n" +
            "\t\ttext: \"北：凌霄殿 ↑\"\n" +
            "\t},\n" +
            "\t{\n" +
            "\t\tname: \"戏梅亭\",\n" +
            "\t\ttext: \"西：戏梅亭 ←\"\n" +
            "\t},\n" +
            "\t{\n" +
            "\t\tname: \"云海石\",\n" +
            "\t\ttext: \"东：云海石 →\"\n" +
            "\t},\n" +
            "\t{\n" +
            "\t\tname: \"雪山冰道\",\n" +
            "\t\ttext: \"南：冰道 ↓\"\n" +
            "\t})\n" +
            "},\n" +
            "{\n" +
            "\tname: \"云海石\",\n" +
            "\t//地图名称text: Array(\"这里放着一座硕大的石头，是白自在从雪山绝谷中找到的奇石\",\n" +
            "\t\"西：梅道\"),\n" +
            "\t//描述判定npc: Array(\"褚万春\"),\n" +
            "\t//npcdirection: Array(//可去路径{\n" +
            "\t\tname: \"雪山梅道\",\n" +
            "\t\ttext: \"西：梅道 ←\"\n" +
            "\t})\n" +
            "},\n" +
            "{\n" +
            "\tname: \"戏梅亭\",\n" +
            "\t//地图名称text: Array(\"这里是凌霄城的戏梅亭，是凌霄城主白自在平时最喜欢来的地方\",\n" +
            "\t\"东：梅道\"),\n" +
            "\t//描述判定npc: Array(\"燕万鹏\"),\n" +
            "\t//npcdirection: Array(//可去路径{\n" +
            "\t\tname: \"雪山梅道\",\n" +
            "\t\ttext: \"东：梅道 →\"\n" +
            "\t})\n" +
            "},\n" +
            "{\n" +
            "\tname: \"凌霄殿\",\n" +
            "\t//地图名称text: Array(\"这里就是凌霄城的根本之地--凌霄殿\",\n" +
            "\t\"南：梅道\"),\n" +
            "\t//描述判定npc: Array(\"张万风\"),\n" +
            "\t//npcdirection: Array(//可去路径{\n" +
            "\t\tname: \"风火居\",\n" +
            "\t\ttext: \"西：风火居 ←\"\n" +
            "\t},\n" +
            "\t{\n" +
            "\t\tname: \"气寒轩\",\n" +
            "\t\ttext: \"东：气寒轩 →\"\n" +
            "\t},\n" +
            "\t{\n" +
            "\t\tname: \"雪山梅道\",\n" +
            "\t\ttext: \"南：梅道 ↓\"\n" +
            "\t})\n" +
            "},\n" +
            "{\n" +
            "\tname: \"气寒轩\",\n" +
            "\t//地图名称text: Array(\"这里是凌霄城大弟子白万剑及其家人的住所\",\n" +
            "\t\"西：凌霄殿\"),\n" +
            "\t//描述判定npc: Array(\"时万年\"),\n" +
            "\t//npcdirection: Array(//可去路径{\n" +
            "\t\tname: \"凌霄殿\",\n" +
            "\t\ttext: \"西：凌霄殿 ←\"\n" +
            "\t})\n" +
            "},\n" +
            "{\n" +
            "\tname: \"风火居\",\n" +
            "\t//地图名称text: Array(\"这里是凌霄双杰之一―封万里的房间\",\n" +
            "\t\"东：凌霄殿\"),\n" +
            "\t//描述判定npc: Array(\"柯万钧\"),\n" +
            "\t//npcdirection: Array(//可去路径{\n" +
            "\t\tname: \"凌霄殿\",\n" +
            "\t\ttext: \"东：凌霄殿 →\"\n" +
            "\t})\n" +
            "},\n" +
            "{\n" +
            "\tname: \"大雪山山谷[1]\",\n" +
            "\t//地图名称text: Array(\"一个宽大山谷，群山环绕，山顶上全是白闪闪的积雪\",\n" +
            "\t\"西：大雪山口\"),\n" +
            "\t//描述判定npc: Array(\"守寺僧兵\",\n" +
            "\t\"和尚\"),\n" +
            "\t//npcdirection: Array(//可去路径{\n" +
            "\t\tname: \"大雪山山谷[2]\",\n" +
            "\t\ttext: \"北：大雪山山谷 ↑\"\n" +
            "\t},\n" +
            "\t{\n" +
            "\t\tname: \"大雪山口\",\n" +
            "\t\ttext: \"西：大雪山口 ←\"\n" +
            "\t})\n" +
            "},\n" +
            "{\n" +
            "\tname: \"大雪山山谷[2]\",\n" +
            "\t//地图名称text: Array(\"一个宽大山谷，群山环绕，山顶上全是白闪闪的积雪\",\n" +
            "\t\"北：雪山寺山门\"),\n" +
            "\t//描述判定npc: Array(\"花铁干\",\n" +
            "\t\"水岱\"),\n" +
            "\t//npcdirection: Array(//可去路径{\n" +
            "\t\tname: \"雪山寺山门\",\n" +
            "\t\ttext: \"北：雪山寺山门 ↑\"\n" +
            "\t},\n" +
            "\t{\n" +
            "\t\tname: \"雪山山洞\",\n" +
            "\t\ttext: \"西：山洞 ←\"\n" +
            "\t},\n" +
            "\t{\n" +
            "\t\tname: \"忘忧谷\",\n" +
            "\t\ttext: \"东：忘忧谷 →\"\n" +
            "\t},\n" +
            "\t{\n" +
            "\t\tname: \"大雪山山谷[1]\",\n" +
            "\t\ttext: \"南：大雪山山谷 ↓\"\n" +
            "\t})\n" +
            "},\n" +
            "{\n" +
            "\tname: \"雪山山洞\",\n" +
            "\t//地图名称text: Array(\"空空荡荡一个山洞，倒也还算干净，尽头摆了一张石床\",\n" +
            "\t\"东：大雪山山谷\"),\n" +
            "\t//描述判定npc: Array(\"和尚\"),\n" +
            "\t//npcdirection: Array(//可去路径{\n" +
            "\t\tname: \"大雪山山谷[2]\",\n" +
            "\t\ttext: \"东：大雪山山谷 →\"\n" +
            "\t})\n" +
            "},\n" +
            "{\n" +
            "\tname: \"忘忧谷\",\n" +
            "\t//地图名称text: Array(\"这里乃是大轮寺外一处僻静所在，四下绝无人迹\",\n" +
            "\t\"西：大雪山山谷\"),\n" +
            "\t//描述判定npc: Array(\"胜谛\",\n" +
            "\t\"善勇\"),\n" +
            "\t//npcdirection: Array(//可去路径{\n" +
            "\t\tname: \"大雪山山谷[2]\",\n" +
            "\t\ttext: \"西：大雪山山谷 ←\"\n" +
            "\t})\n" +
            "},\n" +
            "{\n" +
            "\tname: \"雪山寺山门\",\n" +
            "\t//地图名称text: Array(\"这里是大轮寺的山门，门前是络绎不绝的进香朝圣的信徒\",\n" +
            "\t\"东：雪山祭坛\"),\n" +
            "\t//描述判定npc: Array(\"灵智上人\"),\n" +
            "\t//npcdirection: Array(//可去路径{\n" +
            "\t\tname: \"雪山大殿\",\n" +
            "\t\ttext: \"北：大殿 ↑\"\n" +
            "\t},\n" +
            "\t{\n" +
            "\t\tname: \"雪山练武场\",\n" +
            "\t\ttext: \"西：练武场 ←\"\n" +
            "\t},\n" +
            "\t{\n" +
            "\t\tname: \"雪山祭坛\",\n" +
            "\t\ttext: \"东：雪山祭坛 →\"\n" +
            "\t},\n" +
            "\t{\n" +
            "\t\tname: \"大雪山山谷[2]\",\n" +
            "\t\ttext: \"南：大雪山山谷 ↓\"\n" +
            "\t})\n" +
            "},\n" +
            "{\n" +
            "\tname: \"雪山祭坛\",\n" +
            "\t//地图名称text: Array(\"里是雪山寺雪山祭坛，中间一个高台，青石砌就\",\n" +
            "\t\"西：雪山寺山门\"),\n" +
            "\t//描述判定npc: Array(),\n" +
            "\t//npcdirection: Array(//可去路径{\n" +
            "\t\tname: \"雪山寺山门\",\n" +
            "\t\ttext: \"西：雪山寺山门 ←\"\n" +
            "\t})\n" +
            "},\n" +
            "{\n" +
            "\tname: \"雪山练武场\",\n" +
            "\t//地图名称text: Array(\"有几个雪山弟子在练习\",\n" +
            "\t\"东：雪山寺山门\"),\n" +
            "\t//描述判定npc: Array(\"达而巴\",\n" +
            "\t\"葛伦布\"),\n" +
            "\t//npcdirection: Array(//可去路径{\n" +
            "\t\tname: \"雪山寺山门\",\n" +
            "\t\ttext: \"东：雪山寺山门 →\"\n" +
            "\t})\n" +
            "},\n" +
            "{\n" +
            "\tname: \"雪山大殿\",\n" +
            "\t//地图名称text: Array(\"这里是雪山寺的大殿，中央供奉着佛祖塑像\",\n" +
            "\t\"南：雪山寺山门\"),\n" +
            "\t//描述判定npc: Array(\"血刀老祖\"),\n" +
            "\t//npcdirection: Array(//可去路径{\n" +
            "\t\tname: \"雪山大厅\",\n" +
            "\t\ttext: \"北：大厅 ↑\"\n" +
            "\t},\n" +
            "\t{\n" +
            "\t\tname: \"雪山西侧殿\",\n" +
            "\t\ttext: \"西：侧殿 ←\"\n" +
            "\t},\n" +
            "\t{\n" +
            "\t\tname: \"雪山东侧殿\",\n" +
            "\t\ttext: \"东：侧殿 →\"\n" +
            "\t},\n" +
            "\t{\n" +
            "\t\tname: \"雪山寺山门\",\n" +
            "\t\ttext: \"南：雪山寺山门 ↓\"\n" +
            "\t})\n" +
            "},\n" +
            "{\n" +
            "\tname: \"雪山东侧殿\",\n" +
            "\t//地图名称text: Array(\"这里是雪山寺的东侧殿。殿内有神态各异的十八罗汉塑像，金旒玉镶\",\n" +
            "\t\"西：大殿\"),\n" +
            "\t//描述判定npc: Array(\"拉章和尚\",\n" +
            "\t\"萨木和尚\"),\n" +
            "\t//npcdirection: Array(//可去路径{\n" +
            "\t\tname: \"雪山大殿\",\n" +
            "\t\ttext: \"西：大殿 ←\"\n" +
            "\t})\n" +
            "},\n" +
            "{\n" +
            "\tname: \"雪山西侧殿\",\n" +
            "\t//地图名称text: Array(\"这里是雪山寺的西侧殿。殿内有神态各异的十八罗汉塑像，金旒玉镶\",\n" +
            "\t\"东：大殿\"),\n" +
            "\t//描述判定npc: Array(\"贡唐仓国师\",\n" +
            "\t\"嘉木和尚\"),\n" +
            "\t//npcdirection: Array(//可去路径{\n" +
            "\t\tname: \"雪山大殿\",\n" +
            "\t\ttext: \"东：大殿 →\"\n" +
            "\t})\n" +
            "},\n" +
            "{\n" +
            "\tname: \"雪山大厅\",\n" +
            "\t//地图名称text: Array(\"这里比较冷清\",\n" +
            "\t\"南：大殿 ↓\",\n" +
            "\t\"西：藏经阁 ←\"),\n" +
            "\t//描述判定npc: Array(\"和尚\"),\n" +
            "\t//npcdirection: Array(//可去路径{\n" +
            "\t\tname: \"雪山走廊\",\n" +
            "\t\ttext: \"北：走廊 ↑\"\n" +
            "\t},\n" +
            "\t{\n" +
            "\t\tname: \"雪山藏经阁\",\n" +
            "\t\ttext: \"西：藏经阁 ←\"\n" +
            "\t},\n" +
            "\t{\n" +
            "\t\tname: \"雪山禅室\",\n" +
            "\t\ttext: \"东：禅室 →\"\n" +
            "\t},\n" +
            "\t{\n" +
            "\t\tname: \"雪山大殿\",\n" +
            "\t\ttext: \"南：大殿 ↓\"\n" +
            "\t})\n" +
            "},\n" +
            "{\n" +
            "\tname: \"雪山禅室\",\n" +
            "\t//地图名称text: Array(\"打座\",\n" +
            "\t\"西：大厅 ←\"),\n" +
            "\t//描述判定npc: Array(\"金轮法王\"),\n" +
            "\t//npcdirection: Array(//可去路径{\n" +
            "\t\tname: \"雪山大厅\",\n" +
            "\t\ttext: \"西：大厅 ←\"\n" +
            "\t})\n" +
            "},\n" +
            "{\n" +
            "\tname: \"雪山藏经阁\",\n" +
            "\t//地图名称text: Array(\"这里是雪山寺的藏经之处。书架上林林总总都是梵文典籍。你一个字也看不懂\",\n" +
            "\t\"东：大厅\"),\n" +
            "\t//描述判定npc: Array(\"和尚\"),\n" +
            "\t//npcdirection: Array(//可去路径{\n" +
            "\t\tname: \"雪山大厅\",\n" +
            "\t\ttext: \"东：大厅 →\"\n" +
            "\t})\n" +
            "},\n" +
            "{\n" +
            "\tname: \"雪山走廊\",\n" +
            "\t//地图名称text: Array(\"这里是雪山寺内的走廊，这里有点幽暗\",\n" +
            "\t\"南：大厅\",\n" +
            "\t\"西：天台\"),\n" +
            "\t//描述判定npc: Array(),\n" +
            "\t//npcdirection: Array(//可去路径{\n" +
            "\t\tname: \"雪山天台\",\n" +
            "\t\ttext: \"西：天台 ←\"\n" +
            "\t},\n" +
            "\t{\n" +
            "\t\tname: \"雪山密室\",\n" +
            "\t\ttext: \"东：密室 →\"\n" +
            "\t},\n" +
            "\t{\n" +
            "\t\tname: \"雪山大厅\",\n" +
            "\t\ttext: \"南：大厅 ↓\"\n" +
            "\t})\n" +
            "},\n" +
            "{\n" +
            "\tname: \"雪山天台\",\n" +
            "\t//地图名称text: Array(\"这里是雪山寺的高处。北边可见雄伟的大雪山，南边可以俯瞰美丽如镜的圣湖\",\n" +
            "\t\"东：走廊 →\"),\n" +
            "\t//描述判定npc: Array(\"鸠摩智\"),\n" +
            "\t//npcdirection: Array(//可去路径{\n" +
            "\t\tname: \"雪山走廊\",\n" +
            "\t\ttext: \"东：走廊 →\"\n" +
            "\t})\n" +
            "},\n" +
            "{\n" +
            "\tname: \"雪山密室\",\n" +
            "\t//地图名称text: Array(\"这是一条小房间。什么东西都没有\",\n" +
            "\t\"西：走廊 ←\"),\n" +
            "\t//描述判定npc: Array(),\n" +
            "\t//npcdirection: Array(//可去路径{\n" +
            "\t\tname: \"雪山走廊\",\n" +
            "\t\ttext: \"西：走廊 ←\"\n" +
            "\t})\n" +
            "},\n" +
            "//明教{\n" +
            "\tname: \"明教山门\",\n" +
            "\t//地图名称text: Array(\"一个巨大的天然石桥横跨在两片山壁之间\"),\n" +
            "\t//描述判定npc: Array(\"殷无禄\",\n" +
            "\t\"殷无福\",\n" +
            "\t\"殷无寿\"),\n" +
            "\t//npcdirection: Array(//可去路径{\n" +
            "\t\tname: \"明教青石阶[1]\",\n" +
            "\t\ttext: \"北：青石阶 ↑\"\n" +
            "\t},\n" +
            "\t{\n" +
            "\t\tname: \"昆仑山下\",\n" +
            "\t\ttext: \"南：昆仑山下 ↓\"\n" +
            "\t})\n" +
            "},\n" +
            "{\n" +
            "\tname: \"明教青石阶[1]\",\n" +
            "\t//地图名称text: Array(\"这里已是半山腰了，山路到这里更加陡峭\",\n" +
            "\t\"西：天字门\"),\n" +
            "\t//描述判定npc: Array(\"狂龙\",\n" +
            "\t\"张中\"),\n" +
            "\t//npcdirection: Array(//可去路径{\n" +
            "\t\tname: \"明教青石阶[2]\",\n" +
            "\t\ttext: \"北：青石阶 ↑\"\n" +
            "\t},\n" +
            "\t{\n" +
            "\t\tname: \"天字门\",\n" +
            "\t\ttext: \"西：天字门 ←\"\n" +
            "\t},\n" +
            "\t{\n" +
            "\t\tname: \"地字门\",\n" +
            "\t\ttext: \"东：地字门 →\"\n" +
            "\t},\n" +
            "\t{\n" +
            "\t\tname: \"明教山门\",\n" +
            "\t\ttext: \"南：明教山门 ↓\"\n" +
            "\t})\n" +
            "},\n" +
            "{\n" +
            "\tname: \"天字门\",\n" +
            "\t//地图名称text: Array(\"这里就是明教的天字门\"),\n" +
            "\t//描述判定npc: Array(\"向天\",\n" +
            "\t\"天字门教众\"),\n" +
            "\t//npcdirection: Array(//可去路径{\n" +
            "\t\tname: \"明教青石阶[1]\",\n" +
            "\t\ttext: \"东：青石阶 →\"\n" +
            "\t})\n" +
            "},\n" +
            "{\n" +
            "\tname: \"地字门\",\n" +
            "\t//地图名称text: Array(\"这里就是明教的地字门\"),\n" +
            "\t//描述判定npc: Array(\"地字门教众\"),\n" +
            "\t//npcdirection: Array(//可去路径{\n" +
            "\t\tname: \"明教青石阶[1]\",\n" +
            "\t\ttext: \"西：青石阶 ←\"\n" +
            "\t})\n" +
            "},\n" +
            "{\n" +
            "\tname: \"明教青石阶[2]\",\n" +
            "\t//地图名称text: Array(\"这里已是半山腰了，山路到这里更加陡峭\",\n" +
            "\t\"东：风字门\"),\n" +
            "\t//描述判定npc: Array(\"拓跋\",\n" +
            "\t\"周颠\"),\n" +
            "\t//npcdirection: Array(//可去路径{\n" +
            "\t\tname: \"明教青石大道[1]\",\n" +
            "\t\ttext: \"北：青石大道 ↑\"\n" +
            "\t},\n" +
            "\t{\n" +
            "\t\tname: \"雷字门\",\n" +
            "\t\ttext: \"西：雷字门 ←\"\n" +
            "\t},\n" +
            "\t{\n" +
            "\t\tname: \"风字门\",\n" +
            "\t\ttext: \"东：风字门 →\"\n" +
            "\t},\n" +
            "\t{\n" +
            "\t\tname: \"明教青石阶[1]\",\n" +
            "\t\ttext: \"南：青石阶 ↓\"\n" +
            "\t})\n" +
            "},\n" +
            "{\n" +
            "\tname: \"雷字门\",\n" +
            "\t//地图名称text: Array(\"这里就是明教的雷字门\"),\n" +
            "\t//描述判定npc: Array(\"雷字门教众\",\n" +
            "\t\"金刚\"),\n" +
            "\t//npcdirection: Array(//可去路径{\n" +
            "\t\tname: \"明教青石阶[2]\",\n" +
            "\t\ttext: \"东：青石阶 →\"\n" +
            "\t})\n" +
            "},\n" +
            "{\n" +
            "\tname: \"风字门\",\n" +
            "\t//地图名称text: Array(\"这里就是明教的风字门\"),\n" +
            "\t//描述判定npc: Array(\"风字门教众\"),\n" +
            "\t//npcdirection: Array(//可去路径{\n" +
            "\t\tname: \"明教青石阶[2]\",\n" +
            "\t\ttext: \"西：青石阶 ←\"\n" +
            "\t})\n" +
            "},\n" +
            "{\n" +
            "\tname: \"明教青石大道[1]\",\n" +
            "\t//地图名称text: Array(\"这是一条青石铺的大道，道路开阔\",\n" +
            "\t\"东：巨木旗\"),\n" +
            "\t//描述判定npc: Array(\"闻苍松\",\n" +
            "\t\"冷谦\"),\n" +
            "\t//npcdirection: Array(//可去路径{\n" +
            "\t\tname: \"明教青石大道[2]\",\n" +
            "\t\ttext: \"北：青石大道 ↑\"\n" +
            "\t},\n" +
            "\t{\n" +
            "\t\tname: \"烈火旗\",\n" +
            "\t\ttext: \"西：烈火旗 ←\"\n" +
            "\t},\n" +
            "\t{\n" +
            "\t\tname: \"巨木旗\",\n" +
            "\t\ttext: \"东：巨木旗 →\"\n" +
            "\t},\n" +
            "\t{\n" +
            "\t\tname: \"明教青石阶[2]\",\n" +
            "\t\ttext: \"南：青石阶 ↓\"\n" +
            "\t})\n" +
            "},\n" +
            "{\n" +
            "\tname: \"烈火旗\",\n" +
            "\t//地图名称text: Array(\"这里是烈火旗的大厅\"),\n" +
            "\t//描述判定npc: Array(\"烈火旗教众\",\n" +
            "\t\"辛然\"),\n" +
            "\t//npcdirection: Array(//可去路径{\n" +
            "\t\tname: \"明教青石大道[1]\",\n" +
            "\t\ttext: \"东：青石大道 →\"\n" +
            "\t})\n" +
            "},\n" +
            "{\n" +
            "\tname: \"巨木旗\",\n" +
            "\t//地图名称text: Array(\"这是巨木旗的大厅\"),\n" +
            "\t//描述判定npc: Array(\"巨木旗教众\"),\n" +
            "\t//npcdirection: Array(//可去路径{\n" +
            "\t\tname: \"明教青石大道[1]\",\n" +
            "\t\ttext: \"西：青石大道 ←\"\n" +
            "\t})\n" +
            "},\n" +
            "{\n" +
            "\tname: \"明教青石大道[2]\",\n" +
            "\t//地图名称text: Array(\"这是一条青石铺的大道，道路开阔\",\n" +
            "\t\"西：厚土旗\"),\n" +
            "\t//描述判定npc: Array(\"说不得\",\n" +
            "\t\"颜垣\"),\n" +
            "\t//npcdirection: Array(//可去路径{\n" +
            "\t\tname: \"锐金旗\",\n" +
            "\t\ttext: \"北：锐金旗 ↑\"\n" +
            "\t},\n" +
            "\t{\n" +
            "\t\tname: \"厚土旗\",\n" +
            "\t\ttext: \"西：厚土旗 ←\"\n" +
            "\t},\n" +
            "\t{\n" +
            "\t\tname: \"洪水旗\",\n" +
            "\t\ttext: \"东：洪水旗 →\"\n" +
            "\t},\n" +
            "\t{\n" +
            "\t\tname: \"明教青石大道[1]\",\n" +
            "\t\ttext: \"南：青石大道 ↓\"\n" +
            "\t})\n" +
            "},\n" +
            "{\n" +
            "\tname: \"厚土旗\",\n" +
            "\t//地图名称text: Array(\"这里是厚土旗的大厅\"),\n" +
            "\t//描述判定npc: Array(\"厚土旗教众\"),\n" +
            "\t//npcdirection: Array(//可去路径{\n" +
            "\t\tname: \"明教青石大道[2]\",\n" +
            "\t\ttext: \"东：青石大道 →\"\n" +
            "\t})\n" +
            "},\n" +
            "{\n" +
            "\tname: \"洪水旗\",\n" +
            "\t//地图名称text: Array(\"这里是洪水旗的大厅\"),\n" +
            "\t//描述判定npc: Array(\"唐洋\",\n" +
            "\t\"洪水旗教众\"),\n" +
            "\t//npcdirection: Array(//可去路径{\n" +
            "\t\tname: \"明教青石大道[2]\",\n" +
            "\t\ttext: \"西：青石大道 ←\"\n" +
            "\t})\n" +
            "},\n" +
            "{\n" +
            "\tname: \"锐金旗\",\n" +
            "\t//地图名称text: Array(\"这里是锐金旗的大厅\"),\n" +
            "\t//描述判定npc: Array(\"庄铮\",\n" +
            "\t\"彭莹玉\",\n" +
            "\t\"锐金旗教众\"),\n" +
            "\t//npcdirection: Array(//可去路径{\n" +
            "\t\tname: \"朱雀坛\",\n" +
            "\t\ttext: \"北：朱雀坛 ↑\"\n" +
            "\t},\n" +
            "\t{\n" +
            "\t\tname: \"神蛇坛\",\n" +
            "\t\ttext: \"西：神蛇坛 ←\"\n" +
            "\t},\n" +
            "\t{\n" +
            "\t\tname: \"青龙坛\",\n" +
            "\t\ttext: \"东：青龙坛 →\"\n" +
            "\t},\n" +
            "\t{\n" +
            "\t\tname: \"明教青石大道[2]\",\n" +
            "\t\ttext: \"南：青石大道 ↓\"\n" +
            "\t})\n" +
            "},\n" +
            "{\n" +
            "\tname: \"神蛇坛\",\n" +
            "\t//地图名称text: Array(\"这里就是明教的神蛇坛\"),\n" +
            "\t//描述判定npc: Array(\"神蛇坛教众\",\n" +
            "\t\"封弓影\"),\n" +
            "\t//npcdirection: Array(//可去路径{\n" +
            "\t\tname: \"锐金旗\",\n" +
            "\t\ttext: \"东：锐金旗 →\"\n" +
            "\t})\n" +
            "},\n" +
            "{\n" +
            "\tname: \"青龙坛\",\n" +
            "\t//地图名称text: Array(\"这里就是明教的青龙坛\"),\n" +
            "\t//描述判定npc: Array(\"程嘲风\",\n" +
            "\t\"韦一笑\",\n" +
            "\t\"青龙坛教众\"),\n" +
            "\t//npcdirection: Array(//可去路径{\n" +
            "\t\tname: \"锐金旗\",\n" +
            "\t\ttext: \"西：锐金旗 ←\"\n" +
            "\t})\n" +
            "},\n" +
            "{\n" +
            "\tname: \"朱雀坛\",\n" +
            "\t//地图名称text: Array(\"这里就是明教的朱雀坛\"),\n" +
            "\t//描述判定npc: Array(\"常金鹏\",\n" +
            "\t\"朱雀坛教众\"),\n" +
            "\t//npcdirection: Array(//可去路径{\n" +
            "\t\tname: \"天微堂\",\n" +
            "\t\ttext: \"北：天微堂 ↑\"\n" +
            "\t},\n" +
            "\t{\n" +
            "\t\tname: \"白虎坛\",\n" +
            "\t\ttext: \"西：白虎坛 ←\"\n" +
            "\t},\n" +
            "\t{\n" +
            "\t\tname: \"玄武坛\",\n" +
            "\t\ttext: \"东：玄武坛 →\"\n" +
            "\t},\n" +
            "\t{\n" +
            "\t\tname: \"锐金旗\",\n" +
            "\t\ttext: \"南：锐金旗 ↓\"\n" +
            "\t})\n" +
            "},\n" +
            "{\n" +
            "\tname: \"白虎坛\",\n" +
            "\t//地图名称text: Array(\"这里就是明教的白虎坛\"),\n" +
            "\t//描述判定npc: Array(\"高山王\",\n" +
            "\t\"白虎坛教众\"),\n" +
            "\t//npcdirection: Array(//可去路径{\n" +
            "\t\tname: \"朱雀坛\",\n" +
            "\t\ttext: \"东：朱雀坛 →\"\n" +
            "\t})\n" +
            "},\n" +
            "{\n" +
            "\tname: \"玄武坛\",\n" +
            "\t//地图名称text: Array(\"这里就是明教的玄武坛\"),\n" +
            "\t//描述判定npc: Array(\"白龟寿\",\n" +
            "\t\"玄武坛教众\"),\n" +
            "\t//npcdirection: Array(//可去路径{\n" +
            "\t\tname: \"朱雀坛\",\n" +
            "\t\ttext: \"西：朱雀坛 ←\"\n" +
            "\t})\n" +
            "},\n" +
            "{\n" +
            "\tname: \"天微堂\",\n" +
            "\t//地图名称text: Array(\"这里就是明教的天微堂\"),\n" +
            "\t//描述判定npc: Array(\"殷野王\",\n" +
            "\t\"巫士\"),\n" +
            "\t//npcdirection: Array(//可去路径{\n" +
            "\t\tname: \"明教大殿\",\n" +
            "\t\ttext: \"北：明教大殿\"\n" +
            "\t},\n" +
            "\t{\n" +
            "\t\tname: \"紫微堂\",\n" +
            "\t\ttext: \"西：紫微堂 ←\"\n" +
            "\t},\n" +
            "\t{\n" +
            "\t\tname: \"天市堂\",\n" +
            "\t\ttext: \"东：天市堂 →\"\n" +
            "\t},\n" +
            "\t{\n" +
            "\t\tname: \"朱雀坛\",\n" +
            "\t\ttext: \"南：朱雀坛 ↓\"\n" +
            "\t})\n" +
            "},\n" +
            "{\n" +
            "\tname: \"紫微堂\",\n" +
            "\t//地图名称text: Array(\"这里就是明教的紫微堂\"),\n" +
            "\t//描述判定npc: Array(\"殷天正\",\n" +
            "\t\"谢逊\"),\n" +
            "\t//npcdirection: Array(//可去路径{\n" +
            "\t\tname: \"天微堂\",\n" +
            "\t\ttext: \"东：天微堂 →\"\n" +
            "\t})\n" +
            "},\n" +
            "{\n" +
            "\tname: \"天市堂\",\n" +
            "\t//地图名称text: Array(\"你一进入明教的天市堂\"),\n" +
            "\t//描述判定npc: Array(\"胡青牛\",\n" +
            "\t\"李天垣\"),\n" +
            "\t//npcdirection: Array(//可去路径{\n" +
            "\t\tname: \"天微堂\",\n" +
            "\t\ttext: \"西：天微堂 ←\"\n" +
            "\t})\n" +
            "},\n" +
            "{\n" +
            "\tname: \"明教大殿\",\n" +
            "\t//地图名称text: Array(\"大殿十分空旷，正中宝座后立有一扇玉屏\"),\n" +
            "\t//描述判定npc: Array(\"张无忌\",\n" +
            "\t\"杨逍\",\n" +
            "\t\"范遥\"),\n" +
            "\t//npcdirection: Array(//可去路径{\n" +
            "\t\tname: \"天微堂\",\n" +
            "\t\ttext: \"南：天微堂 ↓\"\n" +
            "\t})\n" +
            "},\n" +
            "//神教数据{\n" +
            "\tname: \"神教圣地\",\n" +
            "\t//地图名称text: Array(\"这是任务开始的地方也是任务结束的地方\",\n" +
            "\t\"南：大理北门 ↓\"),\n" +
            "\t//描述判定npc: Array(\"守寺僧兵\",\n" +
            "\t\"喇嘛\"),\n" +
            "\t//npcdirection: Array(//可去路径{\n" +
            "\t\tname: \"不倒石\",\n" +
            "\t\ttext: \"西：不倒石 ←\"\n" +
            "\t},\n" +
            "\t{\n" +
            "\t\tname: \"大理北门\",\n" +
            "\t\ttext: \"南：大理北门 ↓\"\n" +
            "\t})\n" +
            "},\n" +
            "{\n" +
            "\tname: \"不倒石\",\n" +
            "\t//地图名称text: Array(\"一块巨大的石头，头大底小\",\n" +
            "\t\"北：千年古松\"),\n" +
            "\t//描述判定npc: Array(\"圣教教徒小兵\",\n" +
            "\t\"圣教教徒门卫\"),\n" +
            "\t//npcdirection: Array(//可去路径{\n" +
            "\t\tname: \"千年古松\",\n" +
            "\t\ttext: \"北：千年古松 ↑\"\n" +
            "\t},\n" +
            "\t{\n" +
            "\t\tname: \"圣教入口\",\n" +
            "\t\ttext: \"西：圣教入口 ←\"\n" +
            "\t},\n" +
            "\t{\n" +
            "\t\tname: \"神教圣地\",\n" +
            "\t\ttext: \"东：神教圣地 →\"\n" +
            "\t})\n" +
            "},\n" +
            "{\n" +
            "\tname: \"千年古松\",\n" +
            "\t//地图名称text: Array(\"一棵巨大的松树\",\n" +
            "\t\"北：黄龙瀑布\",\n" +
            "\t\"南：不倒石\"),\n" +
            "\t//描述判定npc: Array(\"圣教教徒使者\"),\n" +
            "\t//npcdirection: Array(//可去路径{\n" +
            "\t\tname: \"黄龙瀑布\",\n" +
            "\t\ttext: \"北：黄龙瀑布 ↑\"\n" +
            "\t},\n" +
            "\t{\n" +
            "\t\tname: \"不倒石\",\n" +
            "\t\ttext: \"南：不倒石 ↓\"\n" +
            "\t})\n" +
            "},\n" +
            "{\n" +
            "\tname: \"圣教入口\",\n" +
            "\t//地图名称text: Array(\"进入日月神教的大门\",\n" +
            "\t\"东：不倒石\"),\n" +
            "\t//描述判定npc: Array(\"圣教教徒门卫\",\n" +
            "\t\"圣教教徒卫士\"),\n" +
            "\t//npcdirection: Array(//可去路径{\n" +
            "\t\tname: \"神教大门\",\n" +
            "\t\ttext: \"西：神教大门 ←\"\n" +
            "\t},\n" +
            "\t{\n" +
            "\t\tname: \"不倒石\",\n" +
            "\t\ttext: \"东：不倒石 →\"\n" +
            "\t})\n" +
            "},\n" +
            "{\n" +
            "\tname: \"神教大门\",\n" +
            "\t//地图名称text: Array(\"日月神教红色的大门\",\n" +
            "\t\"西：神教大堂\"),\n" +
            "\t//描述判定npc: Array(\"圣教教徒使者\"),\n" +
            "\t//npcdirection: Array(//可去路径{\n" +
            "\t\tname: \"神教大堂\",\n" +
            "\t\ttext: \"西：神教大堂 ←\"\n" +
            "\t},\n" +
            "\t{\n" +
            "\t\tname: \"圣教入口\",\n" +
            "\t\ttext: \"东：圣教入口 →\"\n" +
            "\t})\n" +
            "},\n" +
            "{\n" +
            "\tname: \"神教大堂\",\n" +
            "\t//地图名称text: Array(\"一间巨大的屋子\",\n" +
            "\t\"东：神教大门\"),\n" +
            "\t//描述判定npc: Array(\"圣教教徒使者\"),\n" +
            "\t//npcdirection: Array(//可去路径{\n" +
            "\t\tname: \"神教大门\",\n" +
            "\t\ttext: \"东：神教大门 →\"\n" +
            "\t},\n" +
            "\t{\n" +
            "\t\tname: \"神教正厅\",\n" +
            "\t\ttext: \"南：神教正厅 ↓\"\n" +
            "\t})\n" +
            "},\n" +
            "{\n" +
            "\tname: \"神教正厅\",\n" +
            "\t//地图名称text: Array(\"北：神教大堂\",\n" +
            "\t\"一间巨大的屋子\"),\n" +
            "\t//描述判定npc: Array(\"杨莲亭\",\n" +
            "\t\"范松\"),\n" +
            "\t//npcdirection: Array(//可去路径{\n" +
            "\t\tname: \"神教大堂\",\n" +
            "\t\ttext: \"北：神教大堂 ↑\"\n" +
            "\t},\n" +
            "\t{\n" +
            "\t\tname: \"神教一厅\",\n" +
            "\t\ttext: \"南：神教一厅 ↓\"\n" +
            "\t})\n" +
            "},\n" +
            "{\n" +
            "\tname: \"神教一厅\",\n" +
            "\t//地图名称text: Array(\"一个漆黑的大厅\",\n" +
            "\t\"北：神教正厅\"),\n" +
            "\t//描述判定npc: Array(\"向问天\",\n" +
            "\t\"赵鹤\"),\n" +
            "\t//npcdirection: Array(//可去路径{\n" +
            "\t\tname: \"神教正厅\",\n" +
            "\t\ttext: \"北：神教正厅 ↑\"\n" +
            "\t},\n" +
            "\t{\n" +
            "\t\tname: \"神教二厅\",\n" +
            "\t\ttext: \"东：神教二厅 →\"\n" +
            "\t})\n" +
            "},\n" +
            "{\n" +
            "\tname: \"神教二厅\",\n" +
            "\t//地图名称text: Array(\"一个漆黑的大厅\",\n" +
            "\t\"西：神教一厅\"),\n" +
            "\t//描述判定npc: Array(\"上官云\",\n" +
            "\t\"王诚\"),\n" +
            "\t//npcdirection: Array(//可去路径{\n" +
            "\t\tname: \"神教一厅\",\n" +
            "\t\ttext: \"西：神教一厅 ←\"\n" +
            "\t},\n" +
            "\t{\n" +
            "\t\tname: \"神教三厅\",\n" +
            "\t\ttext: \"东：神教三厅 →\"\n" +
            "\t})\n" +
            "},\n" +
            "{\n" +
            "\tname: \"神教三厅\",\n" +
            "\t//地图名称text: Array(\"一个漆黑的大厅\",\n" +
            "\t\"西：神教二厅\"),\n" +
            "\t//描述判定npc: Array(\"童百熊\"),\n" +
            "\t//npcdirection: Array(//可去路径{\n" +
            "\t\tname: \"神教二厅\",\n" +
            "\t\ttext: \"西：神教二厅 ←\"\n" +
            "\t},\n" +
            "\t{\n" +
            "\t\tname: \"神教后堂\",\n" +
            "\t\ttext: \"东：神教后堂 →\"\n" +
            "\t})\n" +
            "},\n" +
            "{\n" +
            "\tname: \"神教后堂\",\n" +
            "\t//地图名称text: Array(\"一个漆黑的大厅\",\n" +
            "\t\"西：神教三厅\"),\n" +
            "\t//描述判定npc: Array(\"桑三娘\"),\n" +
            "\t//npcdirection: Array(//可去路径{\n" +
            "\t\tname: \"圣教小路2\",\n" +
            "\t\ttext: \"北：圣教小路2 ↑\"\n" +
            "\t},\n" +
            "\t{\n" +
            "\t\tname: \"神教三厅\",\n" +
            "\t\ttext: \"西：神教三厅 ←\"\n" +
            "\t})\n" +
            "},\n" +
            "{\n" +
            "\tname: \"圣教小路2\",\n" +
            "\t//地图名称text: Array(\"一条阴森的小路，路边站着几个卫士正在看着你。\",\n" +
            "\t\"南：神教后堂\"),\n" +
            "\t//描述判定npc: Array(\"蓝凤凰\"),\n" +
            "\t//npcdirection: Array(//可去路径{\n" +
            "\t\tname: \"圣教小路1\",\n" +
            "\t\ttext: \"西：圣教小路1 ←\"\n" +
            "\t},\n" +
            "\t{\n" +
            "\t\tname: \"圣教小路3\",\n" +
            "\t\ttext: \"东：圣教小路3 →\"\n" +
            "\t},\n" +
            "\t{\n" +
            "\t\tname: \"神教后堂\",\n" +
            "\t\ttext: \"南：神教后堂 ↓\"\n" +
            "\t})\n" +
            "},\n" +
            "{\n" +
            "\tname: \"圣教小路1\",\n" +
            "\t//地图名称text: Array(\"一条阴森的小路，路边站着几个卫士正在看着你。\",\n" +
            "\t\"东：圣教小路2\"),\n" +
            "\t//描述判定npc: Array(\"张乘风\"),\n" +
            "\t//npcdirection: Array(//可去路径{\n" +
            "\t\tname: \"圣教密室1\",\n" +
            "\t\ttext: \"西：圣教密室1 ←\"\n" +
            "\t},\n" +
            "\t{\n" +
            "\t\tname: \"圣教小路2\",\n" +
            "\t\ttext: \"东：圣教小路2 →\"\n" +
            "\t})\n" +
            "},\n" +
            "{\n" +
            "\tname: \"圣教密室1\",\n" +
            "\t//地图名称text: Array(\"圣教小路的尽头，屋子里放着一些奇怪的物品\",\n" +
            "\t\"东：圣教小路1\"),\n" +
            "\t//描述判定npc: Array(\"圣教教徒丫鬟\",\n" +
            "\t\"任盈盈\"),\n" +
            "\t//npcdirection: Array(//可去路径{\n" +
            "\t\tname: \"圣教小路1\",\n" +
            "\t\ttext: \"东：圣教小路1 →\"\n" +
            "\t})\n" +
            "},\n" +
            "{\n" +
            "\tname: \"圣教小路3\",\n" +
            "\t//地图名称text: Array(\"一条阴森的小路，路边站着几个卫士正在看着你。\",\n" +
            "\t\"西：圣教小路2 ←\"),\n" +
            "\t//描述判定npc: Array(\"圣教教徒丫鬟\",\n" +
            "\t\"温青青\"),\n" +
            "\t//npcdirection: Array(//可去路径{\n" +
            "\t\tname: \"圣教小路2\",\n" +
            "\t\ttext: \"西：圣教小路2 ←\"\n" +
            "\t},\n" +
            "\t{\n" +
            "\t\tname: \"圣教密室2\",\n" +
            "\t\ttext: \"东：圣教密室2 →\"\n" +
            "\t},\n" +
            "\t{\n" +
            "\t\tname: \"神教祭坛\",\n" +
            "\t\ttext: \"南：神教祭坛 ↓\"\n" +
            "\t})\n" +
            "},\n" +
            "{\n" +
            "\tname: \"神教祭坛\",\n" +
            "\t//地图名称text: Array(\"一个很大的广场，广场周围是几个巨大的圆盘。\",\n" +
            "\t\"北：圣教小路3\"),\n" +
            "\t//描述判定npc: Array(\"贾布\"),\n" +
            "\t//npcdirection: Array(//可去路径{\n" +
            "\t\tname: \"圣教小路3\",\n" +
            "\t\ttext: \"北：圣教小路3 ↑\"\n" +
            "\t},\n" +
            "\t{\n" +
            "\t\tname: \"通天神石\",\n" +
            "\t\ttext: \"东：通天神石 →\"\n" +
            "\t})\n" +
            "},\n" +
            "{\n" +
            "\tname: \"通天神石\",\n" +
            "\t//地图名称text: Array(\"一块巨大的石头一直伸向空中\",\n" +
            "\t\"西：神教祭坛 ←\"),\n" +
            "\t//描述判定npc: Array(\"何红药\"),\n" +
            "\t//npcdirection: Array(//可去路径{\n" +
            "\t\tname: \"神教祭坛\",\n" +
            "\t\ttext: \"西：神教祭坛 ←\"\n" +
            "\t},\n" +
            "\t{\n" +
            "\t\tname: \"日月神石\",\n" +
            "\t\ttext: \"东：日月神石 →\"\n" +
            "\t})\n" +
            "},\n" +
            "{\n" +
            "\tname: \"日月神石\",\n" +
            "\t//地图名称text: Array(\"日月神教的圣物，据说可以保佑\",\n" +
            "\t\"西：通天神石 ←\"),\n" +
            "\t//描述判定npc: Array(\"黄钟公\"),\n" +
            "\t//npcdirection: Array(//可去路径{\n" +
            "\t\tname: \"玄月石门\",\n" +
            "\t\ttext: \"北：玄月石门 ↑\"\n" +
            "\t},\n" +
            "\t{\n" +
            "\t\tname: \"通天神石\",\n" +
            "\t\ttext: \"西：通天神石 ←\"\n" +
            "\t},\n" +
            "\t{\n" +
            "\t\tname: \"九龙瀑布\",\n" +
            "\t\ttext: \"东：九龙瀑布 →\"\n" +
            "\t})\n" +
            "},\n" +
            "{\n" +
            "\tname: \"九龙瀑布\",\n" +
            "\t//地图名称text: Array(\"巨大的瀑布中央有九条水柱，好似九条龙\",\n" +
            "\t\"西：日月神石\"),\n" +
            "\t//描述判定npc: Array(\"圣教教徒卫士\",\n" +
            "\t\"圣教教徒门卫\"),\n" +
            "\t//npcdirection: Array(//可去路径{\n" +
            "\t\tname: \"日月神石\",\n" +
            "\t\ttext: \"西：日月神石 ←\"\n" +
            "\t},\n" +
            "\t{\n" +
            "\t\tname: \"穿涯洞3\",\n" +
            "\t\ttext: \"东：穿涯洞3 →\"\n" +
            "\t})\n" +
            "},\n" +
            "{\n" +
            "\tname: \"穿涯洞3\",\n" +
            "\t//地图名称text: Array(\"一条阴森漆黑的山洞，没有光亮\",\n" +
            "\t\"西：九龙瀑布\"),\n" +
            "\t//描述判定npc: Array(\"圣教教徒小兵\"),\n" +
            "\t//npcdirection: Array(//可去路径{\n" +
            "\t\tname: \"穿涯洞2\",\n" +
            "\t\ttext: \"北：穿涯洞2 ↑\"\n" +
            "\t},\n" +
            "\t{\n" +
            "\t\tname: \"九龙瀑布\",\n" +
            "\t\ttext: \"西：九龙瀑布 ←\"\n" +
            "\t})\n" +
            "},\n" +
            "{\n" +
            "\tname: \"穿涯洞2\",\n" +
            "\t//地图名称text: Array(\"一条阴森漆黑的山洞，没有光亮\",\n" +
            "\t\"北：穿涯洞1 ↑\"),\n" +
            "\t//描述判定npc: Array(\"圣教教徒小兵\"),\n" +
            "\t//npcdirection: Array(//可去路径{\n" +
            "\t\tname: \"穿涯洞1\",\n" +
            "\t\ttext: \"北：穿涯洞1 ↑\"\n" +
            "\t},\n" +
            "\t{\n" +
            "\t\tname: \"穿涯洞3\",\n" +
            "\t\ttext: \"南：穿涯洞3 ↓\"\n" +
            "\t})\n" +
            "},\n" +
            "{\n" +
            "\tname: \"穿涯洞1\",\n" +
            "\t//地图名称text: Array(\"一条阴森漆黑的山洞，没有光亮\",\n" +
            "\t\"北：穿涯洞尽头 ↑\"),\n" +
            "\t//描述判定npc: Array(\"圣教教徒小兵\"),\n" +
            "\t//npcdirection: Array(//可去路径{\n" +
            "\t\tname: \"穿涯洞尽头\",\n" +
            "\t\ttext: \"北：穿涯洞尽头 ↑\"\n" +
            "\t},\n" +
            "\t{\n" +
            "\t\tname: \"穿涯洞2\",\n" +
            "\t\ttext: \"南：穿涯洞2 ↓\"\n" +
            "\t})\n" +
            "},\n" +
            "{\n" +
            "\tname: \"穿涯洞尽头\",\n" +
            "\t//地图名称text: Array(\"一条阴森漆黑的山洞，没有光亮\",\n" +
            "\t\"东：一线天 →\"),\n" +
            "\t//描述判定npc: Array(),\n" +
            "\t//npcdirection: Array(//可去路径{\n" +
            "\t\tname: \"圣教一线天\",\n" +
            "\t\ttext: \"东：一线天 →\"\n" +
            "\t},\n" +
            "\t{\n" +
            "\t\tname: \"穿涯洞1\",\n" +
            "\t\ttext: \"南：穿涯洞1 ↓\"\n" +
            "\t})\n" +
            "},\n" +
            "{\n" +
            "\tname: \"圣教一线天\",\n" +
            "\t//地图名称text: Array(\"一条一人宽的小路，抬头只能看见一丝阳光\",\n" +
            "\t\"北：无字石崖 ↑\"),\n" +
            "\t//描述判定npc: Array(),\n" +
            "\t//npcdirection: Array(//可去路径{\n" +
            "\t\tname: \"无字石崖\",\n" +
            "\t\ttext: \"北：无字石崖 ↑\"\n" +
            "\t},\n" +
            "\t{\n" +
            "\t\tname: \"穿涯洞尽头\",\n" +
            "\t\ttext: \"西：穿涯洞尽头 ←\"\n" +
            "\t})\n" +
            "},\n" +
            "{\n" +
            "\tname: \"无字石崖\",\n" +
            "\t//地图名称text: Array(\"数万丈深的悬崖绝壁，没有人知道崖下到低有没有尽头\",\n" +
            "\t\"南：一线天 ↓\"),\n" +
            "\t//描述判定npc: Array(),\n" +
            "\t//npcdirection: Array(//可去路径{\n" +
            "\t\tname: \"圣教一线天\",\n" +
            "\t\ttext: \"南：一线天 ↓\"\n" +
            "\t})\n" +
            "},\n" +
            "{\n" +
            "\tname: \"玄月石门\",\n" +
            "\t//地图名称text: Array(\"巨大的石头好似是一个石门\",\n" +
            "\t\"南：日月神石\"),\n" +
            "\t//描述判定npc: Array(\"圣教教徒随从\"),\n" +
            "\t//npcdirection: Array(//可去路径{\n" +
            "\t\tname: \"玄月石\",\n" +
            "\t\ttext: \"东：玄月石 →\"\n" +
            "\t},\n" +
            "\t{\n" +
            "\t\tname: \"日月神石\",\n" +
            "\t\ttext: \"南：日月神石 ↓\"\n" +
            "\t})\n" +
            "},\n" +
            "{\n" +
            "\tname: \"玄月石\",\n" +
            "\t//地图名称text: Array(\"一块巨大的神石挡住了你的去路\",\n" +
            "\t\"西：玄月石门\"),\n" +
            "\t//描述判定npc: Array(\"贡唐仓国师\",\n" +
            "\t\"嘉木活佛\"),\n" +
            "\t//npcdirection: Array(//可去路径{\n" +
            "\t\tname: \"玄月台\",\n" +
            "\t\ttext: \"北：玄月台 ↑\"\n" +
            "\t},\n" +
            "\t{\n" +
            "\t\tname: \"玄月石门\",\n" +
            "\t\ttext: \"西：玄月石门 ←\"\n" +
            "\t})\n" +
            "},\n" +
            "{\n" +
            "\tname: \"玄月台\",\n" +
            "\t//地图名称text: Array(\"传说是一位很有名的武林人士\",\n" +
            "\t\"南：玄月石\"),\n" +
            "\t//描述判定npc: Array(\"喇嘛\"),\n" +
            "\t//npcdirection: Array(//可去路径{\n" +
            "\t\tname: \"玄月峰\",\n" +
            "\t\ttext: \"西：玄月峰 ←\"\n" +
            "\t},\n" +
            "\t{\n" +
            "\t\tname: \"玄月石\",\n" +
            "\t\ttext: \"南：玄月石 ↓\"\n" +
            "\t})\n" +
            "},\n" +
            "{\n" +
            "\tname: \"玄月峰\",\n" +
            "\t//地图名称text: Array(\"传说是一位很有名的武林人士\",\n" +
            "\t\"东：玄月台\"),\n" +
            "\t//描述判定npc: Array(\"圣教教徒随从\"),\n" +
            "\t//npcdirection: Array(//可去路径{\n" +
            "\t\tname: \"紫萧石\",\n" +
            "\t\ttext: \"北：紫萧石 ↑\"\n" +
            "\t},\n" +
            "\t{\n" +
            "\t\tname: \"玄月台\",\n" +
            "\t\ttext: \"东：玄月台 →\"\n" +
            "\t})\n" +
            "},\n" +
            "{\n" +
            "\tname: \"紫萧石\",\n" +
            "\t//地图名称text: Array(\"一位武林高人\",\n" +
            "\t\"南：玄月峰 ↓\"),\n" +
            "\t//描述判定npc: Array(\"圣教教徒随从\"),\n" +
            "\t//npcdirection: Array(//可去路径{\n" +
            "\t\tname: \"紫萧峰\",\n" +
            "\t\ttext: \"东：紫萧峰 →\"\n" +
            "\t},\n" +
            "\t{\n" +
            "\t\tname: \"玄月峰\",\n" +
            "\t\ttext: \"南：玄月峰 ↓\"\n" +
            "\t})\n" +
            "},\n" +
            "{\n" +
            "\tname: \"紫萧峰\",\n" +
            "\t//地图名称text: Array(\"一位武林高人\",\n" +
            "\t\"西：紫萧石 ←\"),\n" +
            "\t//描述判定npc: Array(),\n" +
            "\t//npcdirection: Array(//可去路径{\n" +
            "\t\tname: \"和元观\",\n" +
            "\t\ttext: \"北：和元观 ↑\"\n" +
            "\t},\n" +
            "\t{\n" +
            "\t\tname: \"紫萧石\",\n" +
            "\t\ttext: \"西：紫萧石 ←\"\n" +
            "\t})\n" +
            "},\n" +
            "{\n" +
            "\tname: \"和元观\",\n" +
            "\t//地图名称text: Array(\"一位武林高人\",\n" +
            "\t\"南：紫萧峰 ↓\"),\n" +
            "\t//描述判定npc: Array(),\n" +
            "\t//npcdirection: Array(//可去路径{\n" +
            "\t\tname: \"玄月仙山\",\n" +
            "\t\ttext: \"北：玄月仙山 ↑\"\n" +
            "\t},\n" +
            "\t{\n" +
            "\t\tname: \"紫萧峰\",\n" +
            "\t\ttext: \"南：紫萧峰 ↓\"\n" +
            "\t})\n" +
            "},\n" +
            "{\n" +
            "\tname: \"玄月仙山\",\n" +
            "\t//地图名称text: Array(\"一位武林高人\",\n" +
            "\t\"南：和元观 ↓\"),\n" +
            "\t//描述判定npc: Array(\"圣教教徒打手\"),\n" +
            "\t//npcdirection: Array(//可去路径{\n" +
            "\t\tname: \"长方岭\",\n" +
            "\t\ttext: \"北：长方岭 ↑\"\n" +
            "\t},\n" +
            "\t{\n" +
            "\t\tname: \"和元观\",\n" +
            "\t\ttext: \"南：和元观 ↓\"\n" +
            "\t})\n" +
            "},\n" +
            "{\n" +
            "\tname: \"长方岭\",\n" +
            "\t//地图名称text: Array(\"一条山岭绵延到远方\",\n" +
            "\t\"南：玄月仙山\"),\n" +
            "\t//描述判定npc: Array(),\n" +
            "\t//npcdirection: Array(//可去路径{\n" +
            "\t\tname: \"半金岩\",\n" +
            "\t\ttext: \"北：半金岩 ↑\"\n" +
            "\t},\n" +
            "\t{\n" +
            "\t\tname: \"上院山门\",\n" +
            "\t\ttext: \"西：上院山门 ←\"\n" +
            "\t},\n" +
            "\t{\n" +
            "\t\tname: \"玄月仙山\",\n" +
            "\t\ttext: \"南：玄月仙山 ↓\"\n" +
            "\t})\n" +
            "},\n" +
            "{\n" +
            "\tname: \"半金岩\",\n" +
            "\t//地图名称text: Array(\"黄金一样的岩石\",\n" +
            "\t\"南：长方岭\"),\n" +
            "\t//描述判定npc: Array(),\n" +
            "\t//npcdirection: Array(//可去路径{\n" +
            "\t\tname: \"磨针井\",\n" +
            "\t\ttext: \"北：磨针井 ↑\"\n" +
            "\t},\n" +
            "\t{\n" +
            "\t\tname: \"长方岭\",\n" +
            "\t\ttext: \"南：长方岭 ↓\"\n" +
            "\t})\n" +
            "},\n" +
            "{\n" +
            "\tname: \"磨针井\",\n" +
            "\t//地图名称text: Array(\"一口深井，井边有许多条细沟，据说是针磨出来的\",\n" +
            "\t\"南：半金岩\"),\n" +
            "\t//描述判定npc: Array(),\n" +
            "\t//npcdirection: Array(//可去路径{\n" +
            "\t\tname: \"太子庙\",\n" +
            "\t\ttext: \"北：太子庙 ↑\"\n" +
            "\t},\n" +
            "\t{\n" +
            "\t\tname: \"半金岩\",\n" +
            "\t\ttext: \"南：半金岩 ↓\"\n" +
            "\t})\n" +
            "},\n" +
            "{\n" +
            "\tname: \"太子庙\",\n" +
            "\t//地图名称text: Array(\"祭奠太子千岁的小庙。\",\n" +
            "\t\"南：磨针井\"),\n" +
            "\t//描述判定npc: Array(),\n" +
            "\t//npcdirection: Array(//可去路径{\n" +
            "\t\tname: \"太子坡\",\n" +
            "\t\ttext: \"北：太子坡 ↑\"\n" +
            "\t},\n" +
            "\t{\n" +
            "\t\tname: \"娘娘庙\",\n" +
            "\t\ttext: \"西：娘娘庙 ←\"\n" +
            "\t},\n" +
            "\t{\n" +
            "\t\tname: \"磨针井\",\n" +
            "\t\ttext: \"南：磨针井 ↓\"\n" +
            "\t})\n" +
            "},\n" +
            "{\n" +
            "\tname: \"娘娘庙\",\n" +
            "\t//地图名称text: Array(\"祭奠王母娘娘的小庙。\",\n" +
            "\t\"东：太子庙\"),\n" +
            "\t//描述判定npc: Array(\"圣教教徒卫士\"),\n" +
            "\t//npcdirection: Array(//可去路径{\n" +
            "\t\tname: \"龙神庙\",\n" +
            "\t\ttext: \"西：龙神庙 ←\"\n" +
            "\t},\n" +
            "\t{\n" +
            "\t\tname: \"太子庙\",\n" +
            "\t\ttext: \"东：太子庙 →\"\n" +
            "\t})\n" +
            "},\n" +
            "{\n" +
            "\tname: \"龙神庙\",\n" +
            "\t//地图名称text: Array(\"祭奠龙神的小庙\",\n" +
            "\t\"东：娘娘庙\"),\n" +
            "\t//描述判定npc: Array(),\n" +
            "\t//npcdirection: Array(//可去路径{\n" +
            "\t\tname: \"妙壁生花\",\n" +
            "\t\ttext: \"西：妙壁生花 ←\"\n" +
            "\t},\n" +
            "\t{\n" +
            "\t\tname: \"娘娘庙\",\n" +
            "\t\ttext: \"东：娘娘庙 →\"\n" +
            "\t})\n" +
            "},\n" +
            "{\n" +
            "\tname: \"妙壁生花\",\n" +
            "\t//地图名称text: Array(\"一块美丽的石壁\",\n" +
            "\t\"东：龙神庙\"),\n" +
            "\t//描述判定npc: Array(),\n" +
            "\t//npcdirection: Array(//可去路径{\n" +
            "\t\tname: \"神石守山\",\n" +
            "\t\ttext: \"西：神石守山 ←\"\n" +
            "\t},\n" +
            "\t{\n" +
            "\t\tname: \"龙神庙\",\n" +
            "\t\ttext: \"东：龙神庙 →\"\n" +
            "\t})\n" +
            "},\n" +
            "{\n" +
            "\tname: \"神石守山\",\n" +
            "\t//地图名称text: Array(\"一块巨大的岩石，正好卡在两山的中间\",\n" +
            "\t\"东：妙壁生花\"),\n" +
            "\t//描述判定npc: Array(),\n" +
            "\t//npcdirection: Array(//可去路径{\n" +
            "\t\tname: \"妙壁生花\",\n" +
            "\t\ttext: \"东：妙壁生花 →\"\n" +
            "\t},\n" +
            "\t{\n" +
            "\t\tname: \"擎天巨松\",\n" +
            "\t\ttext: \"南：擎天巨松 ↓\"\n" +
            "\t})\n" +
            "},\n" +
            "{\n" +
            "\tname: \"擎天巨松\",\n" +
            "\t//地图名称text: Array(\"一棵巨大的松树，巨大的树枝伸向远方\",\n" +
            "\t\"北：神石守山 ↑\"),\n" +
            "\t//描述判定npc: Array(),\n" +
            "\t//npcdirection: Array(//可去路径{\n" +
            "\t\tname: \"神石守山\",\n" +
            "\t\ttext: \"北：神石守山 ↑\"\n" +
            "\t},\n" +
            "\t{\n" +
            "\t\tname: \"过仙桥\",\n" +
            "\t\ttext: \"西：过仙桥 ←\"\n" +
            "\t})\n" +
            "},\n" +
            "{\n" +
            "\tname: \"过仙桥\",\n" +
            "\t//地图名称text: Array(\"一座山间的小桥，做工十分别致\",\n" +
            "\t\"东：擎天巨松\"),\n" +
            "\t//描述判定npc: Array(\"圣教教徒使者\"),\n" +
            "\t//npcdirection: Array(//可去路径{\n" +
            "\t\tname: \"梅紫崖\",\n" +
            "\t\ttext: \"北：梅紫崖 ↑\"\n" +
            "\t},\n" +
            "\t{\n" +
            "\t\tname: \"擎天巨松\",\n" +
            "\t\ttext: \"东：擎天巨松 →\"\n" +
            "\t})\n" +
            "},\n" +
            "{\n" +
            "\tname: \"梅紫崖\",\n" +
            "\t//地图名称text: Array(\"长满紫色梅花的绝壁\",\n" +
            "\t\"南：过仙桥\"),\n" +
            "\t//描述判定npc: Array(),\n" +
            "\t//npcdirection: Array(//可去路径{\n" +
            "\t\tname: \"莲花仙池\",\n" +
            "\t\ttext: \"西：莲花仙池 ←\"\n" +
            "\t},\n" +
            "\t{\n" +
            "\t\tname: \"过仙桥\",\n" +
            "\t\ttext: \"南：过仙桥 ↓\"\n" +
            "\t})\n" +
            "},\n" +
            "{\n" +
            "\tname: \"莲花仙池\",\n" +
            "\t//地图名称text: Array(\"开满荷花的池子，池水深不可测。\",\n" +
            "\t\"东：梅紫崖\"),\n" +
            "\t//描述判定npc: Array(),\n" +
            "\t//npcdirection: Array(//可去路径{\n" +
            "\t\tname: \"玉屏山谷\",\n" +
            "\t\ttext: \"西：玉屏山谷 ←\"\n" +
            "\t},\n" +
            "\t{\n" +
            "\t\tname: \"梅紫崖\",\n" +
            "\t\ttext: \"东：梅紫崖 →\"\n" +
            "\t},\n" +
            "\t{\n" +
            "\t\tname: \"观月峰2\",\n" +
            "\t\ttext: \"南：观月峰2 ↓\"\n" +
            "\t})\n" +
            "},\n" +
            "{\n" +
            "\tname: \"玉屏山谷\",\n" +
            "\t//地图名称text: Array(\"两边是巨大松林的山谷，松树林俨然是两座天然的屏风\",\n" +
            "\t\"东：莲花仙池\"),\n" +
            "\t//描述判定npc: Array(\"圣教教徒随从\"),\n" +
            "\t//npcdirection: Array(//可去路径{\n" +
            "\t\tname: \"山涧小溪1\",\n" +
            "\t\ttext: \"西：山涧小溪1 ←\"\n" +
            "\t},\n" +
            "\t{\n" +
            "\t\tname: \"莲花仙池\",\n" +
            "\t\ttext: \"东：莲花仙池 →\"\n" +
            "\t})\n" +
            "},\n" +
            "{\n" +
            "\tname: \"山涧小溪1\",\n" +
            "\t//地图名称text: Array(\"一条深涧的小溪，溪水清澈见底。\",\n" +
            "\t\"东：玉屏山谷\"),\n" +
            "\t//描述判定npc: Array(),\n" +
            "\t//npcdirection: Array(//可去路径{\n" +
            "\t\tname: \"玉屏山谷\",\n" +
            "\t\ttext: \"东：玉屏山谷 →\"\n" +
            "\t},\n" +
            "\t{\n" +
            "\t\tname: \"山涧小溪2\",\n" +
            "\t\ttext: \"南：山涧小溪2 ↓\"\n" +
            "\t})\n" +
            "},\n" +
            "{\n" +
            "\tname: \"山涧小溪2\",\n" +
            "\t//地图名称text: Array(\"一条山涧的小溪，溪水清澈见底。\",\n" +
            "\t\"北：山涧小溪1 ↑\"),\n" +
            "\t//描述判定npc: Array(),\n" +
            "\t//npcdirection: Array(//可去路径{\n" +
            "\t\tname: \"山涧小溪1\",\n" +
            "\t\ttext: \"北：山涧小溪1 ↑\"\n" +
            "\t},\n" +
            "\t{\n" +
            "\t\tname: \"人字瀑布\",\n" +
            "\t\ttext: \"南：人字瀑布 ↓\"\n" +
            "\t})\n" +
            "},\n" +
            "{\n" +
            "\tname: \"人字瀑布\",\n" +
            "\t//地图名称text: Array(\"巨大的瀑布由于山的形状从中间段开，好似一个人字\",\n" +
            "\t\"北：山涧小溪2 ↑\"),\n" +
            "\t//描述判定npc: Array(),\n" +
            "\t//npcdirection: Array(//可去路径{\n" +
            "\t\tname: \"山涧小溪2\",\n" +
            "\t\ttext: \"北：山涧小溪2 ↑\"\n" +
            "\t},\n" +
            "\t{\n" +
            "\t\tname: \"青松岭\",\n" +
            "\t\ttext: \"西：青松岭 ←\"\n" +
            "\t},\n" +
            "\t{\n" +
            "\t\tname: \"半山亭\",\n" +
            "\t\ttext: \"南：半山亭 ↓\"\n" +
            "\t})\n" +
            "},\n" +
            "{\n" +
            "\tname: \"青松岭\",\n" +
            "\t//地图名称text: Array(\"长满巨大松树的山岭\",\n" +
            "\t\"北：迎客松 ↑\"),\n" +
            "\t//描述判定npc: Array(),\n" +
            "\t//npcdirection: Array(//可去路径{\n" +
            "\t\tname: \"迎客松\",\n" +
            "\t\ttext: \"北：迎客松 ↑\"\n" +
            "\t},\n" +
            "\t{\n" +
            "\t\tname: \"人字瀑布\",\n" +
            "\t\ttext: \"东：人字瀑布 →\"\n" +
            "\t})\n" +
            "},\n" +
            "{\n" +
            "\tname: \"迎客松\",\n" +
            "\t//地图名称text: Array(\"一棵巨大的松树\",\n" +
            "\t\"南：青松岭 ↓\"),\n" +
            "\t//描述判定npc: Array(),\n" +
            "\t//npcdirection: Array(//可去路径{\n" +
            "\t\tname: \"石人峰\",\n" +
            "\t\ttext: \"北：石人峰 ↑\"\n" +
            "\t},\n" +
            "\t{\n" +
            "\t\tname: \"青松岭\",\n" +
            "\t\ttext: \"南：青松岭 ↓\"\n" +
            "\t})\n" +
            "},\n" +
            "{\n" +
            "\tname: \"石人峰\",\n" +
            "\t//地图名称text: Array(\"高耸的山峰貌似一个石人正在目视远方\",\n" +
            "\t\"南：迎客松 ↓\"),\n" +
            "\t//描述判定npc: Array(\"向问天\"),\n" +
            "\t//npcdirection: Array(//可去路径{\n" +
            "\t\tname: \"百步云梯2\",\n" +
            "\t\ttext: \"西：百步云梯2 ←\"\n" +
            "\t},\n" +
            "\t{\n" +
            "\t\tname: \"迎客松\",\n" +
            "\t\ttext: \"南：迎客松 ↓\"\n" +
            "\t})\n" +
            "},\n" +
            "{\n" +
            "\tname: \"百步云梯2\",\n" +
            "\t//地图名称text: Array(\"一条在白云间上下穿梭的小路\",\n" +
            "\t\"东：石人峰 →\"),\n" +
            "\t//描述判定npc: Array(\"圣教教徒小兵\"),\n" +
            "\t//npcdirection: Array(//可去路径{\n" +
            "\t\tname: \"百步云梯1\",\n" +
            "\t\ttext: \"北：百步云梯1 ↑\"\n" +
            "\t},\n" +
            "\t{\n" +
            "\t\tname: \"石人峰\",\n" +
            "\t\ttext: \"东：石人峰 →\"\n" +
            "\t})\n" +
            "},\n" +
            "{\n" +
            "\tname: \"百步云梯1\",\n" +
            "\t//地图名称text: Array(\"东：清凉小亭 →\",\n" +
            "\t\"南：百步云梯2 ↓\"),\n" +
            "\t//描述判定npc: Array(\"圣教教徒小兵\"),\n" +
            "\t//npcdirection: Array(//可去路径{\n" +
            "\t\tname: \"清凉小亭\",\n" +
            "\t\ttext: \"东：清凉小亭 →\"\n" +
            "\t},\n" +
            "\t{\n" +
            "\t\tname: \"百步云梯2\",\n" +
            "\t\ttext: \"南：百步云梯2 ↓\"\n" +
            "\t})\n" +
            "},\n" +
            "{\n" +
            "\tname: \"清凉小亭\",\n" +
            "\t//地图名称text: Array(\"坐落在山脚的一个小亭子\",\n" +
            "\t\"东：狮子峰 →\"),\n" +
            "\t//描述判定npc: Array(\"圣教教徒小兵\"),\n" +
            "\t//npcdirection: Array(//可去路径{\n" +
            "\t\tname: \"百步云梯1\",\n" +
            "\t\ttext: \"西：百步云梯1 ←\"\n" +
            "\t},\n" +
            "\t{\n" +
            "\t\tname: \"狮子峰\",\n" +
            "\t\ttext: \"东：狮子峰 →\"\n" +
            "\t})\n" +
            "},\n" +
            "{\n" +
            "\tname: \"狮子峰\",\n" +
            "\t//地图名称text: Array(\"黄山第一峰，地势险要\",\n" +
            "\t\"北：万丈崖 ↑\"),\n" +
            "\t//描述判定npc: Array(\"圣教教徒小兵\"),\n" +
            "\t//npcdirection: Array(//可去路径{\n" +
            "\t\tname: \"万丈崖\",\n" +
            "\t\ttext: \"北：万丈崖 ↑\"\n" +
            "\t},\n" +
            "\t{\n" +
            "\t\tname: \"清凉小亭\",\n" +
            "\t\ttext: \"西：清凉小亭 ←\"\n" +
            "\t})\n" +
            "},\n" +
            "{\n" +
            "\tname: \"万丈崖\",\n" +
            "\t//地图名称text: Array(\"数万丈深的悬崖绝壁\",\n" +
            "\t\"南：狮子峰 ↓\"),\n" +
            "\t//描述判定npc: Array(\"圣教教徒武士\"),\n" +
            "\t//npcdirection: Array(//可去路径{\n" +
            "\t\tname: \"狮子峰\",\n" +
            "\t\ttext: \"南：狮子峰 ↓\"\n" +
            "\t})\n" +
            "},\n" +
            "{\n" +
            "\tname: \"半山亭\",\n" +
            "\t//地图名称text: Array(\"坐落在山脚的一个小亭子\",\n" +
            "\t\"北：人字瀑布 ↑\"),\n" +
            "\t//描述判定npc: Array(),\n" +
            "\t//npcdirection: Array(//可去路径{\n" +
            "\t\tname: \"人字瀑布\",\n" +
            "\t\ttext: \"北：人字瀑布 ↑\"\n" +
            "\t},\n" +
            "\t{\n" +
            "\t\tname: \"醉笑石\",\n" +
            "\t\ttext: \"西：醉笑石 ←\"\n" +
            "\t},\n" +
            "\t{\n" +
            "\t\tname: \"天女山谷\",\n" +
            "\t\ttext: \"东：天女山谷 →\"\n" +
            "\t})\n" +
            "},\n" +
            "{\n" +
            "\tname: \"天女山谷\",\n" +
            "\t//地图名称text: Array(\"相传曾经有美丽的仙女曾经在此玩耍\",\n" +
            "\t\"西：半山亭\"),\n" +
            "\t//描述判定npc: Array(),\n" +
            "\t//npcdirection: Array(//可去路径{\n" +
            "\t\tname: \"半山亭\",\n" +
            "\t\ttext: \"西：半山亭 ←\"\n" +
            "\t},\n" +
            "\t{\n" +
            "\t\tname: \"慈云阁\",\n" +
            "\t\ttext: \"东：慈云阁 →\"\n" +
            "\t})\n" +
            "},\n" +
            "{\n" +
            "\tname: \"慈云阁\",\n" +
            "\t//地图名称text: Array(\"一间美丽的山涧小屋，屋子里面放着一些女人用的胭脂水粉\",\n" +
            "\t\"西：天女山谷\"),\n" +
            "\t//描述判定npc: Array(\"向问天\"),\n" +
            "\t//npcdirection: Array(//可去路径//{\n" +
            "\t\tname: \"天女山谷\",\n" +
            "\t\ttext: \"西：天女山谷 ←\"\n" +
            "\t},\n" +
            "\t{\n" +
            "\t\tname: \"天石泉\",\n" +
            "\t\ttext: \"南：天石泉 ↓\"\n" +
            "\t})\n" +
            "},\n" +
            "{\n" +
            "\tname: \"天石泉\",\n" +
            "\t//地图名称text: Array(\"一眼泉水，清甜甘冽\",\n" +
            "\t\"北：慈云阁 ↑\"),\n" +
            "\t//描述判定npc: Array(),\n" +
            "\t//npcdirection: Array(//可去路径{\n" +
            "\t\tname: \"慈云阁\",\n" +
            "\t\ttext: \"北：慈云阁 ↑\"\n" +
            "\t},\n" +
            "\t{\n" +
            "\t\tname: \"泉边小路1\",\n" +
            "\t\ttext: \"东：泉边小路1 →\"\n" +
            "\t})\n" +
            "},\n" +
            "{\n" +
            "\tname: \"泉边小路1\",\n" +
            "\t//地图名称text: Array(\"一条小路，通往泉边\",\n" +
            "\t\"西：天石泉 ←\"),\n" +
            "\t//描述判定npc: Array(\"圣教教徒使者\"),\n" +
            "\t//npcdirection: Array(//可去路径{\n" +
            "\t\tname: \"天石泉\",\n" +
            "\t\ttext: \"西：天石泉 ←\"\n" +
            "\t},\n" +
            "\t{\n" +
            "\t\tname: \"泉边小路2\",\n" +
            "\t\ttext: \"南：泉边小路2 ↓\"\n" +
            "\t})\n" +
            "},\n" +
            "{\n" +
            "\tname: \"泉边小路2\",\n" +
            "\t//地图名称text: Array(\"一条阴森漆黑的小路，没有光亮，也不知道会通向哪里\",\n" +
            "\t\"北：泉边小路1\"),\n" +
            "\t//描述判定npc: Array(\"圣教教徒使者\"),\n" +
            "\t//npcdirection: Array(//可去路径{\n" +
            "\t\tname: \"泉边小路1\",\n" +
            "\t\ttext: \"北：泉边小路1 ↑\"\n" +
            "\t},\n" +
            "\t{\n" +
            "\t\tname: \"问天山口\",\n" +
            "\t\ttext: \"西：问天山口 ←\"\n" +
            "\t})\n" +
            "},\n" +
            "{\n" +
            "\tname: \"问天山口\",\n" +
            "\t//地图名称text: Array(\"一块酷似山门的巨石\",\n" +
            "\t\"东：泉边小路2\"),\n" +
            "\t//描述判定npc: Array(\"圣教教徒卫士\"),\n" +
            "\t//npcdirection: Array(//可去路径{\n" +
            "\t\tname: \"泉边小路2\",\n" +
            "\t\ttext: \"东：泉边小路2 →\"\n" +
            "\t},\n" +
            "\t{\n" +
            "\t\tname: \"白鹅岭\",\n" +
            "\t\ttext: \"南：白鹅岭 ↓\"\n" +
            "\t})\n" +
            "},\n" +
            "{\n" +
            "\tname: \"白鹅岭\",\n" +
            "\t//地图名称text: Array(\"一个树林茂密的山岭\",\n" +
            "\t\"北：问天山口 ↑\"),\n" +
            "\t//描述判定npc: Array(),\n" +
            "\t//npcdirection: Array(//可去路径{\n" +
            "\t\tname: \"问天山口\",\n" +
            "\t\ttext: \"北：问天山口 ↑\"\n" +
            "\t},\n" +
            "\t{\n" +
            "\t\tname: \"碎石山路1\",\n" +
            "\t\ttext: \"东：碎石山路1 →\"\n" +
            "\t})\n" +
            "},\n" +
            "{\n" +
            "\tname: \"碎石山路1\",\n" +
            "\t//地图名称text: Array(\"一条碎石铺成的山路，绵延到远方\",\n" +
            "\t\"西：白鹅岭\"),\n" +
            "\t//描述判定npc: Array(\"圣教教徒打手\"),\n" +
            "\t//npcdirection: Array(//可去路径{\n" +
            "\t\tname: \"白鹅岭\",\n" +
            "\t\ttext: \"西：白鹅岭 ←\"\n" +
            "\t},\n" +
            "\t{\n" +
            "\t\tname: \"碎石山路2\",\n" +
            "\t\ttext: \"东：碎石山路2 →\"\n" +
            "\t})\n" +
            "},\n" +
            "{\n" +
            "\tname: \"碎石山路2\",\n" +
            "\t//地图名称text: Array(\"一条碎石铺成的山路，绵延到远方。\",\n" +
            "\t\"西：碎石山路1\"),\n" +
            "\t//描述判定npc: Array(\"圣教教徒打手\"),\n" +
            "\t//npcdirection: Array(//可去路径{\n" +
            "\t\tname: \"巨石山门\",\n" +
            "\t\ttext: \"北：巨石山门 ↑\"\n" +
            "\t},\n" +
            "\t{\n" +
            "\t\tname: \"碎石山路1\",\n" +
            "\t\ttext: \"西：碎石山路1 ←\"\n" +
            "\t})\n" +
            "},\n" +
            "{\n" +
            "\tname: \"巨石山门\",\n" +
            "\t//地图名称text: Array(\"一块酷似山门的巨石。\",\n" +
            "\t\"南：碎石山路2\"),\n" +
            "\t//描述判定npc: Array(),\n" +
            "\t//npcdirection: Array(//可去路径{\n" +
            "\t\tname: \"黑松山谷\",\n" +
            "\t\ttext: \"东：黑松山谷 →\"\n" +
            "\t},\n" +
            "\t{\n" +
            "\t\tname: \"碎石山路2\",\n" +
            "\t\ttext: \"南：碎石山路2 ↓\"\n" +
            "\t})\n" +
            "},\n" +
            "{\n" +
            "\tname: \"黑松山谷\",\n" +
            "\t//地图名称text: Array(\"一条阴森漆黑的山谷，没有光亮，也不知道会通向哪里\",\n" +
            "\t\"西：巨石山门\"),\n" +
            "\t//描述判定npc: Array(),\n" +
            "\t//npcdirection: Array(//可去路径{\n" +
            "\t\tname: \"黑松石\",\n" +
            "\t\ttext: \"北：黑松石 ↑\"\n" +
            "\t},\n" +
            "\t{\n" +
            "\t\tname: \"巨石山门\",\n" +
            "\t\ttext: \"西：巨石山门 ←\"\n" +
            "\t},\n" +
            "\t{\n" +
            "\t\tname: \"黑松岭\",\n" +
            "\t\ttext: \"南：黑松岭 ↓\"\n" +
            "\t})\n" +
            "},\n" +
            "{\n" +
            "\tname: \"黑松岭\",\n" +
            "\t//地图名称text: Array(\"一条密林小路，漆黑的松树遮住了天\",\n" +
            "\t\"北：黑松山谷 ↑\"),\n" +
            "\t//描述判定npc: Array(\"圣教教徒卫士\"),\n" +
            "\t//npcdirection: Array(//可去路径{\n" +
            "\t\tname: \"黑松石\",\n" +
            "\t\ttext: \"北：黑松山谷 ↑\"\n" +
            "\t},\n" +
            "\t{\n" +
            "\t\tname: \"黑松小路3\",\n" +
            "\t\ttext: \"南：黑松小路3 ↓\"\n" +
            "\t})\n" +
            "},\n" +
            "{\n" +
            "\tname: \"黑松小路3\",\n" +
            "\t//地图名称text: Array(\"一条密林小路，漆黑的松树遮住了天\",\n" +
            "\t\"北：黑松岭\"),\n" +
            "\t//描述判定npc: Array(),\n" +
            "\t//npcdirection: Array(//可去路径{\n" +
            "\t\tname: \"黑松岭\",\n" +
            "\t\ttext: \"北：黑松岭 ↑\"\n" +
            "\t},\n" +
            "\t{\n" +
            "\t\tname: \"万丈绝壁1\",\n" +
            "\t\ttext: \"南：万丈绝壁1 ↓\"\n" +
            "\t})\n" +
            "},\n" +
            "{\n" +
            "\tname: \"万丈绝壁1\",\n" +
            "\t//地图名称text: Array(\"数万丈深的悬崖绝壁，没有人知道崖下到低有没有尽头\",\n" +
            "\t\"北：黑松小路3\"),\n" +
            "\t//描述判定npc: Array(\"圣教教徒武士\"),\n" +
            "\t//npcdirection: Array(//可去路径{\n" +
            "\t\tname: \"黑松小路3\",\n" +
            "\t\ttext: \"北：黑松小路3 ↑\"\n" +
            "\t})\n" +
            "},\n" +
            "{\n" +
            "\tname: \"黑松石\",\n" +
            "\t//地图名称text: Array(\"一块巨大的漆黑色的石头\",\n" +
            "\t\"南：黑松山谷\"),\n" +
            "\t//描述判定npc: Array(),\n" +
            "\t//npcdirection: Array(//可去路径{\n" +
            "\t\tname: \"黑松林海\",\n" +
            "\t\ttext: \"西：黑松林海 ←\"\n" +
            "\t},\n" +
            "\t{\n" +
            "\t\tname: \"石崖泉\",\n" +
            "\t\ttext: \"东：石崖泉 →\"\n" +
            "\t},\n" +
            "\t{\n" +
            "\t\tname: \"黑松山谷\",\n" +
            "\t\ttext: \"南：黑松山谷 ↓\"\n" +
            "\t})\n" +
            "},\n" +
            "{\n" +
            "\tname: \"黑松林海\",\n" +
            "\t//地图名称text: Array(\"一块茂密的松林，漆黑的松树遮住了天\",\n" +
            "\t\"东：黑松石\"),\n" +
            "\t//描述判定npc: Array(\"圣教教徒使者\"),\n" +
            "\t//npcdirection: Array(//可去路径{\n" +
            "\t\tname: \"黑松小路1\",\n" +
            "\t\ttext: \"北：黑松小路1 ↑\"\n" +
            "\t},\n" +
            "\t{\n" +
            "\t\tname: \"黑松石\",\n" +
            "\t\ttext: \"东：黑松石 →\"\n" +
            "\t})\n" +
            "},\n" +
            "{\n" +
            "\tname: \"黑松小路1\",\n" +
            "\t//地图名称text: Array(\"一条密林小路，漆黑的松树遮住了天\",\n" +
            "\t\"南：黑松林海\"),\n" +
            "\t//描述判定npc: Array(),\n" +
            "\t//npcdirection: Array(//可去路径{\n" +
            "\t\tname: \"黑松小路2\",\n" +
            "\t\ttext: \"东：黑松小路2 →\"\n" +
            "\t},\n" +
            "\t{\n" +
            "\t\tname: \"黑松林海\",\n" +
            "\t\ttext: \"南：黑松林海 ↓\"\n" +
            "\t})\n" +
            "},\n" +
            "{\n" +
            "\tname: \"黑松小路2\",\n" +
            "\t//地图名称text: Array(\"一条密林小路，漆黑的松树遮住了天\",\n" +
            "\t\"西：黑松小路1\"),\n" +
            "\t//描述判定npc: Array(),\n" +
            "\t//npcdirection: Array(//可去路径{\n" +
            "\t\tname: \"扇子石\",\n" +
            "\t\ttext: \"北：扇子石 ↑\"\n" +
            "\t},\n" +
            "\t{\n" +
            "\t\tname: \"黑松小路1\",\n" +
            "\t\ttext: \"西：黑松小路1 ←\"\n" +
            "\t},\n" +
            "\t{\n" +
            "\t\tname: \"东：砚窝石\",\n" +
            "\t\ttext: \"东：砚窝石 →\"\n" +
            "\t})\n" +
            "},\n" +
            "{\n" +
            "\tname: \"扇子石\",\n" +
            "\t//地图名称text: Array(\"一块巨大的石头，外形酷似扇子\",\n" +
            "\t\"南：黑松小路2\"),\n" +
            "\t//描述判定npc: Array(\"圣教教徒卫士\",\n" +
            "\t\"圣教教徒使者\"),\n" +
            "\t//npcdirection: Array(//可去路径{\n" +
            "\t\tname: \"十八盘\",\n" +
            "\t\ttext: \"西：十八盘 ←\"\n" +
            "\t},\n" +
            "\t{\n" +
            "\t\tname: \"黑松小路2\",\n" +
            "\t\ttext: \"南：黑松小路2 ↓\"\n" +
            "\t})\n" +
            "},\n" +
            "{\n" +
            "\tname: \"十八盘\",\n" +
            "\t//地图名称text: Array(\"紧十八，慢十八，不紧不慢又十八\",\n" +
            "\t\"东：扇子石\"),\n" +
            "\t//描述判定npc: Array(),\n" +
            "\t//npcdirection: Array(//可去路径{\n" +
            "\t\tname: \"升仙阁\",\n" +
            "\t\ttext: \"西：升仙阁 ←\"\n" +
            "\t},\n" +
            "\t{\n" +
            "\t\tname: \"扇子石\",\n" +
            "\t\ttext: \"东：扇子石 →\"\n" +
            "\t})\n" +
            "},\n" +
            "{\n" +
            "\tname: \"升仙阁\",\n" +
            "\t//地图名称text: Array(\"坐落在山脚的一间小屋，据说是一位江湖上很有名的逍遥隐士的住所\",\n" +
            "\t\"东：十八盘\"),\n" +
            "\t//描述判定npc: Array(),\n" +
            "\t//npcdirection: Array(//可去路径{\n" +
            "\t\tname: \"五松亭\",\n" +
            "\t\ttext: \"西：五松亭 ←\"\n" +
            "\t},\n" +
            "\t{\n" +
            "\t\tname: \"十八盘\",\n" +
            "\t\ttext: \"东：十八盘 →\"\n" +
            "\t},\n" +
            "\t{\n" +
            "\t\tname: \"升仙洞\",\n" +
            "\t\ttext: \"南：升仙洞 ↓\"\n" +
            "\t})\n" +
            "},\n" +
            "{\n" +
            "\tname: \"五松亭\",\n" +
            "\t//地图名称text: Array(\"坐落在山脚的一个小亭子，四面青松环绕，幽静怡然\",\n" +
            "\t\"东：升仙阁\"),\n" +
            "\t//描述判定npc: Array(\"圣教教徒护院\"),\n" +
            "\t//npcdirection: Array(//可去路径{\n" +
            "\t\tname: \"中天门\",\n" +
            "\t\ttext: \"西：中天门 ←\"\n" +
            "\t},\n" +
            "\t{\n" +
            "\t\tname: \"升仙阁\",\n" +
            "\t\ttext: \"东：升仙阁 →\"\n" +
            "\t})\n" +
            "},\n" +
            "{\n" +
            "\tname: \"中天门\",\n" +
            "\t//地图名称text: Array(\"巨大的山石形成的石门\",\n" +
            "\t\"东：五松亭\"),\n" +
            "\t//描述判定npc: Array(),\n" +
            "\t//npcdirection: Array(//可去路径{\n" +
            "\t\tname: \"观日峰1\",\n" +
            "\t\ttext: \"北：观日峰1 ↑\"\n" +
            "\t},\n" +
            "\t{\n" +
            "\t\tname: \"五松亭\",\n" +
            "\t\ttext: \"东：五松亭 →\"\n" +
            "\t})\n" +
            "},\n" +
            "{\n" +
            "\tname: \"观日峰1\",\n" +
            "\t//地图名称text: Array(\"中原奇峰之一，在峰上可观日出，白云悠悠，云海翻腾\",\n" +
            "\t\"南：中天门\"),\n" +
            "\t//描述判定npc: Array(),\n" +
            "\t//npcdirection: Array(//可去路径{\n" +
            "\t\tname: \"观月峰2\",\n" +
            "\t\ttext: \"东：观月峰2 →\"\n" +
            "\t},\n" +
            "\t{\n" +
            "\t\tname: \"中天门\",\n" +
            "\t\ttext: \"南：中天门\"\n" +
            "\t})\n" +
            "},\n" +
            "{\n" +
            "\tname: \"观月峰2\",\n" +
            "\t//地图名称text: Array(\"中原奇峰之一，在峰上可观日出，白云悠悠\",\n" +
            "\t\"北：莲花仙池\"),\n" +
            "\t//描述判定npc: Array(\"圣教教徒使者\"),\n" +
            "\t//npcdirection: Array(//可去路径{\n" +
            "\t\tname: \"莲花仙池\",\n" +
            "\t\ttext: \"北：莲花仙池 ↑\"\n" +
            "\t},\n" +
            "\t{\n" +
            "\t\tname: \"观月峰2\",\n" +
            "\t\ttext: \"西：观月峰2 ←\"\n" +
            "\t})\n" +
            "},\n" +
            "{\n" +
            "\tname: \"太子坡\",\n" +
            "\t//地图名称text: Array(\"相传当今的太子曾经在此玩耍，所以此地由此得名\",\n" +
            "\t\"南：太子庙\"),\n" +
            "\t//描述判定npc: Array(\"岳不群\"),\n" +
            "\t//npcdirection: Array(//可去路径{\n" +
            "\t\tname: \"七星巨树\",\n" +
            "\t\ttext: \"西：七星巨树 ←\"\n" +
            "\t},\n" +
            "\t{\n" +
            "\t\tname: \"太子庙\",\n" +
            "\t\ttext: \"南：太子庙 ↓\"\n" +
            "\t})\n" +
            "},\n" +
            "{\n" +
            "\tname: \"七星巨树\",\n" +
            "\t//地图名称text: Array(\"一个巨大的松树，巨大的树枝伸向远方\",\n" +
            "\t\"东：太子坡\"),\n" +
            "\t//描述判定npc: Array(),\n" +
            "\t//npcdirection: Array(//可去路径{\n" +
            "\t\tname: \"玉虚岩\",\n" +
            "\t\ttext: \"西：玉虚岩 ←\"\n" +
            "\t},\n" +
            "\t{\n" +
            "\t\tname: \"太子坡\",\n" +
            "\t\ttext: \"东：太子坡 →\"\n" +
            "\t})\n" +
            "},\n" +
            "{\n" +
            "\tname: \"玉虚岩\",\n" +
            "\t//地图名称text: Array(\"一块巨大的岩石，上面零星点缀着几棵绿色的青玉\",\n" +
            "\t\"东：七星巨树\"),\n" +
            "\t//描述判定npc: Array(),\n" +
            "\t//npcdirection: Array(//可去路径{\n" +
            "\t\tname: \"玉皇顶\",\n" +
            "\t\ttext: \"北：玉皇顶 ↑\"\n" +
            "\t},\n" +
            "\t{\n" +
            "\t\tname: \"七星巨树\",\n" +
            "\t\ttext: \"东：七星巨树 →\"\n" +
            "\t})\n" +
            "},\n" +
            "{\n" +
            "\tname: \"玉皇顶\",\n" +
            "\t//地图名称text: Array(\"中原第一奇峰，白云悠悠，瀑布飞跌，林深谷幽\",\n" +
            "\t\"南：玉虚岩\"),\n" +
            "\t//描述判定npc: Array(),\n" +
            "\t//npcdirection: Array(//可去路径{\n" +
            "\t\tname: \"玉虚岩\",\n" +
            "\t\ttext: \"南：玉虚岩 ↓\"\n" +
            "\t})\n" +
            "},\n" +
            "{\n" +
            "\tname: \"上院山门\",\n" +
            "\t//地图名称text: Array(\"上院的入口，据说可以通往玄月石\",\n" +
            "\t\"东：长方岭\"),\n" +
            "\t//描述判定npc: Array(\"圣教教徒使者\"),\n" +
            "\t//npcdirection: Array(//可去路径{\n" +
            "\t\tname: \"砚窝石\",\n" +
            "\t\ttext: \"西：砚窝石 ←\"\n" +
            "\t},\n" +
            "\t{\n" +
            "\t\tname: \"长方岭\",\n" +
            "\t\ttext: \"东：长方岭 →\"\n" +
            "\t})\n" +
            "},\n" +
            "{\n" +
            "\tname: \"砚窝石\",\n" +
            "\t//地图名称text: Array(\"一块酷似砚台的巨石\",\n" +
            "\t\"东：上院山门\"),\n" +
            "\t//描述判定npc: Array(),\n" +
            "\t//npcdirection: Array(//可去路径{\n" +
            "\t\tname: \"转弯石\",\n" +
            "\t\ttext: \"北：转弯石 ↑\"\n" +
            "\t},\n" +
            "\t{\n" +
            "\t\tname: \"黑松小路2\",\n" +
            "\t\ttext: \"西：黑松小路2 ←\"\n" +
            "\t},\n" +
            "\t{\n" +
            "\t\tname: \"上院山门\",\n" +
            "\t\ttext: \"东：上院山门 →\"\n" +
            "\t})\n" +
            "},\n" +
            "{\n" +
            "\tname: \"转弯石\",\n" +
            "\t//地图名称text: Array(\"一条迷宫似的小路，一不小心就会跌下万丈悬崖\",\n" +
            "\t\"南：砚窝石\"),\n" +
            "\t//描述判定npc: Array(\"圣教教徒随从\"),\n" +
            "\t//npcdirection: Array(//可去路径{\n" +
            "\t\tname: \"上转弯\",\n" +
            "\t\ttext: \"北：上转弯 ↑\"\n" +
            "\t},\n" +
            "\t{\n" +
            "\t\tname: \"砚窝石\",\n" +
            "\t\ttext: \"南：砚窝石 ↓\"\n" +
            "\t})\n" +
            "},\n" +
            "{\n" +
            "\tname: \"上转弯\",\n" +
            "\t//地图名称text: Array(\"一条迷宫似的小路，一不小心就会跌下万丈悬崖\",\n" +
            "\t\"南：转弯石\"),\n" +
            "\t//描述判定npc: Array(\"圣教教徒使者\"),\n" +
            "\t//npcdirection: Array(//可去路径{\n" +
            "\t\tname: \"千刃绝壁\",\n" +
            "\t\ttext: \"西：千刃绝壁 ←\"\n" +
            "\t},\n" +
            "\t{\n" +
            "\t\tname: \"大转弯\",\n" +
            "\t\ttext: \"东：大转弯 →\"\n" +
            "\t},\n" +
            "\t{\n" +
            "\t\tname: \"转弯石\",\n" +
            "\t\ttext: \"南：转弯石 ↓\"\n" +
            "\t})\n" +
            "},\n" +
            "{\n" +
            "\tname: \"千刃绝壁\",\n" +
            "\t//地图名称text: Array(\"酷似用万把钢刀窃出来的石壁，险峻异常\",\n" +
            "\t\"东：上转弯\"),\n" +
            "\t//描述判定npc: Array(\"圣教教徒使者\"),\n" +
            "\t//npcdirection: Array(//可去路径{\n" +
            "\t\tname: \"上转弯\",\n" +
            "\t\ttext: \"东：上转弯 →\"\n" +
            "\t})\n" +
            "},\n" +
            "{\n" +
            "\tname: \"大转弯\",\n" +
            "\t//地图名称text: Array(\"一条迷宫似的小路，一不小心就会跌下万丈悬崖\",\n" +
            "\t\"西：上转弯 ←\"),\n" +
            "\t//描述判定npc: Array(),\n" +
            "\t//npcdirection: Array(//可去路径{\n" +
            "\t\tname: \"上转弯\",\n" +
            "\t\ttext: \"西：上转弯 ←\"\n" +
            "\t},\n" +
            "\t{\n" +
            "\t\tname: \"下转弯\",\n" +
            "\t\ttext: \"南：下转弯 ↓\"\n" +
            "\t})\n" +
            "},\n" +
            "{\n" +
            "\tname: \"下转弯\",\n" +
            "\t//地图名称text: Array(\"一条迷宫似的小路，一不小心就会跌下万丈悬崖\",\n" +
            "\t\"北：大转弯\"),\n" +
            "\t//描述判定npc: Array(\"圣教教徒护院\"),\n" +
            "\t//npcdirection: Array(//可去路径{\n" +
            "\t\tname: \"大转弯\",\n" +
            "\t\ttext: \"北：大转弯 ↑\"\n" +
            "\t})\n" +
            "},\n" +
            "{\n" +
            "\tname: \"石崖泉\",\n" +
            "\t//地图名称text: Array(\"一眼泉水，清甜甘冽\",\n" +
            "\t\"西：黑松石 ←\"),\n" +
            "\t//描述判定npc: Array(),\n" +
            "\t//npcdirection: Array(//可去路径{\n" +
            "\t\tname: \"黑松石\",\n" +
            "\t\ttext: \"西：黑松石 ←\"\n" +
            "\t},\n" +
            "\t{\n" +
            "\t\tname: \"石崖小溪1\",\n" +
            "\t\ttext: \"东：石崖小溪1 →\"\n" +
            "\t})\n" +
            "},\n" +
            "{\n" +
            "\tname: \"石崖小溪1\",\n" +
            "\t//地图名称text: Array(\"一条山涧的小溪，溪水清澈见底\",\n" +
            "\t\"西：石崖泉\"),\n" +
            "\t//描述判定npc: Array(\"圣教教徒打手\"),\n" +
            "\t//npcdirection: Array(//可去路径{\n" +
            "\t\tname: \"石崖泉\",\n" +
            "\t\ttext: \"西：石崖泉 ←\"\n" +
            "\t},\n" +
            "\t{\n" +
            "\t\tname: \"石崖小溪2\",\n" +
            "\t\ttext: \"南：石崖小溪2 ↓\"\n" +
            "\t})\n" +
            "},\n" +
            "{\n" +
            "\tname: \"石崖小溪2\",\n" +
            "\t//地图名称text: Array(\"一条山涧的小溪，溪水清澈见底\",\n" +
            "\t\"北：石崖小溪1\"),\n" +
            "\t//描述判定npc: Array(\"圣教教徒打手\"),\n" +
            "\t//npcdirection: Array(//可去路径{\n" +
            "\t\tname: \"石崖小溪1\",\n" +
            "\t\ttext: \"北：石崖小溪1 ↑\"\n" +
            "\t},\n" +
            "\t{\n" +
            "\t\tname: \"钱塘河水\",\n" +
            "\t\ttext: \"西：钱塘河水 ←\"\n" +
            "\t})\n" +
            "},\n" +
            "{\n" +
            "\tname: \"钱塘河水\",\n" +
            "\t//地图名称text: Array(\"一条通向西湖的大河\",\n" +
            "\t\"东：石崖小溪2\"),\n" +
            "\t//描述判定npc: Array(\"圣教教徒使者\",\n" +
            "\t\"丁坚\"),\n" +
            "\t//npcdirection: Array(//可去路径{\n" +
            "\t\tname: \"石崖小溪2\",\n" +
            "\t\ttext: \"东：石崖小溪2 →\"\n" +
            "\t},\n" +
            "\t{\n" +
            "\t\tname: \"西湖水面\",\n" +
            "\t\ttext: \"南：西湖水面 ↓\"\n" +
            "\t})\n" +
            "},\n" +
            "{\n" +
            "\tname: \"西湖水面\",\n" +
            "\t//地图名称text: Array(\"巨大的湖泊不知道隐藏着什么秘密\",\n" +
            "\t\"北：钱塘河水\"),\n" +
            "\t//描述判定npc: Array(\"圣教教徒小兵\",\n" +
            "\t\"御厨\"),\n" +
            "\t//npcdirection: Array(//可去路径{\n" +
            "\t\tname: \"钱塘河水\",\n" +
            "\t\ttext: \"北：钱塘河水 ↑\"\n" +
            "\t},\n" +
            "\t{\n" +
            "\t\tname: \"西湖湖低\",\n" +
            "\t\ttext: \"南：西湖湖低 ↓\"\n" +
            "\t})\n" +
            "},\n" +
            "{\n" +
            "\tname: \"西湖湖低\",\n" +
            "\t//地图名称text: Array(\"一条秘密的小路直接通往西湖下面\",\n" +
            "\t\"北：西湖水面 ↑\"),\n" +
            "\t//描述判定npc: Array(\"圣教教徒小兵\",\n" +
            "\t\"施令威\"),\n" +
            "\t//npcdirection: Array(//可去路径{\n" +
            "\t\tname: \"西湖水面\",\n" +
            "\t\ttext: \"北：西湖水面 ↑\"\n" +
            "\t},\n" +
            "\t{\n" +
            "\t\tname: \"梅庄黑牢\",\n" +
            "\t\ttext: \"南：梅庄黑牢 ↓\"\n" +
            "\t})\n" +
            "},\n" +
            "{\n" +
            "\tname: \"梅庄黑牢\",\n" +
            "\t//地图名称text: Array(\"东方不败关押任我行的水牢\",\n" +
            "\t\"北：西湖湖低 ↑\"),\n" +
            "\t//描述判定npc: Array(\"任我行总教主\"),\n" +
            "\t//npcdirection: Array(//可去路径{\n" +
            "\t\tname: \"西湖湖低\",\n" +
            "\t\ttext: \"北：西湖湖低 ↑\"\n" +
            "\t})\n" +
            "},\n" +
            "{\n" +
            "\tname: \"升仙洞\",\n" +
            "\t//地图名称text: Array(\"相传曾经有神仙在此\",\n" +
            "\t\"得道成仙，所以此地由此得名\",\n" +
            "\t\"北：升仙阁\"),\n" +
            "\t//描述判定npc: Array(\"圣教教徒使者\"),\n" +
            "\t//npcdirection: Array(//可去路径{\n" +
            "\t\tname: \"升仙阁\",\n" +
            "\t\ttext: \"北：升仙阁 ↑\"\n" +
            "\t})\n" +
            "},\n" +
            "{\n" +
            "\tname: \"圣教密室2\",\n" +
            "\t//地图名称text: Array(\"圣教小路的尽头，屋子里放着一些奇怪的物品\",\n" +
            "\t\"西：圣教小路3\"),\n" +
            "\t//描述判定npc: Array(\"张乘云\"),\n" +
            "\t//npcdirection: Array(//可去路径{\n" +
            "\t\tname: \"圣教小路3\",\n" +
            "\t\ttext: \"西：圣教小路3 ←\"\n" +
            "\t})\n" +
            "},\n" +
            "{\n" +
            "\tname: \"醉笑石\",\n" +
            "\t//地图名称text: Array(\"独醉笑春风，行到水穷，坐看云起，望春风又绿\",\n" +
            "\t\"东：半山亭\"),\n" +
            "\t//描述判定npc: Array(\"圣教教徒使者\"),\n" +
            "\t//npcdirection: Array(//可去路径{\n" +
            "\t\tname: \"半山亭\",\n" +
            "\t\ttext: \"东：半山亭 →\"\n" +
            "\t},\n" +
            "\t{\n" +
            "\t\tname: \"卧龙山洞\",\n" +
            "\t\ttext: \"南：卧龙山洞 ↓\"\n" +
            "\t})\n" +
            "},\n" +
            "{\n" +
            "\tname: \"卧龙山洞\",\n" +
            "\t//地图名称text: Array(\"一条阴森漆黑的山洞，没有光亮，也不知道会通向哪里\",\n" +
            "\t\"北：醉笑石 ↑\"),\n" +
            "\t//描述判定npc: Array(\"圣教教徒卫士\"),\n" +
            "\t//npcdirection: Array(//可去路径{\n" +
            "\t\tname: \"醉笑石\",\n" +
            "\t\ttext: \"北：醉笑石 ↑\"\n" +
            "\t},\n" +
            "\t{\n" +
            "\t\tname: \"山洞出口\",\n" +
            "\t\ttext: \"东：山洞出口 →\"\n" +
            "\t},\n" +
            "\t{\n" +
            "\t\tname: \"石猴忘月\",\n" +
            "\t\ttext: \"南：石猴忘月 ↓\"\n" +
            "\t})\n" +
            "},\n" +
            "{\n" +
            "\tname: \"石猴忘月\",\n" +
            "\t//地图名称text: Array(\"一块酷似石猴的巨石\",\n" +
            "\t\"北：卧龙山洞\"),\n" +
            "\t//描述判定npc: Array(\"圣教教徒卫士\"),\n" +
            "\t//npcdirection: Array(//可去路径{\n" +
            "\t\tname: \"卧龙山洞\",\n" +
            "\t\ttext: \"北：卧龙山洞 ↑\"\n" +
            "\t},\n" +
            "\t{\n" +
            "\t\tname: \"石猴石\",\n" +
            "\t\ttext: \"东：石猴石 →\"\n" +
            "\t},\n" +
            "\t{\n" +
            "\t\tname: \"光明顶\",\n" +
            "\t\ttext: \"南：光明顶\"\n" +
            "\t})\n" +
            "},\n" +
            "{\n" +
            "\tname: \"光明顶\",\n" +
            "\t//地图名称text: Array(\"一位武林高人\",\n" +
            "\t\"的隐秘场所\",\n" +
            "\t\"北：石猴忘月\"),\n" +
            "\t//描述判定npc: Array(\"圣教教徒使者\"),\n" +
            "\t//npcdirection: Array(//可去路径{\n" +
            "\t\tname: \"石猴忘月\",\n" +
            "\t\ttext: \"北：石猴忘月 ↑\"\n" +
            "\t},\n" +
            "\t{\n" +
            "\t\tname: \"天都峰\",\n" +
            "\t\ttext: \"南：天都峰 ↓\"\n" +
            "\t})\n" +
            "},\n" +
            "{\n" +
            "\tname: \"天都峰\",\n" +
            "\t//地图名称text: Array(\"一座高耸的山峰，据说还没有人来过这里\",\n" +
            "\t\"北：光明顶\"),\n" +
            "\t//描述判定npc: Array(\"圣教教徒卫士\"),\n" +
            "\t//npcdirection: Array(//可去路径{\n" +
            "\t\tname: \"光明顶\",\n" +
            "\t\ttext: \"北：光明顶 ↑\"\n" +
            "\t},\n" +
            "\t{\n" +
            "\t\tname: \"万丈悬崖2\",\n" +
            "\t\ttext: \"西：万丈悬崖2 ←\"\n" +
            "\t})\n" +
            "},\n" +
            "{\n" +
            "\tname: \"万丈悬崖2\",\n" +
            "\t//地图名称text: Array(\"数万丈深的悬崖绝壁，没有人知道崖下到低有没有尽头\",\n" +
            "\t\"东：天都峰\"),\n" +
            "\t//描述判定npc: Array(\"圣教教徒武士\"),\n" +
            "\t//npcdirection: Array(//可去路径{\n" +
            "\t\tname: \"天都峰\",\n" +
            "\t\ttext: \"东：天都峰 →\"\n" +
            "\t})\n" +
            "},\n" +
            "{\n" +
            "\tname: \"石猴石\",\n" +
            "\t//地图名称text: Array(\"一块酷似石猴的巨石\",\n" +
            "\t\"西：石猴忘月\"),\n" +
            "\t//描述判定npc: Array(\"圣教教徒卫士\"),\n" +
            "\t//npcdirection: Array(//可去路径{\n" +
            "\t\tname: \"石猴忘月\",\n" +
            "\t\ttext: \"西：石猴忘月 ←\"\n" +
            "\t})\n" +
            "},\n" +
            "{\n" +
            "\tname: \"山洞出口\",\n" +
            "\t//地图名称text: Array(\"一条阴森漆黑的山洞，突然眼前一亮，你从洞中出来了\",\n" +
            "\t\"西：卧龙山洞\"),\n" +
            "\t//描述判定npc: Array(\"杨莲亭\"),\n" +
            "\t//npcdirection: Array(//可去路径{\n" +
            "\t\tname: \"卧龙山洞\",\n" +
            "\t\ttext: \"西：卧龙山洞 ←\"\n" +
            "\t},\n" +
            "\t{\n" +
            "\t\tname: \"仙女潭\",\n" +
            "\t\ttext: \"东：仙女潭 →\"\n" +
            "\t})\n" +
            "},\n" +
            "{\n" +
            "\tname: \"仙女潭\",\n" +
            "\t//地图名称text: Array(\"一个淡绿色的深潭，据说美丽的仙女曾经在这洗过澡\",\n" +
            "\t\"西：山洞出口\"),\n" +
            "\t//描述判定npc: Array(\"圣教教徒护院\"),\n" +
            "\t//npcdirection: Array(//可去路径{\n" +
            "\t\tname: \"山洞出口\",\n" +
            "\t\ttext: \"西：山洞出口 ←\"\n" +
            "\t},\n" +
            "\t{\n" +
            "\t\tname: \"仙女泉\",\n" +
            "\t\ttext: \"南：仙女泉 ↓\"\n" +
            "\t})\n" +
            "},\n" +
            "{\n" +
            "\tname: \"仙女泉\",\n" +
            "\t//地图名称text: Array(\"一眼泉水，清甜甘冽\",\n" +
            "\t\"北：仙女潭 ↑\"),\n" +
            "\t//描述判定npc: Array(\"圣教教徒随从\"),\n" +
            "\t//npcdirection: Array(//可去路径{\n" +
            "\t\tname: \"仙女潭\",\n" +
            "\t\ttext: \"北：仙女潭 ↑\"\n" +
            "\t},\n" +
            "\t{\n" +
            "\t\tname: \"泉边小路3\",\n" +
            "\t\ttext: \"南：泉边小路3 ↓\"\n" +
            "\t})\n" +
            "},\n" +
            "{\n" +
            "\tname: \"泉边小路3\",\n" +
            "\t//地图名称text: Array(\"一条阴森漆黑的小路，没有光亮，也不知道会通向哪里\",\n" +
            "\t\"北：仙女泉\"),\n" +
            "\t//描述判定npc: Array(\"峨嵋女弟子\"),\n" +
            "\t//npcdirection: Array(//可去路径{\n" +
            "\t\tname: \"仙女泉\",\n" +
            "\t\ttext: \"北：仙女泉 ↑\"\n" +
            "\t},\n" +
            "\t{\n" +
            "\t\tname: \"七仙洞口\",\n" +
            "\t\ttext: \"西：七仙洞口 ←\"\n" +
            "\t})\n" +
            "},\n" +
            "{\n" +
            "\tname: \"七仙洞口\",\n" +
            "\t//地图名称text: Array(\"一位武林高人\",\n" +
            "\t\"的隐秘场所\",\n" +
            "\t\"东：泉边小路3\"),\n" +
            "\t//描述判定npc: Array(\"圣教教徒使者\"),\n" +
            "\t//npcdirection: Array(//可去路径{\n" +
            "\t\tname: \"泉边小路3\",\n" +
            "\t\ttext: \"东：泉边小路3 →\"\n" +
            "\t},\n" +
            "\t{\n" +
            "\t\tname: \"七仙洞\",\n" +
            "\t\ttext: \"南：七仙洞 ↓\"\n" +
            "\t})\n" +
            "},\n" +
            "{\n" +
            "\tname: \"七仙洞\",\n" +
            "\t//地图名称text: Array(\"一条阴森漆黑的山洞，没有光亮，也不知道会通向哪里\",\n" +
            "\t\"北：七仙洞口\"),\n" +
            "\t//描述判定npc: Array(\"圣教教徒使者\"),\n" +
            "\t//npcdirection: Array(//可去路径{\n" +
            "\t\tname: \"七仙洞口\",\n" +
            "\t\ttext: \"北：七仙洞口 ↑\"\n" +
            "\t},\n" +
            "\t{\n" +
            "\t\tname: \"洞中小路\",\n" +
            "\t\ttext: \"南：洞中小路 ↓\"\n" +
            "\t})\n" +
            "},\n" +
            "{\n" +
            "\tname: \"洞中小路\",\n" +
            "\t//地图名称text: Array(\"一条阴森漆黑的山洞，没有光亮，也不知道会通向哪里\",\n" +
            "\t\"西：震洞神石\"),\n" +
            "\t//描述判定npc: Array(),\n" +
            "\t//npcdirection: Array(//可去路径{\n" +
            "\t\tname: \"七仙洞\",\n" +
            "\t\ttext: \"北：七仙洞 ↑\"\n" +
            "\t},\n" +
            "\t{\n" +
            "\t\tname: \"震洞神石\",\n" +
            "\t\ttext: \"西：震洞神石 ←\"\n" +
            "\t})\n" +
            "},\n" +
            "{\n" +
            "\tname: \"震洞神石\",\n" +
            "\t//地图名称text: Array(\"一块巨大的神石挡住了你的去路\",\n" +
            "\t\"东：洞中小路\"),\n" +
            "\t//描述判定npc: Array(\"圣教教徒随从\"),\n" +
            "\t//npcdirection: Array(//可去路径{\n" +
            "\t\tname: \"洞中小路\",\n" +
            "\t\ttext: \"东：洞中小路 →\"\n" +
            "\t},\n" +
            "\t{\n" +
            "\t\tname: \"洞中墓室\",\n" +
            "\t\ttext: \"南：洞中墓室 ↓\"\n" +
            "\t})\n" +
            "},\n" +
            "{\n" +
            "\tname: \"洞中墓室\",\n" +
            "\t//地图名称text: Array(\"一个漆黑山洞中的墓室，四周围绕这死亡的气息\",\n" +
            "\t\"北：震洞神石\"),\n" +
            "\t//描述判定npc: Array(\"雪千寻\"),\n" +
            "\t//npcdirection: Array(//可去路径{\n" +
            "\t\tname: \"震洞神石\",\n" +
            "\t\ttext: \"北：震洞神石 ↑\"\n" +
            "\t},\n" +
            "\t{\n" +
            "\t\tname: \"缥缈峰\",\n" +
            "\t\ttext: \"东：缥缈峰 →\"\n" +
            "\t},\n" +
            "\t{\n" +
            "\t\tname: \"黑木崖\",\n" +
            "\t\ttext: \"南：黑木崖 ↓\"\n" +
            "\t})\n" +
            "},\n" +
            "{\n" +
            "\tname: \"黑木崖\",\n" +
            "\t//地图名称text: Array(\"东方不败\",\n" +
            "\t\"的场所，一般人是进不来的，葵花宝典就藏在这的某个地方\",\n" +
            "\t\"北：洞中墓室\"),\n" +
            "\t//描述判定npc: Array(\"东方不败教主\"),\n" +
            "\t//npcdirection: Array(//可去路径{\n" +
            "\t\tname: \"洞中墓室\",\n" +
            "\t\ttext: \"北：洞中墓室 ↑\"\n" +
            "\t})\n" +
            "},\n" +
            "{\n" +
            "\tname: \"缥缈峰\",\n" +
            "\t//地图名称text: Array(\"此峰为太湖七十二峰之首，由于山峰终年云封雾锁\",\n" +
            "\t\"西：洞中墓室\"),\n" +
            "\t//描述判定npc: Array(),\n" +
            "\t//npcdirection: Array(//可去路径{\n" +
            "\t\tname: \"洞中墓室\",\n" +
            "\t\ttext: \"西：洞中墓室 ←\"\n" +
            "\t})\n" +
            "},\n" +
            "//峨眉山{\n" +
            "\tname: \"峨嵋山\",\n" +
            "\t//地图名称text: Array(\"峨嵋之秀甲天下\",\n" +
            "\t\"北：成都西门\",\n" +
            "\t\"西：报国寺山门 ←\"),\n" +
            "\t//描述判定npc: Array(\"白猿\"),\n" +
            "\t//npcdirection: Array(//可去路径{\n" +
            "\t\tname: \"成都西门\",\n" +
            "\t\ttext: \"北：成都西门 ↑\"\n" +
            "\t},\n" +
            "\t{\n" +
            "\t\tname: \"报国寺山门\",\n" +
            "\t\ttext: \"西：报国寺山门 ←\"\n" +
            "\t})\n" +
            "},\n" +
            "{\n" +
            "\tname: \"报国寺山门\",\n" +
            "\t//地图名称text: Array(\"报国寺为峨嵋出入之门户。山门上有一块大匾\"),\n" +
            "\t//描述判定npc: Array(\"峨嵋女弟子\"),\n" +
            "\t//npcdirection: Array(//可去路径{\n" +
            "\t\tname: \"报国寺\",\n" +
            "\t\ttext: \"北：报国寺 ↑\"\n" +
            "\t},\n" +
            "\t{\n" +
            "\t\tname: \"峨嵋山\",\n" +
            "\t\ttext: \"东：峨嵋山 →\"\n" +
            "\t})\n" +
            "},\n" +
            "{\n" +
            "\tname: \"报国寺\",\n" +
            "\t//地图名称text: Array(\"报国寺倚山建造，弥勒殿、大雄殿、七佛殿逐级升高\"),\n" +
            "\t//描述判定npc: Array(\"峨嵋女弟子\"),\n" +
            "\t//npcdirection: Array(//可去路径{\n" +
            "\t\tname: \"解脱坡\",\n" +
            "\t\ttext: \"北：解脱坡 ↑\"\n" +
            "\t},\n" +
            "\t{\n" +
            "\t\tname: \"报国寺山门\",\n" +
            "\t\ttext: \"南：报国寺山门 ↓\"\n" +
            "\t})\n" +
            "},\n" +
            "{\n" +
            "\tname: \"解脱坡\",\n" +
            "\t//地图名称text: Array(\"这里是峨嵋胜地解脱坡\"),\n" +
            "\t//描述判定npc: Array(\"峨嵋女弟子\"),\n" +
            "\t//npcdirection: Array(//可去路径{\n" +
            "\t\tname: \"纯阳殿\",\n" +
            "\t\ttext: \"北：纯阳殿 ↑\"\n" +
            "\t},\n" +
            "\t{\n" +
            "\t\tname: \"观音堂\",\n" +
            "\t\ttext: \"西：观音堂 ←\"\n" +
            "\t},\n" +
            "\t{\n" +
            "\t\tname: \"归云阁\",\n" +
            "\t\ttext: \"东：归云阁 →\"\n" +
            "\t},\n" +
            "\t{\n" +
            "\t\tname: \"报国寺\",\n" +
            "\t\ttext: \"南：报国寺 ↓\"\n" +
            "\t})\n" +
            "},\n" +
            "{\n" +
            "\tname: \"归云阁\",\n" +
            "\t//地图名称text: Array(\"归云阁，原是唐代福昌达道禅师的道场\"),\n" +
            "\t//描述判定npc: Array(\"峨嵋女弟子\",\n" +
            "\t\"赵灵珠\"),\n" +
            "\t//npcdirection: Array(//可去路径{\n" +
            "\t\tname: \"解脱坡\",\n" +
            "\t\ttext: \"西：解脱坡 ←\"\n" +
            "\t})\n" +
            "},\n" +
            "{\n" +
            "\tname: \"观音堂\",\n" +
            "\t//地图名称text: Array(\"观音堂高踞坡岗，近临危崖，环境幽静\"),\n" +
            "\t//描述判定npc: Array(\"苏梦清\"),\n" +
            "\t//npcdirection: Array(//可去路径{\n" +
            "\t\tname: \"解脱坡\",\n" +
            "\t\ttext: \"东：解脱坡 →\"\n" +
            "\t})\n" +
            "},\n" +
            "{\n" +
            "\tname: \"纯阳殿\",\n" +
            "\t//地图名称text: Array(\"纯阳殿海拔一千余米，四面古木苍翠，幽静宜人\"),\n" +
            "\t//描述判定npc: Array(\"静真师太\",\n" +
            "\t\"李明霞\"),\n" +
            "\t//npcdirection: Array(//可去路径{\n" +
            "\t\tname: \"中峰寺\",\n" +
            "\t\ttext: \"北：中峰寺 ↑\"\n" +
            "\t},\n" +
            "\t{\n" +
            "\t\tname: \"福寿庵\",\n" +
            "\t\ttext: \"西：福寿庵 ←\"\n" +
            "\t},\n" +
            "\t{\n" +
            "\t\tname: \"灵文阁\",\n" +
            "\t\ttext: \"东：灵文阁 →\"\n" +
            "\t},\n" +
            "\t{\n" +
            "\t\tname: \"解脱坡\",\n" +
            "\t\ttext: \"南：解脱坡 ↓\"\n" +
            "\t})\n" +
            "},\n" +
            "{\n" +
            "\tname: \"福寿庵\",\n" +
            "\t//地图名称text: Array(\"福寿庵是一个名叫天性的僧人建造的\"),\n" +
            "\t//描述判定npc: Array(\"方碧琳\",\n" +
            "\t\"纪晓芙\"),\n" +
            "\t//npcdirection: Array(//可去路径{\n" +
            "\t\tname: \"纯阳殿\",\n" +
            "\t\ttext: \"东：纯阳殿 →\"\n" +
            "\t})\n" +
            "},\n" +
            "{\n" +
            "\tname: \"灵文阁\",\n" +
            "\t//地图名称text: Array(\"这里是福寿庵的灵文阁\"),\n" +
            "\t//描述判定npc: Array(\"静照师太\"),\n" +
            "\t//npcdirection: Array(//可去路径{\n" +
            "\t\tname: \"纯阳殿\",\n" +
            "\t\ttext: \"西：纯阳殿 ←\"\n" +
            "\t})\n" +
            "},\n" +
            "{\n" +
            "\tname: \"中峰寺\",\n" +
            "\t//地图名称text: Array(\"中峰寺在白云峰下，始建于晋代，原为道观\"),\n" +
            "\t//描述判定npc: Array(\"静玄师太\",\n" +
            "\t\"静虚师太\"),\n" +
            "\t//npcdirection: Array(//可去路径{\n" +
            "\t\tname: \"华严顶\",\n" +
            "\t\ttext: \"北：华严顶 ↑\"\n" +
            "\t},\n" +
            "\t{\n" +
            "\t\tname: \"清音阁\",\n" +
            "\t\ttext: \"西：清音阁 ←\"\n" +
            "\t},\n" +
            "\t{\n" +
            "\t\tname: \"神水庵\",\n" +
            "\t\ttext: \"东：神水庵 →\"\n" +
            "\t},\n" +
            "\t{\n" +
            "\t\tname: \"纯阳殿\",\n" +
            "\t\ttext: \"南：纯阳殿 ↓\"\n" +
            "\t})\n" +
            "},\n" +
            "{\n" +
            "\tname: \"清音阁\",\n" +
            "\t//地图名称text: Array(\"这里是峨嵋山的清音阁\"),\n" +
            "\t//描述判定npc: Array(\"文音小师太\",\n" +
            "\t\"文清小师太\"),\n" +
            "\t//npcdirection: Array(//可去路径{\n" +
            "\t\tname: \"中峰寺\",\n" +
            "\t\ttext: \"东：中峰寺 →\"\n" +
            "\t})\n" +
            "},\n" +
            "{\n" +
            "\tname: \"神水庵\",\n" +
            "\t//地图名称text: Array(\"神水庵位于宝掌峰下\"),\n" +
            "\t//描述判定npc: Array(\"丁敏君\",\n" +
            "\t\"贝锦仪\"),\n" +
            "\t//npcdirection: Array(//可去路径{\n" +
            "\t\tname: \"中峰寺\",\n" +
            "\t\ttext: \"西：中峰寺 ←\"\n" +
            "\t})\n" +
            "},\n" +
            "{\n" +
            "\tname: \"华严顶\",\n" +
            "\t//地图名称text: Array(\"华严顶挺拔高峭，古刹云深，殿宇孤耸，风景奇险\"),\n" +
            "\t//描述判定npc: Array(\"静心师太\",\n" +
            "\t\"静闲师太\"),\n" +
            "\t//npcdirection: Array(//可去路径{\n" +
            "\t\tname: \"接引殿\",\n" +
            "\t\ttext: \"北：接引殿 ↑\"\n" +
            "\t},\n" +
            "\t{\n" +
            "\t\tname: \"凌云梯\",\n" +
            "\t\ttext: \"西：凌云梯 ←\"\n" +
            "\t},\n" +
            "\t{\n" +
            "\t\tname: \"千佛庵\",\n" +
            "\t\ttext: \"东：千佛庵 →\"\n" +
            "\t},\n" +
            "\t{\n" +
            "\t\tname: \"中峰寺\",\n" +
            "\t\ttext: \"南：中峰寺 ↓\"\n" +
            "\t})\n" +
            "},\n" +
            "{\n" +
            "\tname: \"凌云梯\",\n" +
            "\t//地图名称text: Array(\"这是凌云梯，又叫「胡僧梯」\"),\n" +
            "\t//描述判定npc: Array(\"文菲小师太\"),\n" +
            "\t//npcdirection: Array(//可去路径{\n" +
            "\t\tname: \"华严顶\",\n" +
            "\t\ttext: \"东：华严顶 →\"\n" +
            "\t})\n" +
            "},\n" +
            "{\n" +
            "\tname: \"千佛庵\",\n" +
            "\t//地图名称text: Array(\"此处是洪椿坪千佛庵。山间小坪坝，四面层峦叠障，峰环岭护\"),\n" +
            "\t//描述判定npc: Array(\"文晖小师太\"),\n" +
            "\t//npcdirection: Array(//可去路径{\n" +
            "\t\tname: \"华严顶\",\n" +
            "\t\ttext: \"西：华严顶 ←\"\n" +
            "\t})\n" +
            "},\n" +
            "{\n" +
            "\tname: \"接引殿\",\n" +
            "\t//地图名称text: Array(\"接引殿右边濒崖，是金钢嘴\"),\n" +
            "\t//描述判定npc: Array(\"静迦师太\",\n" +
            "\t\"静空师太\"),\n" +
            "\t//npcdirection: Array(//可去路径{\n" +
            "\t\tname: \"金顶\",\n" +
            "\t\ttext: \"北：金顶 ↑\"\n" +
            "\t},\n" +
            "\t{\n" +
            "\t\tname: \"雷洞坪\",\n" +
            "\t\ttext: \"西：雷洞坪 ←\"\n" +
            "\t},\n" +
            "\t{\n" +
            "\t\tname: \"万行庵\",\n" +
            "\t\ttext: \"东：万行庵 →\"\n" +
            "\t},\n" +
            "\t{\n" +
            "\t\tname: \"华严顶\",\n" +
            "\t\ttext: \"南：华严顶 ↓\"\n" +
            "\t})\n" +
            "},\n" +
            "{\n" +
            "\tname: \"雷洞坪\",\n" +
            "\t//地图名称text: Array(\"雷洞坪一带，道路艰险骇人\"),\n" +
            "\t//描述判定npc: Array(\"静和师太\",\n" +
            "\t\"静风师太\"),\n" +
            "\t//npcdirection: Array(//可去路径{\n" +
            "\t\tname: \"接引殿\",\n" +
            "\t\ttext: \"东：接引殿 →\"\n" +
            "\t})\n" +
            "},\n" +
            "{\n" +
            "\tname: \"万行庵\",\n" +
            "\t//地图名称text: Array(\"太子坪万行庵是古智禅师创建的，庵外满山长满莎椤花\"),\n" +
            "\t//描述判定npc: Array(\"静慧师太\",\n" +
            "\t\"文方小师太\"),\n" +
            "\t//npcdirection: Array(//可去路径{\n" +
            "\t\tname: \"接引殿\",\n" +
            "\t\ttext: \"西：接引殿 ←\"\n" +
            "\t})\n" +
            "},\n" +
            "{\n" +
            "\tname: \"金顶\",\n" +
            "\t//地图名称text: Array(\"这就是峨嵋山的主峰金顶了\"),\n" +
            "\t//描述判定npc: Array(\"周芷若\"),\n" +
            "\t//npcdirection: Array(//可去路径{\n" +
            "\t\tname: \"华藏庵\",\n" +
            "\t\ttext: \"西：华藏庵 ←\"\n" +
            "\t},\n" +
            "\t{\n" +
            "\t\tname: \"卧云庵\",\n" +
            "\t\ttext: \"东：卧云庵 →\"\n" +
            "\t},\n" +
            "\t{\n" +
            "\t\tname: \"接引殿\",\n" +
            "\t\ttext: \"南：接引殿 ↓\"\n" +
            "\t})\n" +
            "},\n" +
            "{\n" +
            "\tname: \"华藏庵\",\n" +
            "\t//地图名称text: Array(\"华藏庵是金顶的主要建筑\"),\n" +
            "\t//描述判定npc: Array(\"风陵师太\"),\n" +
            "\t//npcdirection: Array(//可去路径{\n" +
            "\t\tname: \"金顶\",\n" +
            "\t\ttext: \"东：金顶 →\"\n" +
            "\t})\n" +
            "},\n" +
            "{\n" +
            "\tname: \"卧云庵\",\n" +
            "\t//地图名称text: Array(\"卧云庵旁边有个井络泉\"),\n" +
            "\t//描述判定npc: Array(\"灭绝师太\"),\n" +
            "\t//npcdirection: Array(//可去路径{\n" +
            "\t\tname: \"金顶\",\n" +
            "\t\ttext: \"西：金顶 ←\"\n" +
            "\t})\n" +
            "},\n" +
            "//青城山{\n" +
            "\tname: \"青城山\",\n" +
            "\t//地图名称text: Array(\"青城派的老巢\",\n" +
            "\t\"北：建福宫 ↑\"),\n" +
            "\t//描述判定npc: Array(),\n" +
            "\t//npcdirection: Array(//可去路径{\n" +
            "\t\tname: \"建福宫\",\n" +
            "\t\ttext: \"北：建福宫 ↑\"\n" +
            "\t},\n" +
            "\t{\n" +
            "\t\tname: \"成都西门\",\n" +
            "\t\ttext: \"南：成都西门 ↓\"\n" +
            "\t})\n" +
            "},\n" +
            "{\n" +
            "\tname: \"建福宫\",\n" +
            "\t//地图名称text: Array(\"相传五岳丈人宁封子修道于此，院内树木假山\"),\n" +
            "\t//描述判定npc: Array(\"青城派弟子\"),\n" +
            "\t//npcdirection: Array(//可去路径{\n" +
            "\t\tname: \"盘山磴道\",\n" +
            "\t\ttext: \"北：盘山磴道 ↑\"\n" +
            "\t},\n" +
            "\t{\n" +
            "\t\tname: \"青城山\",\n" +
            "\t\ttext: \"南：青城山 ↓\"\n" +
            "\t})\n" +
            "},\n" +
            "{\n" +
            "\tname: \"盘山磴道\",\n" +
            "\t//地图名称text: Array(\"你走在盘山磴道上，山木蔽日，幽静宜人\"),\n" +
            "\t//描述判定npc: Array(\"青城派弟子\"),\n" +
            "\t//npcdirection: Array(//可去路径{\n" +
            "\t\tname: \"天然图画\",\n" +
            "\t\ttext: \"北：天然图画 ↑\"\n" +
            "\t},\n" +
            "\t{\n" +
            "\t\tname: \"飞仙亭\",\n" +
            "\t\ttext: \"西：飞仙亭 ←\"\n" +
            "\t},\n" +
            "\t{\n" +
            "\t\tname: \"山神庙\",\n" +
            "\t\ttext: \"东：山神庙 →\"\n" +
            "\t},\n" +
            "\t{\n" +
            "\t\tname: \"建福宫\",\n" +
            "\t\ttext: \"南：建福宫 ↓\"\n" +
            "\t})\n" +
            "},\n" +
            "{\n" +
            "\tname: \"飞仙亭\",\n" +
            "\t//地图名称text: Array(\"山中一个别致的小亭，通往飞仙阁\"),\n" +
            "\t//描述判定npc: Array(\"青城派弟子\",\n" +
            "\t\"余人彦\"),\n" +
            "\t//npcdirection: Array(//可去路径{\n" +
            "\t\tname: \"盘山磴道\",\n" +
            "\t\ttext: \"东：盘山磴道 →\"\n" +
            "\t})\n" +
            "},\n" +
            "{\n" +
            "\tname: \"山神庙\",\n" +
            "\t//地图名称text: Array(\"人们在这里供奉着山神\"),\n" +
            "\t//描述判定npc: Array(\"青城派弟子\"),\n" +
            "\t//npcdirection: Array(//可去路径{\n" +
            "\t\tname: \"盘山磴道\",\n" +
            "\t\ttext: \"西：盘山磴道 ←\"\n" +
            "\t})\n" +
            "},\n" +
            "{\n" +
            "\tname: \"天然图画\",\n" +
            "\t//地图名称text: Array(\"这里岩壁矗立，绿树映辉，牌阁在山垭间巍然屹立\"),\n" +
            "\t//描述判定npc: Array(\"彭人骐\",\n" +
            "\t\"胡师弟\"),\n" +
            "\t//npcdirection: Array(//可去路径{\n" +
            "\t\tname: \"龙隐栈道\",\n" +
            "\t\ttext: \"北：龙隐栈道 ↑\"\n" +
            "\t},\n" +
            "\t{\n" +
            "\t\tname: \"八卦台\",\n" +
            "\t\ttext: \"西：八卦台 ←\"\n" +
            "\t},\n" +
            "\t{\n" +
            "\t\tname: \"鬼城山\",\n" +
            "\t\ttext: \"东：鬼城山 →\"\n" +
            "\t},\n" +
            "\t{\n" +
            "\t\tname: \"盘山磴道\",\n" +
            "\t\ttext: \"南：盘山磴道 ↓\"\n" +
            "\t})\n" +
            "},\n" +
            "{\n" +
            "\tname: \"八卦台\",\n" +
            "\t//地图名称text: Array(\"台基为方形，象征天圆地方，台上八卦亭\"),\n" +
            "\t//描述判定npc: Array(\"青城派弟子\"),\n" +
            "\t//npcdirection: Array(//可去路径{\n" +
            "\t\tname: \"天然图画\",\n" +
            "\t\ttext: \"东：天然图画 →\"\n" +
            "\t})\n" +
            "},\n" +
            "{\n" +
            "\tname: \"鬼城山\",\n" +
            "\t//地图名称text: Array(\"传为岷山真人鬼谷区（即蜀中八仙之首容成公，传为黄帝师）隐居处\"),\n" +
            "\t//描述判定npc: Array(\"青城弟子\",\n" +
            "\t\"黎师弟\"),\n" +
            "\t//npcdirection: Array(//可去路径{\n" +
            "\t\tname: \"天然图画\",\n" +
            "\t\ttext: \"西：天然图画 ←\"\n" +
            "\t})\n" +
            "},\n" +
            "{\n" +
            "\tname: \"龙隐栈道\",\n" +
            "\t//地图名称text: Array(\"龙隐峡栈道修于半山上，紧靠峭崖，旁临深壑，蜿蜒曲折\"),\n" +
            "\t//描述判定npc: Array(\"蒋师哥\",\n" +
            "\t\"马师妹\"),\n" +
            "\t//npcdirection: Array(//可去路径{\n" +
            "\t\tname: \"天师洞\",\n" +
            "\t\ttext: \"北：天师洞 ↑\"\n" +
            "\t},\n" +
            "\t{\n" +
            "\t\tname: \"五龙沟\",\n" +
            "\t\ttext: \"西：五龙沟 ←\"\n" +
            "\t},\n" +
            "\t{\n" +
            "\t\tname: \"丈人峰\",\n" +
            "\t\ttext: \"东：丈人峰 →\"\n" +
            "\t},\n" +
            "\t{\n" +
            "\t\tname: \"天然图画\",\n" +
            "\t\ttext: \"南：天然图画 ↓\"\n" +
            "\t})\n" +
            "},\n" +
            "{\n" +
            "\tname: \"五龙沟\",\n" +
            "\t//地图名称text: Array(\"五龙沟，因沟谷处在白龙、黑龙、青龙、赤龙、黄龙五峰之间，故名\"),\n" +
            "\t//描述判定npc: Array(\"吉人通\",\n" +
            "\t\"申人俊\"),\n" +
            "\t//npcdirection: Array(//可去路径{\n" +
            "\t\tname: \"龙隐栈道\",\n" +
            "\t\ttext: \"东：龙隐栈道 →\"\n" +
            "\t})\n" +
            "},\n" +
            "{\n" +
            "\tname: \"丈人峰\",\n" +
            "\t//地图名称text: Array(\"丈人峰因宁封得名\"),\n" +
            "\t//描述判定npc: Array(\"青城派弟子\",\n" +
            "\t\"皮人骥\"),\n" +
            "\t//npcdirection: Array(//可去路径{\n" +
            "\t\tname: \"龙隐栈道\",\n" +
            "\t\ttext: \"西：龙隐栈道 ←\"\n" +
            "\t})\n" +
            "},\n" +
            "{\n" +
            "\tname: \"天师洞\",\n" +
            "\t//地图名称text: Array(\"天师洞以东汉张道陵在此讲道\",\n" +
            "\t\"而得名，又名古常道观\"),\n" +
            "\t//描述判定npc: Array(\"方人智\",\n" +
            "\t\"贾人达\"),\n" +
            "\t//npcdirection: Array(//可去路径{\n" +
            "\t\tname: \"飞泉沟\",\n" +
            "\t\ttext: \"北：飞泉沟 ↑\"\n" +
            "\t},\n" +
            "\t{\n" +
            "\t\tname: \"古银杏树\",\n" +
            "\t\ttext: \"西：古银杏树 ←\"\n" +
            "\t},\n" +
            "\t{\n" +
            "\t\tname: \"三岛石\",\n" +
            "\t\ttext: \"东：三岛石 →\"\n" +
            "\t},\n" +
            "\t{\n" +
            "\t\tname: \"龙隐栈道\",\n" +
            "\t\ttext: \"南：龙隐栈道 ↓\"\n" +
            "\t})\n" +
            "},\n" +
            "{\n" +
            "\tname: \"古银杏树\",\n" +
            "\t//地图名称text: Array(\"观前古银杏树相传为张天师手植\"),\n" +
            "\t//描述判定npc: Array(\"风扬\",\n" +
            "\t\"凤翎雪儿\",\n" +
            "\t\"游客\"),\n" +
            "\t//npcdirection: Array(//可去路径{\n" +
            "\t\tname: \"天师洞\",\n" +
            "\t\ttext: \"东：天师洞 →\"\n" +
            "\t})\n" +
            "},\n" +
            "{\n" +
            "\tname: \"三岛石\",\n" +
            "\t//地图名称text: Array(\"三岛石上刻降魔二字，相传为张天师当年降魔\"),\n" +
            "\t//描述判定npc: Array(\"游客\"),\n" +
            "\t//npcdirection: Array(//可去路径{\n" +
            "\t\tname: \"天师洞\",\n" +
            "\t\ttext: \"西：天师洞 ←\"\n" +
            "\t})\n" +
            "},\n" +
            "{\n" +
            "\tname: \"飞泉沟\",\n" +
            "\t//地图名称text: Array(\"飞泉沟，全长10公里，源出蓥华山南天门，流入味江\"),\n" +
            "\t//描述判定npc: Array(\"素衣少女\",\n" +
            "\t\"紫衣少女\",\n" +
            "\t\"游客\"),\n" +
            "\t//npcdirection: Array(//可去路径{\n" +
            "\t\tname: \"观日亭\",\n" +
            "\t\ttext: \"北：观日亭 ↑\"\n" +
            "\t},\n" +
            "\t{\n" +
            "\t\tname: \"熊耳山\",\n" +
            "\t\ttext: \"西：熊耳山 ←\"\n" +
            "\t},\n" +
            "\t{\n" +
            "\t\tname: \"四望台\",\n" +
            "\t\ttext: \"东：四望台 →\"\n" +
            "\t},\n" +
            "\t{\n" +
            "\t\tname: \"天师洞\",\n" +
            "\t\ttext: \"南：天师洞 ↓\"\n" +
            "\t})\n" +
            "},\n" +
            "{\n" +
            "\tname: \"熊耳山\",\n" +
            "\t//地图名称text: Array(\"熊耳山有两峰向中倾斜，状似熊耳，故名\"),\n" +
            "\t//描述判定npc: Array(\"青城派弟子\"),\n" +
            "\t//npcdirection: Array(//可去路径{\n" +
            "\t\tname: \"飞泉沟\",\n" +
            "\t\ttext: \"东：飞泉沟 →\"\n" +
            "\t})\n" +
            "},\n" +
            "{\n" +
            "\tname: \"四望台\",\n" +
            "\t//地图名称text: Array(\"台山可以环顾四方，欣赏美景\"),\n" +
            "\t//描述判定npc: Array(\"青城派弟子\"),\n" +
            "\t//npcdirection: Array(//可去路径{\n" +
            "\t\tname: \"飞泉沟\",\n" +
            "\t\ttext: \"西：飞泉沟 ←\"\n" +
            "\t})\n" +
            "},\n" +
            "{\n" +
            "\tname: \"观日亭\",\n" +
            "\t//地图名称text: Array(\"远观东方日出，感受大自然的魅力\"),\n" +
            "\t//描述判定npc: Array(\"恒灿\",\n" +
            "\t\"恒青\",\n" +
            "\t\"小黛\",\n" +
            "\t\"朝露\"),\n" +
            "\t//npcdirection: Array(//可去路径{\n" +
            "\t\tname: \"上清宫\",\n" +
            "\t\ttext: \"北：上清宫 ↑\"\n" +
            "\t},\n" +
            "\t{\n" +
            "\t\tname: \"百丈桥\",\n" +
            "\t\ttext: \"西：百丈桥 ←\"\n" +
            "\t},\n" +
            "\t{\n" +
            "\t\tname: \"云海亭\",\n" +
            "\t\ttext: \"东：云海亭 →\"\n" +
            "\t},\n" +
            "\t{\n" +
            "\t\tname: \"飞泉沟\",\n" +
            "\t\ttext: \"南：飞泉沟 ↓\"\n" +
            "\t})\n" +
            "},\n" +
            "{\n" +
            "\tname: \"百丈桥\",\n" +
            "\t//地图名称text: Array(\"百丈长桥为悬崖上的栈道，满挂古树苍藤\"),\n" +
            "\t//描述判定npc: Array(\"青城派弟子\"),\n" +
            "\t//npcdirection: Array(//可去路径{\n" +
            "\t\tname: \"观日亭\",\n" +
            "\t\ttext: \"东：观日亭 →\"\n" +
            "\t})\n" +
            "},\n" +
            "{\n" +
            "\tname: \"云海亭\",\n" +
            "\t//地图名称text: Array(\"亭外云海飘渺，云上诸峰，宛若仙岛\"),\n" +
            "\t//描述判定npc: Array(\"青城派弟子\",\n" +
            "\t\"游客\"),\n" +
            "\t//npcdirection: Array(//可去路径{\n" +
            "\t\tname: \"观日亭\",\n" +
            "\t\ttext: \"西：观日亭 ←\"\n" +
            "\t})\n" +
            "},\n" +
            "{\n" +
            "\tname: \"上清宫\",\n" +
            "\t//地图名称text: Array(\"上清宫是老君道场。宫前山门，矮树搭就，甚为灵动\"),\n" +
            "\t//描述判定npc: Array(\"罗人杰\",\n" +
            "\t\"侯人英\"),\n" +
            "\t//npcdirection: Array(//可去路径{\n" +
            "\t\tname: \"呼应亭\",\n" +
            "\t\ttext: \"北：呼应亭 ↑\"\n" +
            "\t},\n" +
            "\t{\n" +
            "\t\tname: \"鸳鸯井\",\n" +
            "\t\ttext: \"西：鸳鸯井 ←\"\n" +
            "\t},\n" +
            "\t{\n" +
            "\t\tname: \"松风观\",\n" +
            "\t\ttext: \"东：松风观 →\"\n" +
            "\t},\n" +
            "\t{\n" +
            "\t\tname: \"观日亭\",\n" +
            "\t\ttext: \"南：观日亭 ↓\"\n" +
            "\t})\n" +
            "},\n" +
            "{\n" +
            "\tname: \"鸳鸯井\",\n" +
            "\t//地图名称text: Array(\"鸳鸯井一方一圆，泉流暗通，圆者水浊\"),\n" +
            "\t//描述判定npc: Array(\"游客\",\n" +
            "\t\"洪人雄\"),\n" +
            "\t//npcdirection: Array(//可去路径{\n" +
            "\t\tname: \"上清宫\",\n" +
            "\t\ttext: \"东：上清宫 →\"\n" +
            "\t})\n" +
            "},\n" +
            "{\n" +
            "\tname: \"松风观\",\n" +
            "\t//地图名称text: Array(\"这里是松风观，是青城派总所\"),\n" +
            "\t//描述判定npc: Array(\"游客\"),\n" +
            "\t//npcdirection: Array(//可去路径{\n" +
            "\t\tname: \"上清宫\",\n" +
            "\t\ttext: \"西：上清宫 ←\"\n" +
            "\t})\n" +
            "},\n" +
            "{\n" +
            "\tname: \"呼应亭\",\n" +
            "\t//地图名称text: Array(\"呼应亭高居彭祖峰顶，是青城最高处\"),\n" +
            "\t//描述判定npc: Array(\"余沧海\",\n" +
            "\t\"余人豪\",\n" +
            "\t\"游客\"),\n" +
            "\t//npcdirection: Array(//可去路径{\n" +
            "\t\tname: \"朝阳洞\",\n" +
            "\t\ttext: \"西：朝阳洞 ←\"\n" +
            "\t},\n" +
            "\t{\n" +
            "\t\tname: \"悬崖底\",\n" +
            "\t\ttext: \"东：悬崖底 →\"\n" +
            "\t},\n" +
            "\t{\n" +
            "\t\tname: \"上清宫\",\n" +
            "\t\ttext: \"南：上清宫 ↓\"\n" +
            "\t})\n" +
            "},\n" +
            "{\n" +
            "\tname: \"朝阳洞\",\n" +
            "\t//地图名称text: Array(\"这里是观日好去处，古洞常临光照耀\"),\n" +
            "\t//描述判定npc: Array(\"长青子\"),\n" +
            "\t//npcdirection: Array(//可去路径{\n" +
            "\t\tname: \"呼应亭\",\n" +
            "\t\ttext: \"东：呼应亭 →\"\n" +
            "\t})\n" +
            "},\n" +
            "{\n" +
            "\tname: \"悬崖底\",\n" +
            "\t//地图名称text: Array(\"爬悬崖\",\n" +
            "\t\"西：呼应亭 ←\"),\n" +
            "\t//描述判定npc: Array(),\n" +
            "\t//npcdirection: Array(//可去路径{\n" +
            "\t\tname: \"呼应亭\",\n" +
            "\t\ttext: \"西：呼应亭 ←\"\n" +
            "\t})\n" +
            "},\n" +
            "{\n" +
            "\tname: \"白玉牌楼\",\n" +
            "\t//地图名称text: Array(\"一座汉白玉的巨大牌楼\",\n" +
            "\t\"北：十长老殿\",\n" +
            "\t\"南：议事厅\"),\n" +
            "\t//描述判定npc: Array(\"魔教长老\"),\n" +
            "\t//npcdirection: Array(//可去路径{\n" +
            "\t\tname: \"十长老殿\",\n" +
            "\t\ttext: \"北：十长老殿 ↑\"\n" +
            "\t},\n" +
            "\t{\n" +
            "\t\tname: \"议事厅\",\n" +
            "\t\ttext: \"南：议事厅 ↓\"\n" +
            "\t})\n" +
            "},\n" +
            "{\n" +
            "\tname: \"十长老殿\",\n" +
            "\t//地图名称text: Array(\"这是一间空荡荡的练功室\",\n" +
            "\t\"北：九长老殿\",\n" +
            "\t\"南：白玉牌楼\"),\n" +
            "\t//描述判定npc: Array(\"怜星魔女楚彤\"),\n" +
            "\t//npcdirection: Array(//可去路径{\n" +
            "\t\tname: \"九长老殿\",\n" +
            "\t\ttext: \"北：九长老殿 ↑\"\n" +
            "\t},\n" +
            "\t{\n" +
            "\t\tname: \"白玉牌楼\",\n" +
            "\t\ttext: \"南：白玉牌楼 ↓\"\n" +
            "\t})\n" +
            "},\n" +
            "{\n" +
            "\tname: \"九长老殿\",\n" +
            "\t//地图名称text: Array(\"这是一间空荡荡的练功室\",\n" +
            "\t\"北：八长老殿\",\n" +
            "\t\"南：十长老殿\"),\n" +
            "\t//描述判定npc: Array(\"裂地神魔巨灵\"),\n" +
            "\t//npcdirection: Array(//可去路径{\n" +
            "\t\tname: \"八长老殿\",\n" +
            "\t\ttext: \"北：八长老殿 ↑\"\n" +
            "\t},\n" +
            "\t{\n" +
            "\t\tname: \"十长老殿\",\n" +
            "\t\ttext: \"南：十长老殿 ↓\"\n" +
            "\t})\n" +
            "},\n" +
            "{\n" +
            "\tname: \"八长老殿\",\n" +
            "\t//地图名称text: Array(\"这是一间空荡荡的练功室\",\n" +
            "\t\"北：七长老殿\",\n" +
            "\t\"南：九长老殿\"),\n" +
            "\t//描述判定npc: Array(\"大力神魔范松\"),\n" +
            "\t//npcdirection: Array(//可去路径{\n" +
            "\t\tname: \"七长老殿\",\n" +
            "\t\ttext: \"北：七长老殿 ↑\"\n" +
            "\t},\n" +
            "\t{\n" +
            "\t\tname: \"九长老殿\",\n" +
            "\t\ttext: \"南：九长老殿 ↓\"\n" +
            "\t})\n" +
            "},\n" +
            "{\n" +
            "\tname: \"七长老殿\",\n" +
            "\t//地图名称text: Array(\"这是一间空荡荡的练功室\",\n" +
            "\t\"北：六长老殿\",\n" +
            "\t\"南：八长老殿\"),\n" +
            "\t//描述判定npc: Array(\"刺日神魔杨延庆\"),\n" +
            "\t//npcdirection: Array(//可去路径{\n" +
            "\t\tname: \"六长老殿\",\n" +
            "\t\ttext: \"北：六长老殿 ↑\"\n" +
            "\t},\n" +
            "\t{\n" +
            "\t\tname: \"八长老殿\",\n" +
            "\t\ttext: \"南：八长老殿 ↓\"\n" +
            "\t})\n" +
            "},\n" +
            "{\n" +
            "\tname: \"六长老殿\",\n" +
            "\t//地图名称text: Array(\"这是一间空荡荡的练功室\",\n" +
            "\t\"北：神殿\",\n" +
            "\t\"南：七长老殿\"),\n" +
            "\t//描述判定npc: Array(\"追月魔女花想容\"),\n" +
            "\t//npcdirection: Array(//可去路径{\n" +
            "\t\tname: \"神殿\",\n" +
            "\t\ttext: \"北：神殿 ↑\"\n" +
            "\t},\n" +
            "\t{\n" +
            "\t\tname: \"七长老殿\",\n" +
            "\t\ttext: \"南：七长老殿\"\n" +
            "\t})\n" +
            "},\n" +
            "{\n" +
            "\tname: \"神殿\",\n" +
            "\t//地图名称text: Array(\"殿顶由四根八丈高的红柱撑著\",\n" +
            "\t\"北：山顶小屋\",\n" +
            "\t\"南：六长老殿\"),\n" +
            "\t//描述判定npc: Array(\"金猴神魔张乘风\",\n" +
            "\t\"白猿神魔张乘云\",\n" +
            "\t\"刀痴神魔叶天涯\",\n" +
            "\t\"飞天神魔赵鹤\",\n" +
            "\t\"天音神魔曲洋\"),\n" +
            "\t//npcdirection: Array(//可去路径{\n" +
            "\t\tname: \"山顶小屋\",\n" +
            "\t\ttext: \"北：山顶小屋 ↑\"\n" +
            "\t},\n" +
            "\t{\n" +
            "\t\tname: \"六长老殿\",\n" +
            "\t\ttext: \"南：六长老殿 ↓\"\n" +
            "\t})\n" +
            "},\n" +
            "{\n" +
            "\tname: \"山顶小屋\",\n" +
            "\t//地图名称text: Array(\"南：神殿 ↓\"),\n" +
            "\t//描述判定npc: Array(\"风无影\"),\n" +
            "\t//npcdirection: Array(//可去路径{\n" +
            "\t\tname: \"神殿\",\n" +
            "\t\ttext: \"南：神殿 ↓\"\n" +
            "\t})\n" +
            "},\n" +
            "{\n" +
            "\tname: \"童百熊挡路\",\n" +
            "\t//地图名称text: Array(\"本派长老，岂是你这等俗人能面见的\"),\n" +
            "\t//描述判定npc: Array(),\n" +
            "\t//npcdirection: Array(//可去路径{\n" +
            "\t\tname: \"议事厅\",\n" +
            "\t\ttext: \"返回游戏\"\n" +
            "\t})\n" +
            "},\n" +
            "{\n" +
            "\tname: \"叶天涯挡路\",\n" +
            "\t//地图名称text: Array(\"叶天涯拦住了你：本教重地，不得乱闯\"),\n" +
            "\t//描述判定npc: Array(),\n" +
            "\t//npcdirection: Array(//可去路径{\n" +
            "\t\tname: \"神殿\",\n" +
            "\t\ttext: \"返回游戏\"\n" +
            "\t})\n" +
            "},\n" +
            "{\n" +
            "\tname: \"花想容挡路\",\n" +
            "\t//地图名称text: Array(\"花想容拦住了你：除非变成鬼，你是休想从这离开了\"),\n" +
            "\t//描述判定npc: Array(),\n" +
            "\t//npcdirection: Array(//可去路径{\n" +
            "\t\tname: \"六长老殿\",\n" +
            "\t\ttext: \"返回游戏\"\n" +
            "\t})\n" +
            "},\n" +
            "{\n" +
            "\tname: \"教碑\",\n" +
            "\t//地图名称text: Array(\"这里是全真教的教碑所在地\",\n" +
            "\t\"西：终南山脚\",\n" +
            "\t\"南：全真教大门\"),\n" +
            "\t//描述判定npc: Array(\"全真三代弟子\"),\n" +
            "\t//npcdirection: Array(//可去路径{\n" +
            "\t\tname: \"终南山脚\",\n" +
            "\t\ttext: \"西：终南山脚 ←\"\n" +
            "\t},\n" +
            "\t{\n" +
            "\t\tname: \"全真教大门\",\n" +
            "\t\ttext: \"南：全真教大门 ↓\"\n" +
            "\t})\n" +
            "},\n" +
            "{\n" +
            "\tname: \"全真教大门\",\n" +
            "\t//地图名称text: Array(\"殿宇依山而筑，高低错落有致\",\n" +
            "\t\"北：教碑\",\n" +
            "\t\"南：广场\"),\n" +
            "\t//描述判定npc: Array(\"刘处玄\",\n" +
            "\t\"孙不二\",\n" +
            "\t\"志平道长\",\n" +
            "\t\"王处一\",\n" +
            "\t\"郝大通\"),\n" +
            "\t//npcdirection: Array(//可去路径{\n" +
            "\t\tname: \"教碑\",\n" +
            "\t\ttext: \"北：教碑 ↑\"\n" +
            "\t},\n" +
            "\t{\n" +
            "\t\tname: \"全真教广场\",\n" +
            "\t\ttext: \"南：广场 ↓\"\n" +
            "\t})\n" +
            "},\n" +
            "{\n" +
            "\tname: \"全真教广场\",\n" +
            "\t//地图名称text: Array(\"北：全真教大门 ↑\",\n" +
            "\t\"南：大堂一进\"),\n" +
            "\t//描述判定npc: Array(),\n" +
            "\t//npcdirection: Array(//可去路径{\n" +
            "\t\tname: \"全真教大门\",\n" +
            "\t\ttext: \"北：全真教大门 ↑\"\n" +
            "\t},\n" +
            "\t{\n" +
            "\t\tname: \"天罡台\",\n" +
            "\t\ttext: \"西：天罡台 ←\"\n" +
            "\t},\n" +
            "\t{\n" +
            "\t\tname: \"全真教休息室\",\n" +
            "\t\ttext: \"东：休息室 →\"\n" +
            "\t},\n" +
            "\t{\n" +
            "\t\tname: \"大堂一进\",\n" +
            "\t\ttext: \"南：大堂一进 ↓\"\n" +
            "\t})\n" +
            "},\n" +
            "{\n" +
            "\tname: \"天罡台\",\n" +
            "\t//地图名称text: Array(\"全真教徒弟演练天罡北斗大阵之所\",\n" +
            "\t\"东：广场\"),\n" +
            "\t//描述判定npc: Array(\"王志明\",\n" +
            "\t\"于志可\",\n" +
            "\t\"夏志成\",\n" +
            "\t\"张志素\"),\n" +
            "\t//npcdirection: Array(//可去路径{\n" +
            "\t\tname: \"全真教广场\",\n" +
            "\t\ttext: \"东：广场 →\"\n" +
            "\t})\n" +
            "},\n" +
            "{\n" +
            "\tname: \"全真教休息室\",\n" +
            "\t//地图名称text: Array(\"睡觉\",\n" +
            "\t\"西：广场 ←\"),\n" +
            "\t//描述判定npc: Array(),\n" +
            "\t//npcdirection: Array(//可去路径{\n" +
            "\t\tname: \"全真教广场\",\n" +
            "\t\ttext: \"西：广场 ←\"\n" +
            "\t})\n" +
            "},\n" +
            "{\n" +
            "\tname: \"大堂一进\",\n" +
            "\t//地图名称text: Array(\"是全真教接待客人的地方\",\n" +
            "\t\"北：广场\",\n" +
            "\t\"西：万物堂\",\n" +
            "\t\"东：会真堂\",\n" +
            "\t\"南：大堂二进\"),\n" +
            "\t//描述判定npc: Array(\"赵志敬\",\n" +
            "\t\"祁志诚\"),\n" +
            "\t//npcdirection: Array(//可去路径{\n" +
            "\t\tname: \"全真教广场\",\n" +
            "\t\ttext: \"北：广场 ↑\"\n" +
            "\t},\n" +
            "\t{\n" +
            "\t\tname: \"万物堂\",\n" +
            "\t\ttext: \"西：万物堂 ←\"\n" +
            "\t},\n" +
            "\t{\n" +
            "\t\tname: \"会真堂\",\n" +
            "\t\ttext: \"东：会真堂 →\"\n" +
            "\t},\n" +
            "\t{\n" +
            "\t\tname: \"大堂二进\",\n" +
            "\t\ttext: \"南：大堂二进 ↓\"\n" +
            "\t})\n" +
            "},\n" +
            "{\n" +
            "\tname: \"万物堂\",\n" +
            "\t//地图名称text: Array(\"这里是全真七子之五王处一的居所\",\n" +
            "\t\"东：大堂一进\"),\n" +
            "\t//描述判定npc: Array(\"全真一代弟子\"),\n" +
            "\t//npcdirection: Array(//可去路径{\n" +
            "\t\tname: \"大堂一进\",\n" +
            "\t\ttext: \"东：大堂一进 →\"\n" +
            "\t})\n" +
            "},\n" +
            "{\n" +
            "\tname: \"会真堂\",\n" +
            "\t//地图名称text: Array(\"这里是大堂旁边的一个侧厅\",\n" +
            "\t\"西：大堂一进\"),\n" +
            "\t//描述判定npc: Array(\"全真一代弟子\"),\n" +
            "\t//npcdirection: Array(//可去路径{\n" +
            "\t\tname: \"大堂一进\",\n" +
            "\t\ttext: \"西：大堂一进 ←\"\n" +
            "\t})\n" +
            "},\n" +
            "{\n" +
            "\tname: \"大堂二进\",\n" +
            "\t//地图名称text: Array(\"这里是大堂的第二重\",\n" +
            "\t\"北：大堂一进\",\n" +
            "\t\"西：过真殿\",\n" +
            "\t\"东：乃容殿\",\n" +
            "\t\"南：后山密室\"),\n" +
            "\t//描述判定npc: Array(\"宋德方\",\n" +
            "\t\"李志常\"),\n" +
            "\t//npcdirection: Array(//可去路径{\n" +
            "\t\tname: \"大堂一进\",\n" +
            "\t\ttext: \"北：大堂一进 ↑\"\n" +
            "\t},\n" +
            "\t{\n" +
            "\t\tname: \"过真殿\",\n" +
            "\t\ttext: \"西：过真殿 ←\"\n" +
            "\t},\n" +
            "\t{\n" +
            "\t\tname: \"乃容殿\",\n" +
            "\t\ttext: \"东：乃容殿 →\"\n" +
            "\t},\n" +
            "\t{\n" +
            "\t\tname: \"后山密室\",\n" +
            "\t\ttext: \"南：后山密室 ↓\"\n" +
            "\t})\n" +
            "},\n" +
            "{\n" +
            "\tname: \"过真殿\",\n" +
            "\t//地图名称text: Array(\"这里是大堂旁边的一个侧殿\",\n" +
            "\t\"东：大堂二进\"),\n" +
            "\t//描述判定npc: Array(\"全真三代弟子\"),\n" +
            "\t//npcdirection: Array(//可去路径{\n" +
            "\t\tname: \"大堂二进\",\n" +
            "\t\ttext: \"东：大堂二进 →\"\n" +
            "\t})\n" +
            "},\n" +
            "{\n" +
            "\tname: \"乃容殿\",\n" +
            "\t//地图名称text: Array(\"这里是大堂旁边的一个侧殿\",\n" +
            "\t\"西：大堂二进\"),\n" +
            "\t//描述判定npc: Array(\"全真二代弟子\"),\n" +
            "\t//npcdirection: Array(//可去路径{\n" +
            "\t\tname: \"大堂二进\",\n" +
            "\t\ttext: \"西：大堂二进 ←\"\n" +
            "\t})\n" +
            "},\n" +
            "{\n" +
            "\tname: \"后山密室\",\n" +
            "\t//地图名称text: Array(\"重阳宫后山的密室，囚禁着四名罪恶滔天之徒\",\n" +
            "\t\"北：大堂二进\"),\n" +
            "\t//描述判定npc: Array(\"通天\",\n" +
            "\t\"通海\",\n" +
            "\t\"连虎\",\n" +
            "\t\"子翁\"),\n" +
            "\t//npcdirection: Array(//可去路径{\n" +
            "\t\tname: \"大堂二进\",\n" +
            "\t\ttext: \"北：大堂二进 ↑\"\n" +
            "\t})\n" +
            "},\n" +
            "{\n" +
            "\tname: \"夺宝风云馆\",\n" +
            "\t//地图名称text: Array(\"在这里的，就是当年名震天下的夺宝一区十大高手\"),\n" +
            "\t//描述判定npc: Array(\"枪剑魂\",\n" +
            "\t\"心跳\",\n" +
            "\t\"冰峰\",\n" +
            "\t\"剑神\",\n" +
            "\t\"一阳指\",\n" +
            "\t\"七星\",\n" +
            "\t\"墨明智\",\n" +
            "\t\"平野\",\n" +
            "\t\"剑。\",\n" +
            "\t\"天下庸才\"),\n" +
            "\t//npcdirection: Array(//可去路径{\n" +
            "\t\tname: \"夺宝笑傲馆\",\n" +
            "\t\ttext: \"北：夺宝笑傲馆 ↑\"\n" +
            "\t},\n" +
            "\t{\n" +
            "\t\tname: \"夺宝英雄馆\",\n" +
            "\t\ttext: \"西：夺宝英雄馆 ←\"\n" +
            "\t},\n" +
            "\t{\n" +
            "\t\tname: \"江湖大厅论坛\",\n" +
            "\t\ttext: \"东：江湖大厅论坛 →\"\n" +
            "\t},\n" +
            "\t{\n" +
            "\t\tname: \"夺宝大侠馆\",\n" +
            "\t\ttext: \"南：夺宝大侠馆 ↓\"\n" +
            "\t})\n" +
            "},\n" +
            "{\n" +
            "\tname: \"夺宝笑傲馆\",\n" +
            "\t//地图名称text: Array(\"在这里的，是当今夺宝四区的顶尖高手\",\n" +
            "\t\"北：夺宝美女馆\",\n" +
            "\t\"南：夺宝风云馆\"),\n" +
            "\t//描述判定npc: Array(\"魔教第二代弟子「越修修越少」张小凡\",\n" +
            "\t\"魔教第二代弟子「＞＝英＊雄＝＜」君行天崖\",\n" +
            "\t\"魔教第二代弟子「＃新购数据＃」倾心\",\n" +
            "\t\"少林寺第三代弟子「我在修小号勿扰」西门\",\n" +
            "\t\"少林寺第三代弟子「我就是著自由」冷秋风\",\n" +
            "\t\"魔教第二代弟子「※火龙※」上官薇儿\",\n" +
            "\t\"少林寺第三代弟子「土匪为你贺寿」天下无双\",\n" +
            "\t\"魔教第二代弟子「三个刚够打！」：张三丰\",\n" +
            "\t\"少林寺第三代弟子「动火龙军团者死」团长\",\n" +
            "\t\"五岳剑派第一代弟子「火龙军团」凡\"),\n" +
            "\t//npcdirection: Array(//可去路径{\n" +
            "\t\tname: \"夺宝美女馆\",\n" +
            "\t\ttext: \"北：夺宝美女馆 ↑\"\n" +
            "\t},\n" +
            "\t{\n" +
            "\t\tname: \"夺宝风云馆\",\n" +
            "\t\ttext: \"南：夺宝风云馆 ↓\"\n" +
            "\t})\n" +
            "},\n" +
            "{\n" +
            "\tname: \"夺宝美女馆\",\n" +
            "\t//地图名称text: Array(\"在这里的，就是闻名夺宝的十大美女\",\n" +
            "\t\"北：夺宝富翁馆\",\n" +
            "\t\"南：夺宝笑傲馆\"),\n" +
            "\t//描述判定npc: Array(\"秋水依人\",\n" +
            "\t\"陈晓\",\n" +
            "\t\"宝宝\",\n" +
            "\t\"人淡似菊\",\n" +
            "\t\"小鹿藏刀\",\n" +
            "\t\"紫扇魔女\",\n" +
            "\t\"银月\",\n" +
            "\t\"嫣柔\",\n" +
            "\t\"紫凝儿\"),\n" +
            "\t//npcdirection: Array(//可去路径{\n" +
            "\t\tname: \"夺宝富翁馆\",\n" +
            "\t\ttext: \"北：夺宝富翁馆 ↑\"\n" +
            "\t},\n" +
            "\t{\n" +
            "\t\tname: \"夺宝笑傲馆\",\n" +
            "\t\ttext: \"南：夺宝笑傲馆 ↓\"\n" +
            "\t})\n" +
            "},\n" +
            "{\n" +
            "\tname: \"夺宝富翁馆\",\n" +
            "\t//地图名称text: Array(\"在这里的，是夺宝各区最富有的人，他们富可敌国\",\n" +
            "\t\"南：夺宝美女馆\"),\n" +
            "\t//描述判定npc: Array(\"赵敏郡主\",\n" +
            "\t\"隐侠\",\n" +
            "\t\"梦雨儿\",\n" +
            "\t\"AC米兰\",\n" +
            "\t\"小小叶子\",\n" +
            "\t\"oooo\",\n" +
            "\t\"～火～\",\n" +
            "\t\"孤剑\",\n" +
            "\t\"粉色饭团\",\n" +
            "\t\"君心傲然\"),\n" +
            "\t//npcdirection: Array(//可去路径{\n" +
            "\t\tname: \"夺宝美女馆\",\n" +
            "\t\ttext: \"南：夺宝美女馆 ↓\"\n" +
            "\t})\n" +
            "},\n" +
            "{\n" +
            "\tname: \"夺宝英雄馆\",\n" +
            "\t//地图名称text: Array(\"在这里的，是当今纵横夺宝三区的十大高手\",\n" +
            "\t\"西：夺宝宗师馆\",\n" +
            "\t\"东：夺宝风云馆\"),\n" +
            "\t//描述判定npc: Array(\"少林寺第一代弟子「＊」少林金刚\",\n" +
            "\t\"少林寺第一代弟子「＝＊＝」成真\",\n" +
            "\t\"少林寺第一代弟子「同心心同」君无忌\",\n" +
            "\t\"魔教第一代弟子「同心＆点第一个」首相　\",\n" +
            "\t\"魔教第二代弟子「慢慢向一代靠近」令孤冲\",\n" +
            "\t\"魔教第一代弟子「血战潮风」开心就好\",\n" +
            "\t\"少林寺第一代弟子「赵曲花」┻┳┳┻\",\n" +
            "\t\"魔教第一代弟子「燕赵＆巡逻员」君中之霸\",\n" +
            "\t\"魔教第一代弟子「联军血洗了同心」江湖二世\",\n" +
            "\t\"少林寺第一代弟子「害俺坐牢」魅影战机\"),\n" +
            "\t//npcdirection: Array(//可去路径{\n" +
            "\t\tname: \"夺宝宗师馆\",\n" +
            "\t\ttext: \"西：夺宝宗师馆 ←\"\n" +
            "\t},\n" +
            "\t{\n" +
            "\t\tname: \"夺宝风云馆\",\n" +
            "\t\ttext: \"东：夺宝风云馆 →\"\n" +
            "\t})\n" +
            "},\n" +
            "{\n" +
            "\tname: \"夺宝宗师馆\",\n" +
            "\t//地图名称text: Array(\"在这里的，是夺宝闻名的十大宗师，他们的门徒遍布天下\",\n" +
            "\t\"东：夺宝英雄馆\"),\n" +
            "\t//描述判定npc: Array(\"君心傲然\",\n" +
            "\t\"沙漠侠隐\",\n" +
            "\t\"大肥猫\",\n" +
            "\t\"逍遥仙子\",\n" +
            "\t\"花无缺\",\n" +
            "\t\"曹*机场\",\n" +
            "\t\"阿飞\",\n" +
            "\t\"霞姑\",\n" +
            "\t\"孤独行\",\n" +
            "\t\"小勤\",\n" +
            "\t\"曹操机场\"),\n" +
            "\t//npcdirection: Array(//可去路径{\n" +
            "\t\tname: \"夺宝英雄馆\",\n" +
            "\t\ttext: \"东：夺宝英雄馆 →\"\n" +
            "\t})\n" +
            "},\n" +
            "{\n" +
            "\tname: \"夺宝大侠馆\",\n" +
            "\t//地图名称text: Array(\"在这里的，是当今名满夺宝二区的十大高手\",\n" +
            "\t\"北：夺宝风云馆 ↑\",\n" +
            "\t\"东：夺宝杀手馆 →\"),\n" +
            "\t//描述判定npc: Array(\"少林寺第一代弟子「出手匪夷所思」李逍遥\",\n" +
            "\t\"沙漠隐侠\",\n" +
            "\t\"魔教第一代弟子「★★★★★精武」AC米兰\",\n" +
            "\t\"魔教第一代弟子「遍布大地的群山」萧三少\",\n" +
            "\t\"胄小铠\",\n" +
            "\t\"少林寺第一代弟子「兄弟们再见」隐侠\",\n" +
            "\t\"五岳剑派第一代弟子「精武米兰玲珑」冷剑客\",\n" +
            "\t\"五岳剑派第一代弟子「挖哈哈」小笑\",\n" +
            "\t\"少林寺第一代弟子「概不回信」开心果\",\n" +
            "\t\"魔教第一代弟子「清风就会逃」狂剑\"),\n" +
            "\t//npcdirection: Array(//可去路径{\n" +
            "\t\tname: \"夺宝风云馆\",\n" +
            "\t\ttext: \"北：夺宝风云馆 ↑\"\n" +
            "\t},\n" +
            "\t{\n" +
            "\t\tname: \"夺宝杀手馆\",\n" +
            "\t\ttext: \"东：夺宝杀手馆 →\"\n" +
            "\t})\n" +
            "},\n" +
            "{\n" +
            "\tname: \"夺宝杀手馆\",\n" +
            "\t//地图名称text: Array(\"在这里的，是令人闻风丧胆的夺宝十大杀手\",\n" +
            "\t\"西：夺宝大侠馆\",\n" +
            "\t\"东：夺宝帮主馆\"),\n" +
            "\t//描述判定npc: Array(\"刀法\",\n" +
            "\t\"九天龙魂\",\n" +
            "\t\"小无敌\",\n" +
            "\t\"靓子南\",\n" +
            "\t\"洪兴鸡爷\",\n" +
            "\t\"黄含羽\",\n" +
            "\t\"剑圣浪子\",\n" +
            "\t\"飘千里\",\n" +
            "\t\"冰河时代\",\n" +
            "\t\"雕\"),\n" +
            "\t//npcdirection: Array(//可去路径{\n" +
            "\t\tname: \"夺宝大侠馆\",\n" +
            "\t\ttext: \"西：夺宝大侠馆 ←\"\n" +
            "\t},\n" +
            "\t{\n" +
            "\t\tname: \"夺宝帮主馆\",\n" +
            "\t\ttext: \"东：夺宝帮主馆 →\"\n" +
            "\t})\n" +
            "},\n" +
            "{\n" +
            "\tname: \"夺宝帮主馆\",\n" +
            "\t//地图名称text: Array(\"在这里的，是夺宝各区各大帮的帮主或创始人\",\n" +
            "\t\"西：夺宝杀手馆\"),\n" +
            "\t//描述判定npc: Array(\"仁龙盟盟主刀神\",\n" +
            "\t\"阳光\",\n" +
            "\t\"冷凌枫归来\",\n" +
            "\t\"小资人生\",\n" +
            "\t\"塔虎城城主小鱼儿\",\n" +
            "\t\"潇湘联盟盟主宝贝梦飞\",\n" +
            "\t\"血战兄弟盟盟主英雄霸气\",\n" +
            "\t\"天魔教教主冷如霜\",\n" +
            "\t\"浙盟盟主海角天涯\",\n" +
            "\t\"雪逸宫宫主绝情浪子\",\n" +
            "\t\"火龙军团创始人皖军火龙\",\n" +
            "\t\"雪花宫宫主俏皮美眉\",\n" +
            "\t\"桃花岛岛主渡口\",\n" +
            "\t\"聚贤庄庄主冷面浪人\",\n" +
            "\t\"风尘联盟盟主杀戮天下\",\n" +
            "\t\"义帮帮主李嘉城\",\n" +
            "\t\"精武盟盟主断桥残雪\",\n" +
            "\t\"绝情谷谷主段誉\",\n" +
            "\t\"凤翎山庄庄主南风翎\",\n" +
            "\t\"菜鸟帮帮主己书\",\n" +
            "\t\"神仙岛岛主任我行\",\n" +
            "\t\"百花谷谷主花满楼\",\n" +
            "\t\"杀手门门主夺宝兄弟\",\n" +
            "\t\"赛亚盟盟主奥迪\",\n" +
            "\t\"同心阁阁主首相\",\n" +
            "\t\"贼窝窝主\",\n" +
            "\t\"武王府府主雾夜\",\n" +
            "\t\"3G盟盟主大胆出剑\",\n" +
            "\t\"铁血盟盟主毒药\",\n" +
            "\t\"潮盟盟主万佛朝宗\",\n" +
            "\t\"魔刀帮主刀锋\"),\n" +
            "\t//npcdirection: Array(//可去路径{\n" +
            "\t\tname: \"夺宝杀手馆\",\n" +
            "\t\ttext: \"西：夺宝杀手馆 ←\"\n" +
            "\t})\n" +
            "},\n" +
            "{\n" +
            "\tname: \"独行盗挡了路\",\n" +
            "\t//地图名称text: Array(\"独行盗挡住了你的去路：不留下金子，休想从此地过去\"),\n" +
            "\t//描述判定npc: Array(),\n" +
            "\t//npcdirection: Array(//可去路径{\n" +
            "\t\tname: \"潼关\",\n" +
            "\t\ttext: \"返回游戏\"\n" +
            "\t})\n" +
            "},\n" +
            "{\n" +
            "\tname: \"老汉挡了路\",\n" +
            "\t//地图名称text: Array(\"老汉拦住了你：年轻人，不要乱闯，岭上有老虎\"),\n" +
            "\t//描述判定npc: Array(),\n" +
            "\t//npcdirection: Array(//可去路径{\n" +
            "\t\tname: \"秦岭\",\n" +
            "\t\ttext: \"返回游戏\"\n" +
            "\t})\n" +
            "},\n" +
            "{\n" +
            "\tname: \"蓑笠客挡了路\",\n" +
            "\t//地图名称text: Array(\"蓑笠客傲然一笑：要想过此路，先和我比试比试\"),\n" +
            "\t//描述判定npc: Array(),\n" +
            "\t//npcdirection: Array(//可去路径{\n" +
            "\t\tname: \"咸阳\",\n" +
            "\t\ttext: \"返回游戏\"\n" +
            "\t})\n" +
            "},\n" +
            "{\n" +
            "\tname: \"武汉东驿道[2]\",\n" +
            "\t//地图名称text: Array(\"西：驿道\",\n" +
            "\t\"东：驿道\",\n" +
            "\t\"一条驿道静静的向远方延伸\"),\n" +
            "\t//描述判定npc: Array(),\n" +
            "\t//npcdirection: Array(//可去路径{\n" +
            "\t\tname: \"武汉东驿道[1]\",\n" +
            "\t\ttext: \"西：驿道 ←\"\n" +
            "\t},\n" +
            "\t{\n" +
            "\t\tname: \"武汉东驿道[3]\",\n" +
            "\t\ttext: \"东：驿道 →\"\n" +
            "\t})\n" +
            "},\n" +
            "{\n" +
            "\tname: \"京城东驿道[2]\",\n" +
            "\t//地图名称text: Array(\"北：驿道\",\n" +
            "\t\"南：驿道\",\n" +
            "\t\"一条驿道静静的向远方延伸\"),\n" +
            "\t//描述判定npc: Array(),\n" +
            "\t//npcdirection: Array(//可去路径{\n" +
            "\t\tname: \"京城东驿道[3]\",\n" +
            "\t\ttext: \"北：驿道 ↑\"\n" +
            "\t},\n" +
            "\t{\n" +
            "\t\tname: \"京城东驿道[1]\",\n" +
            "\t\ttext: \"南：驿道 ↓\"\n" +
            "\t})\n" +
            "},\n" +
            "{\n" +
            "\tname: \"洛阳北驿道[2]\",\n" +
            "\t//地图名称text: Array(\"北：驿道\",\n" +
            "\t\"南：驿道\",\n" +
            "\t\"一条驿道静静的向远方延伸\"),\n" +
            "\t//描述判定npc: Array(),\n" +
            "\t//npcdirection: Array(//可去路径{\n" +
            "\t\tname: \"洛阳北驿道[3]\",\n" +
            "\t\ttext: \"北：驿道 ↑\"\n" +
            "\t},\n" +
            "\t{\n" +
            "\t\tname: \"洛阳北驿道[1]\",\n" +
            "\t\ttext: \"南：驿道 ↓\"\n" +
            "\t})\n" +
            "},\n" +
            "{\n" +
            "\tname: \"天龙门\",\n" +
            "\t//地图名称text: Array(\"西：驿道 ←\",\n" +
            "\t\"东：走廊 →\",\n" +
            "\t\"通往八部殿的大门，武功高强的人才能通过这里\"),\n" +
            "\t//描述判定npc: Array(),\n" +
            "\t//npcdirection: Array(//可去路径{\n" +
            "\t\tname: \"洛阳南驿道[2]\",\n" +
            "\t\ttext: \"西：驿道 ←\"\n" +
            "\t},\n" +
            "\t{\n" +
            "\t\tname: \"天龙门走廊[1]\",\n" +
            "\t\ttext: \"东：走廊 →\"\n" +
            "\t})\n" +
            "},\n" +
            "{\n" +
            "\tname: \"天龙门走廊[1]\",\n" +
            "\t//地图名称text: Array(\"北：商店\",\n" +
            "\t\"西：天龙门\",\n" +
            "\t\"东：走廊 →\",\n" +
            "\t\"南：钱庄\",\n" +
            "\t\"被花海包围的走廊\"),\n" +
            "\t//描述判定npc: Array(\"八部众教众\"),\n" +
            "\t//npcdirection: Array(//可去路径{\n" +
            "\t\tname: \"天龙门商店\",\n" +
            "\t\ttext: \"北：商店 ↑\"\n" +
            "\t},\n" +
            "\t{\n" +
            "\t\tname: \"天龙门\",\n" +
            "\t\ttext: \"西：天龙门 ←\"\n" +
            "\t},\n" +
            "\t{\n" +
            "\t\tname: \"天龙门走廊[2]\",\n" +
            "\t\ttext: \"东：走廊 →\"\n" +
            "\t},\n" +
            "\t{\n" +
            "\t\tname: \"天龙门钱庄\",\n" +
            "\t\ttext: \"南：钱庄 ↓\"\n" +
            "\t})\n" +
            "},\n" +
            "{\n" +
            "\tname: \"天龙门商店\",\n" +
            "\t//地图名称text: Array(\"南：走廊 ↓\",\n" +
            "\t\"这是一家药铺，一股浓浓的药味让你几欲窒息\"),\n" +
            "\t//描述判定npc: Array(\"冷英\"),\n" +
            "\t//npc----不足挂齿direction: Array(//可去路径{\n" +
            "\t\tname: \"天龙门走廊[1]\",\n" +
            "\t\ttext: \"南：走廊 ↓\"\n" +
            "\t})\n" +
            "},\n" +
            "{\n" +
            "\tname: \"天龙门钱庄\",\n" +
            "\t//地图名称text: Array(\"北：走廊\",\n" +
            "\t\"一家装饰极为奢华的钱庄\"),\n" +
            "\t//描述判定npc: Array(\"轩辕风\"),\n" +
            "\t//npc----普普通通direction: Array(//可去路径{\n" +
            "\t\tname: \"天龙门走廊[1]\",\n" +
            "\t\ttext: \"北：走廊 ↑\"\n" +
            "\t})\n" +
            "},\n" +
            "{\n" +
            "\tname: \"天龙门走廊[2]\",\n" +
            "\t//地图名称text: Array(\"北：憩屋\",\n" +
            "\t\"西：走廊\",\n" +
            "\t\"东：养生门\",\n" +
            "\t\"南：当铺\",\n" +
            "\t\"一条驿道静静的向远方延伸\"),\n" +
            "\t//描述判定npc: Array(\"八部众教众\"),\n" +
            "\t//npcdirection: Array(//可去路径{\n" +
            "\t\tname: \"天龙门憩屋\",\n" +
            "\t\ttext: \"北：憩屋 ↑\"\n" +
            "\t},\n" +
            "\t{\n" +
            "\t\tname: \"天龙门走廊[1]\",\n" +
            "\t\ttext: \"西：走廊 ←\"\n" +
            "\t},\n" +
            "\t{\n" +
            "\t\tname: \"养生门\",\n" +
            "\t\ttext: \"东：养生门 →\"\n" +
            "\t},\n" +
            "\t{\n" +
            "\t\tname: \"天龙门当铺\",\n" +
            "\t\ttext: \"南：当铺 ↓\"\n" +
            "\t})\n" +
            "},\n" +
            "{\n" +
            "\tname: \"天龙门憩屋\",\n" +
            "\t//地图名称text: Array(\"南：走廊\",\n" +
            "\t\"这是一间甚是简陋的小屋\"),\n" +
            "\t//描述判定npc: Array(),\n" +
            "\t//npcdirection: Array(//可去路径{\n" +
            "\t\tname: \"天龙门走廊[2]\",\n" +
            "\t\ttext: \"南：走廊 ↓\"\n" +
            "\t})\n" +
            "},\n" +
            "{\n" +
            "\tname: \"天龙门钱庄\",\n" +
            "\t//地图名称text: Array(\"北：走廊\",\n" +
            "\t\"这是一家中等规模的当铺\"),\n" +
            "\t//描述判定npc: Array(\"夏石\"),\n" +
            "\t//npcdirection: Array(//可去路径{\n" +
            "\t\tname: \"天龙门走廊[2]\",\n" +
            "\t\ttext: \"北：走廊 ↑\"\n" +
            "\t})\n" +
            "},\n" +
            "{\n" +
            "\tname: \"养生门\",\n" +
            "\t//地图名称text: Array(\"西：走廊\",\n" +
            "\t\"东：中央花园\",\n" +
            "\t\"这是中央花园的西门\"),\n" +
            "\t//描述判定npc: Array(\"养生使者\"),\n" +
            "\t//npcdirection: Array(//可去路径{\n" +
            "\t\tname: \"天龙门走廊[2]\",\n" +
            "\t\ttext: \"西：走廊 ←\"\n" +
            "\t},\n" +
            "\t{\n" +
            "\t\tname: \"中央花园\",\n" +
            "\t\ttext: \"东：中央花园 →\"\n" +
            "\t})\n" +
            "},\n" +
            "{\n" +
            "\tname: \"中央花园\",\n" +
            "\t//地图名称text: Array(\"北：地户门\",\n" +
            "\t\"西：养生门\",\n" +
            "\t\"东：生死门\",\n" +
            "\t\"南：天齐门\",\n" +
            "\t\"熙熙攘攘的大街上\"),\n" +
            "\t//描述判定npc: Array(),\n" +
            "\t//npcdirection: Array(//可去路径{\n" +
            "\t\tname: \"地户门\",\n" +
            "\t\ttext: \"北：地户门 ↑\"\n" +
            "\t},\n" +
            "\t{\n" +
            "\t\tname: \"养生门\",\n" +
            "\t\ttext: \"西：养生门 ←\"\n" +
            "\t},\n" +
            "\t{\n" +
            "\t\tname: \"生死门\",\n" +
            "\t\ttext: \"东：生死门 →\"\n" +
            "\t},\n" +
            "\t{\n" +
            "\t\tname: \"天齐门\",\n" +
            "\t\ttext: \"南：天齐门 ↓\"\n" +
            "\t})\n" +
            "},\n" +
            "{\n" +
            "\tname: \"地户门\",\n" +
            "\t//地图名称text: Array(\"这是中央花园的南门，城门上竖立着一尊雕像\",\n" +
            "\t\"北：清幽小道 ↑\",\n" +
            "\t\"南：中央花园 ↓\"),\n" +
            "\t//描述判定npc: Array(\"地户使者\"),\n" +
            "\t//npcdirection: Array(//可去路径{\n" +
            "\t\tname: \"清幽小道[1]\",\n" +
            "\t\ttext: \"北：清幽小道 ↑\"\n" +
            "\t},\n" +
            "\t{\n" +
            "\t\tname: \"中央花园\",\n" +
            "\t\ttext: \"南：中央花园 ↓\"\n" +
            "\t})\n" +
            "},\n" +
            "{\n" +
            "\tname: \"清幽小道[1]\",\n" +
            "\t//地图名称text: Array(\"没有月光的晚上，这路上阴森森的，有些怕人\",\n" +
            "\t\"北：清幽小道 ↑\",\n" +
            "\t\"南：地户门 ↓\"),\n" +
            "\t//描述判定npc: Array(\"八部众教众\"),\n" +
            "\t//npcdirection: Array(//可去路径{\n" +
            "\t\tname: \"清幽小道[2]\",\n" +
            "\t\ttext: \"北：清幽小道 ↑\"\n" +
            "\t},\n" +
            "\t{\n" +
            "\t\tname: \"地户门\",\n" +
            "\t\ttext: \"南：地户门 ↓\"\n" +
            "\t})\n" +
            "},\n" +
            "{\n" +
            "\tname: \"清幽小道[2]\",\n" +
            "\t//地图名称text: Array(\"没有月光的晚上，这路上阴森森的，有些怕人\",\n" +
            "\t\"北：闭关室大门 ↑\",\n" +
            "\t\"南：清幽小道 ↓\"),\n" +
            "\t//描述判定npc: Array(\"八部众教众\"),\n" +
            "\t//npcdirection: Array(//可去路径{\n" +
            "\t\tname: \"闭关室大门\",\n" +
            "\t\ttext: \"北：闭关室大门 ↑\"\n" +
            "\t},\n" +
            "\t{\n" +
            "\t\tname: \"清幽小道[1]\",\n" +
            "\t\ttext: \"南：清幽小道 ↓\"\n" +
            "\t})\n" +
            "},\n" +
            "{\n" +
            "\tname: \"闭关室大门\",\n" +
            "\t//地图名称text: Array(\"神秘处的大门\",\n" +
            "\t\"北：闭关室 ↑\",\n" +
            "\t\"南：清幽小道 ↓\"),\n" +
            "\t//描述判定npc: Array(),\n" +
            "\t//npcdirection: Array(//可去路径{\n" +
            "\t\tname: \"闭关室\",\n" +
            "\t\ttext: \"北：闭关室 ↑\"\n" +
            "\t},\n" +
            "\t{\n" +
            "\t\tname: \"清幽小道[2]\",\n" +
            "\t\ttext: \"南：清幽小道 ↓\"\n" +
            "\t})\n" +
            "},\n" +
            "{\n" +
            "\tname: \"闭关室\",\n" +
            "\t//地图名称text: Array(\"神秘之所，周围都是点点星光\",\n" +
            "\t\"南：闭关室大门 ↓\"),\n" +
            "\t//描述判定npc: Array(),\n" +
            "\t//npcdirection: Array(//可去路径{\n" +
            "\t\tname: \"闭关室大门\",\n" +
            "\t\ttext: \"南：闭关室大门 ↓\"\n" +
            "\t})\n" +
            "},\n" +
            "{\n" +
            "\tname: \"天齐门\",\n" +
            "\t//地图名称text: Array(\"北：中央花园\",\n" +
            "\t\"南：隐居小道\",\n" +
            "\t\"这是中央花园的西门\"),\n" +
            "\t//描述判定npc: Array(\"天齐使者\"),\n" +
            "\t//npcdirection: Array(//可去路径{\n" +
            "\t\tname: \"中央花园\",\n" +
            "\t\ttext: \"北：中央花园 ↑\"\n" +
            "\t},\n" +
            "\t{\n" +
            "\t\tname: \"隐居小道[1]\",\n" +
            "\t\ttext: \"南：隐居小道 ↓\"\n" +
            "\t})\n" +
            "},\n" +
            "{\n" +
            "\tname: \"隐居小道[1]\",\n" +
            "\t//地图名称text: Array(\"北：天齐门\",\n" +
            "\t\"南：隐居小道\",\n" +
            "\t\"这是一条幽僻的路；白天也少人走，夜晚更加寂寞\"),\n" +
            "\t//描述判定npc: Array(\"八部众教众\"),\n" +
            "\t//npcdirection: Array(//可去路径{\n" +
            "\t\tname: \"天齐门\",\n" +
            "\t\ttext: \"北：天齐门 ↑\"\n" +
            "\t},\n" +
            "\t{\n" +
            "\t\tname: \"隐居小道[2]\",\n" +
            "\t\ttext: \"南：隐居小道 ↓\"\n" +
            "\t})\n" +
            "},\n" +
            "{\n" +
            "\tname: \"隐居小道[2]\",\n" +
            "\t//地图名称text: Array(\"北：隐居小道\",\n" +
            "\t\"西：小径\",\n" +
            "\t\"东：小径\",\n" +
            "\t\"南：隐居小道\",\n" +
            "\t\"这是一条幽僻的路；白天也少人走，夜晚更加寂寞\"),\n" +
            "\t//描述判定npc: Array(\"八部众教众\"),\n" +
            "\t//npcdirection: Array(//可去路径{\n" +
            "\t\tname: \"隐居小道[1]\",\n" +
            "\t\ttext: \"北：隐居小道 ↑\"\n" +
            "\t},\n" +
            "\t{\n" +
            "\t\tname: \"西小径[1]\",\n" +
            "\t\ttext: \"西：小径 ←\"\n" +
            "\t},\n" +
            "\t{\n" +
            "\t\tname: \"东小径[1]\",\n" +
            "\t\ttext: \"东：小径 →\"\n" +
            "\t},\n" +
            "\t{\n" +
            "\t\tname: \"隐居小道[3]\",\n" +
            "\t\ttext: \"南：隐居小道 ↓\"\n" +
            "\t})\n" +
            "},\n" +
            "{\n" +
            "\tname: \"西小径[1]\",\n" +
            "\t//地图名称text: Array(\"西：乾达婆居处\",\n" +
            "\t\"东：隐居小道\",\n" +
            "\t\"数百棵望天树形成一处神秘的自然景观\"),\n" +
            "\t//描述判定npc: Array(\"八部众教众\"),\n" +
            "\t//npcdirection: Array(//可去路径{\n" +
            "\t\tname: \"乾达婆居处\",\n" +
            "\t\ttext: \"西：乾达婆居处 ←\"\n" +
            "\t},\n" +
            "\t{\n" +
            "\t\tname: \"隐居小道[2]\",\n" +
            "\t\ttext: \"东：隐居小道 →\"\n" +
            "\t})\n" +
            "},\n" +
            "{\n" +
            "\tname: \"乾达婆居处\",\n" +
            "\t//地图名称text: Array(\"东：小径 →\",\n" +
            "\t\"乾达婆居处\"),\n" +
            "\t//描述判定npc: Array(\"乾达婆\"),\n" +
            "\t//npcdirection: Array(//可去路径{\n" +
            "\t\tname: \"西小径[1]\",\n" +
            "\t\ttext: \"东：小径 →\"\n" +
            "\t})\n" +
            "},\n" +
            "{\n" +
            "\tname: \"东小径[1]\",\n" +
            "\t//地图名称text: Array(\"西：隐居小道\",\n" +
            "\t\"东：迦楼罗居处\",\n" +
            "\t\"数百棵望天树形成一处神秘的自然景观\"),\n" +
            "\t//描述判定npc: Array(\"八部众教众\"),\n" +
            "\t//npcdirection: Array(//可去路径{\n" +
            "\t\tname: \"隐居小道[2]\",\n" +
            "\t\ttext: \"西：隐居小道 ←\"\n" +
            "\t},\n" +
            "\t{\n" +
            "\t\tname: \"迦楼罗居处\",\n" +
            "\t\ttext: \"东：迦楼罗居处 →\"\n" +
            "\t})\n" +
            "},\n" +
            "{\n" +
            "\tname: \"迦楼罗居处\",\n" +
            "\t//地图名称text: Array(\"西：小径\",\n" +
            "\t\"八部众之一的迦楼罗居所\"),\n" +
            "\t//描述判定npc: Array(\"迦楼罗\"),\n" +
            "\t//npcdirection: Array(//可去路径{\n" +
            "\t\tname: \"东小径[1]\",\n" +
            "\t\ttext: \"西：小径 ←\"\n" +
            "\t})\n" +
            "},\n" +
            "{\n" +
            "\tname: \"隐居小道[3]\",\n" +
            "\t//地图名称text: Array(\"北：隐居小道\",\n" +
            "\t\"西：小径\",\n" +
            "\t\"东：小径\",\n" +
            "\t\"这是一条幽僻的路；白天也少人走，夜晚更加寂寞\"),\n" +
            "\t//描述判定npc: Array(\"八部众教众\"),\n" +
            "\t//npcdirection: Array(//可去路径{\n" +
            "\t\tname: \"隐居小道[2]\",\n" +
            "\t\ttext: \"北：隐居小道 ↑\"\n" +
            "\t},\n" +
            "\t{\n" +
            "\t\tname: \"西小径[2]\",\n" +
            "\t\ttext: \"西：小径 ←\"\n" +
            "\t},\n" +
            "\t{\n" +
            "\t\tname: \"东小径[2]\",\n" +
            "\t\ttext: \"东：小径 →\"\n" +
            "\t})\n" +
            "},\n" +
            "{\n" +
            "\tname: \"西小径[2]\",\n" +
            "\t//地图名称text: Array(\"西：紧那罗居处\",\n" +
            "\t\"东：隐居小道\",\n" +
            "\t\"数百棵望天树形成一处神秘的自然景观\"),\n" +
            "\t//描述判定npc: Array(\"八部众教众\"),\n" +
            "\t//npcdirection: Array(//可去路径{\n" +
            "\t\tname: \"紧那罗居处\",\n" +
            "\t\ttext: \"西：紧那罗居处 ←\"\n" +
            "\t},\n" +
            "\t{\n" +
            "\t\tname: \"隐居小道[3]\",\n" +
            "\t\ttext: \"东：隐居小道 →\"\n" +
            "\t})\n" +
            "},\n" +
            "{\n" +
            "\tname: \"紧那罗居处\",\n" +
            "\t//地图名称text: Array(\"东：小径\",\n" +
            "\t\"八部众之一的紧那罗居所\"),\n" +
            "\t//描述判定npc: Array(\"紧那罗\"),\n" +
            "\t//npcdirection: Array(//可去路径{\n" +
            "\t\tname: \"西小径[2]\",\n" +
            "\t\ttext: \"东：小径 →\"\n" +
            "\t})\n" +
            "},\n" +
            "{\n" +
            "\tname: \"东小径[2]\",\n" +
            "\t//地图名称text: Array(\"西：隐居小道\",\n" +
            "\t\"东：阿修罗处\",\n" +
            "\t\"数百棵望天树形成一处神秘的自然景观\"),\n" +
            "\t//描述判定npc: Array(\"八部众教众\"),\n" +
            "\t//npcdirection: Array(//可去路径{\n" +
            "\t\tname: \"隐居小道[3]\",\n" +
            "\t\ttext: \"西：隐居小道 ←\"\n" +
            "\t},\n" +
            "\t{\n" +
            "\t\tname: \"阿修罗处\",\n" +
            "\t\ttext: \"东：阿修罗处 →\"\n" +
            "\t})\n" +
            "},\n" +
            "{\n" +
            "\tname: \"阿修罗处\",\n" +
            "\t//地图名称text: Array(\"西：小径\",\n" +
            "\t\"八部众之一的阿修罗居所\"),\n" +
            "\t//描述判定npc: Array(\"阿修罗\"),\n" +
            "\t//npcdirection: Array(//可去路径{\n" +
            "\t\tname: \"东小径[2]\",\n" +
            "\t\ttext: \"西：小径 ←\"\n" +
            "\t})\n" +
            "},\n" +
            "{\n" +
            "\tname: \"生死门\",\n" +
            "\t//地图名称text: Array(\"西：中央花园\",\n" +
            "\t\"东：八部殿\",\n" +
            "\t\"这是中央花园的东门\"),\n" +
            "\t//描述判定npc: Array(\"生死使者\"),\n" +
            "\t//npcdirection: Array(//可去路径{\n" +
            "\t\tname: \"中央花园\",\n" +
            "\t\ttext: \"西：中央花园 ←\"\n" +
            "\t},\n" +
            "\t{\n" +
            "\t\tname: \"八部殿\",\n" +
            "\t\ttext: \"东：八部殿 →\"\n" +
            "\t})\n" +
            "},\n" +
            "{\n" +
            "\tname: \"八部殿\",\n" +
            "\t//地图名称text: Array(\"北：摩呼罗迦处\",\n" +
            "\t\"西：生死门\",\n" +
            "\t\"东：八部后殿\",\n" +
            "\t\"大气而威严的一所圣殿\"),\n" +
            "\t//描述判定npc: Array(\"天齐使者\"),\n" +
            "\t//npcdirection: Array(//可去路径{\n" +
            "\t\tname: \"摩呼罗迦处\",\n" +
            "\t\ttext: \"北：摩呼罗迦处 ↑\"\n" +
            "\t},\n" +
            "\t{\n" +
            "\t\tname: \"生死门\",\n" +
            "\t\ttext: \"西：生死门 ←\"\n" +
            "\t},\n" +
            "\t{\n" +
            "\t\tname: \"八部后殿\",\n" +
            "\t\ttext: \"东：八部后殿 →\"\n" +
            "\t})\n" +
            "},\n" +
            "{\n" +
            "\tname: \"摩呼罗迦处\",\n" +
            "\t//地图名称text: Array(\"北：夜叉所\",\n" +
            "\t\"南：八部殿\",\n" +
            "\t\"八部众之一的摩呼罗迦居所\"),\n" +
            "\t//描述判定npc: Array(\"摩呼罗迦\"),\n" +
            "\t//npcdirection: Array(//可去路径{\n" +
            "\t\tname: \"夜叉所\",\n" +
            "\t\ttext: \"北：夜叉所 ↑\"\n" +
            "\t},\n" +
            "\t{\n" +
            "\t\tname: \"八部殿\",\n" +
            "\t\ttext: \"南：八部殿 ↓\"\n" +
            "\t})\n" +
            "},\n" +
            "{\n" +
            "\tname: \"夜叉所\",\n" +
            "\t//地图名称text: Array(\"北：龙栖息地\",\n" +
            "\t\"南：摩呼罗迦处\",\n" +
            "\t\"八部众之一的夜叉居所\"),\n" +
            "\t//描述判定npc: Array(\"夜叉\"),\n" +
            "\t//npcdirection: Array(//可去路径{\n" +
            "\t\tname: \"龙栖息地\",\n" +
            "\t\ttext: \"北：龙栖息地 ↑\"\n" +
            "\t},\n" +
            "\t{\n" +
            "\t\tname: \"摩呼罗迦处\",\n" +
            "\t\ttext: \"南：摩呼罗迦处 ↓\"\n" +
            "\t})\n" +
            "},\n" +
            "{\n" +
            "\tname: \"龙栖息地\",\n" +
            "\t//地图名称text: Array(\"南：夜叉所\",\n" +
            "\t\"八部众之一的龙居所\"),\n" +
            "\t//描述判定npc: Array(\"龙\"),\n" +
            "\t//npcdirection: Array(//可去路径{\n" +
            "\t\tname: \"夜叉所\",\n" +
            "\t\ttext: \"南：夜叉所 ↓\"\n" +
            "\t})\n" +
            "},\n" +
            "{\n" +
            "\tname: \"八部后殿\",\n" +
            "\t//地图名称text: Array(\"西：八部殿\",\n" +
            "\t\"东：圣地\",\n" +
            "\t\"大气而威严的一所圣殿\"),\n" +
            "\t//描述判定npc: Array(\"八部众教众\"),\n" +
            "\t//npcdirection: Array(//可去路径{\n" +
            "\t\tname: \"八部殿\",\n" +
            "\t\ttext: \"西：八部殿 ←\"\n" +
            "\t},\n" +
            "\t{\n" +
            "\t\tname: \"圣地\",\n" +
            "\t\ttext: \"东：圣地 →\"\n" +
            "\t})\n" +
            "},\n" +
            "{\n" +
            "\tname: \"圣地\",\n" +
            "\t//地图名称text: Array(\"西：八部后殿\",\n" +
            "\t\"东：圣地中心\",\n" +
            "\t\"周围是都是直入云霄的大树\"),\n" +
            "\t//描述判定npc: Array(\"八部众教众\"),\n" +
            "\t//npcdirection: Array(//可去路径{\n" +
            "\t\tname: \"八部后殿\",\n" +
            "\t\ttext: \"西：八部后殿 ←\"\n" +
            "\t},\n" +
            "\t{\n" +
            "\t\tname: \"圣地中心\",\n" +
            "\t\ttext: \"东：圣地中心 →\"\n" +
            "\t})\n" +
            "},\n" +
            "{\n" +
            "\tname: \"圣地中心\",\n" +
            "\t//地图名称text: Array(\"西：圣地\",\n" +
            "\t\"在光环之中俨然站着一个高大的巨人\"),\n" +
            "\t//描述判定npc: Array(\"天\"),\n" +
            "\t//npcdirection: Array(//可去路径{\n" +
            "\t\tname: \"圣地\",\n" +
            "\t\ttext: \"西：圣地 ←\"\n" +
            "\t})\n" +
            "},\n" +
            "{\n" +
            "\tname: \"清风峡谷入口\",\n" +
            "\t//地图名称text: Array(\"谷内吹出阵阵微风，高手云集的地方\",\n" +
            "\t\"西：峡谷口\"),\n" +
            "\t//描述判定npc: Array(\"守寺僧兵\",\n" +
            "\t\"喇嘛\"),\n" +
            "\t//npcdirection: Array(//可去路径{\n" +
            "\t\tname: \"峡谷口\",\n" +
            "\t\ttext: \"西：峡谷口 ←\"\n" +
            "\t},\n" +
            "\t{\n" +
            "\t\tname: \"大雪山山路\",\n" +
            "\t\ttext: \"东：大雪山山路 →\"\n" +
            "\t})\n" +
            "},\n" +
            "{\n" +
            "\tname: \"峡谷口\",\n" +
            "\t//地图名称text: Array(\"峡谷路由碎石组成，踏上去发出轻微的响声\",\n" +
            "\t\"东：清风峡谷入口\"),\n" +
            "\t//描述判定npc: Array(\"大旗使者\"),\n" +
            "\t//npcdirection: Array(//可去路径{\n" +
            "\t\tname: \"峡谷前部\",\n" +
            "\t\ttext: \"西：峡谷前部 ←\"\n" +
            "\t},\n" +
            "\t{\n" +
            "\t\tname: \"清风峡谷入口\",\n" +
            "\t\ttext: \"东：清风峡谷入口 →\"\n" +
            "\t})\n" +
            "},\n" +
            "{\n" +
            "\tname: \"峡谷前部\",\n" +
            "\t//地图名称text: Array(\"峡谷路由碎石组成，踏上去发出轻微的响声\",\n" +
            "\t\"东：峡谷口\"),\n" +
            "\t//描述判定npc: Array(\"苦罗高僧\"),\n" +
            "\t//npcdirection: Array(//可去路径{\n" +
            "\t\tname: \"峡谷前部[1]\",\n" +
            "\t\ttext: \"西：峡谷前部 ←\"\n" +
            "\t},\n" +
            "\t{\n" +
            "\t\tname: \"峡谷口\",\n" +
            "\t\ttext: \"东：峡谷口 →\"\n" +
            "\t})\n" +
            "},\n" +
            "{\n" +
            "\tname: \"峡谷前部[1]\",\n" +
            "\t//地图名称text: Array(\"峡谷路由碎石组成，踏上去发出轻微的响\",\n" +
            "\t\"北：山峰\"),\n" +
            "\t//描述判定npc: Array(\"大旗使者\"),\n" +
            "\t//npcdirection: Array(//可去路径{\n" +
            "\t\tname: \"山峰\",\n" +
            "\t\ttext: \"北：山峰 ↑\"\n" +
            "\t},\n" +
            "\t{\n" +
            "\t\tname: \"峡谷前部[2]\",\n" +
            "\t\ttext: \"西：峡谷前部 ←\"\n" +
            "\t},\n" +
            "\t{\n" +
            "\t\tname: \"峡谷前部\",\n" +
            "\t\ttext: \"东：峡谷前部 →\"\n" +
            "\t})\n" +
            "},\n" +
            "{\n" +
            "\tname: \"峡谷前部[2]\",\n" +
            "\t//地图名称text: Array(\"这是中央花园的东门，城门上竖立着一尊雕像\",\n" +
            "\t\"东：峡谷前部\"),\n" +
            "\t//描述判定npc: Array(\"幽风散人弟子\"),\n" +
            "\t//npcdirection: Array(//可去路径{\n" +
            "\t\tname: \"峡谷中部\",\n" +
            "\t\ttext: \"西：峡谷中部 ←\"\n" +
            "\t},\n" +
            "\t{\n" +
            "\t\tname: \"峡谷前部[1]\",\n" +
            "\t\ttext: \"东：峡谷前部 →\"\n" +
            "\t})\n" +
            "},\n" +
            "{\n" +
            "\tname: \"峡谷中部\",\n" +
            "\t//地图名称text: Array(\"北边连着雾恋峰，南边连着玛瑙峰\",\n" +
            "\t\"北：雾恋峰\"),\n" +
            "\t//描述判定npc: Array(),\n" +
            "\t//npcdirection: Array(//可去路径{\n" +
            "\t\tname: \"雾恋峰\",\n" +
            "\t\ttext: \"北：雾恋峰 ↑\"\n" +
            "\t},\n" +
            "\t{\n" +
            "\t\tname: \"峡谷后部\",\n" +
            "\t\ttext: \"西：峡谷后部 ←\"\n" +
            "\t},\n" +
            "\t{\n" +
            "\t\tname: \"峡谷前部[2]\",\n" +
            "\t\ttext: \"东：峡谷前部 →\"\n" +
            "\t},\n" +
            "\t{\n" +
            "\t\tname: \"玛瑙峰\",\n" +
            "\t\ttext: \"南：玛瑙峰 ↓\"\n" +
            "\t})\n" +
            "},\n" +
            "{\n" +
            "\tname: \"峡谷后部\",\n" +
            "\t//地图名称text: Array(\"这是中央花园的西门，城门上竖立着一尊雕像\",\n" +
            "\t\"东：峡谷中部\"),\n" +
            "\t//描述判定npc: Array(\"幽风散人弟子\"),\n" +
            "\t//npcdirection: Array(//可去路径{\n" +
            "\t\tname: \"峡谷后部[1]\",\n" +
            "\t\ttext: \"西：峡谷后部 ←\"\n" +
            "\t},\n" +
            "\t{\n" +
            "\t\tname: \"峡谷中部\",\n" +
            "\t\ttext: \"东：峡谷中部 →\"\n" +
            "\t})\n" +
            "},\n" +
            "{\n" +
            "\tname: \"峡谷后部[1]\",\n" +
            "\t//地图名称text: Array(\"峡谷路由碎石组成，踏上去发出轻微的响声\",\n" +
            "\t\"北：憩屋\"),\n" +
            "\t//描述判定npc: Array(\"幽风散人弟子\",\n" +
            "\t\"幽风散人\"),\n" +
            "\t//npcdirection: Array(//可去路径{\n" +
            "\t\tname: \"清风峡谷憩屋\",\n" +
            "\t\ttext: \"北：憩屋 ↑\"\n" +
            "\t},\n" +
            "\t{\n" +
            "\t\tname: \"峡谷后部[2]\",\n" +
            "\t\ttext: \"西：峡谷后部 ←\"\n" +
            "\t},\n" +
            "\t{\n" +
            "\t\tname: \"峡谷后部\",\n" +
            "\t\ttext: \"东：峡谷后部 →\"\n" +
            "\t},\n" +
            "\t{\n" +
            "\t\tname: \"清风峡谷当铺\",\n" +
            "\t\ttext: \"南：当铺 ↓\"\n" +
            "\t})\n" +
            "},\n" +
            "{\n" +
            "\tname: \"峡谷后部[2]\",\n" +
            "\t//地图名称text: Array(\"峡谷路由碎石组成，踏上去发出轻微的响声\",\n" +
            "\t\"北：药材摊\"),\n" +
            "\t//描述判定npc: Array(\"陆辕门\"),\n" +
            "\t//npcdirection: Array(//可去路径{\n" +
            "\t\tname: \"清风峡谷药材摊\",\n" +
            "\t\ttext: \"北：药材摊 ↑\"\n" +
            "\t},\n" +
            "\t{\n" +
            "\t\tname: \"峡谷尾部\",\n" +
            "\t\ttext: \"西：峡谷尾部 ←\"\n" +
            "\t},\n" +
            "\t{\n" +
            "\t\tname: \"峡谷后部[1]\",\n" +
            "\t\ttext: \"东：峡谷后部 →\"\n" +
            "\t},\n" +
            "\t{\n" +
            "\t\tname: \"清风峡谷钱庄\",\n" +
            "\t\ttext: \"南：钱庄 ↓\"\n" +
            "\t})\n" +
            "},\n" +
            "{\n" +
            "\tname: \"峡谷尾部\",\n" +
            "\t//地图名称text: Array(\"峡谷末端，长满了青草\",\n" +
            "\t\"东：峡谷后部\"),\n" +
            "\t//描述判定npc: Array(),\n" +
            "\t//npcdirection: Array(//可去路径{\n" +
            "\t\tname: \"峡谷后部[2]\",\n" +
            "\t\ttext: \"东：峡谷后部 →\"\n" +
            "\t})\n" +
            "},\n" +
            "{\n" +
            "\tname: \"清风峡谷钱庄\",\n" +
            "\t//地图名称text: Array(\"一家装饰极为奢华的钱庄\",\n" +
            "\t\"北：峡谷后部\"),\n" +
            "\t//描述判定npc: Array(\"小青\"),\n" +
            "\t//npcdirection: Array(//可去路径{\n" +
            "\t\tname: \"峡谷后部[2]\",\n" +
            "\t\ttext: \"北：峡谷后部 ↑\"\n" +
            "\t})\n" +
            "},\n" +
            "{\n" +
            "\tname: \"清风峡谷憩屋\",\n" +
            "\t//地图名称text: Array(\"这是一间甚是简陋的小屋\",\n" +
            "\t\"南：峡谷后部\"),\n" +
            "\t//描述判定npc: Array(),\n" +
            "\t//npcdirection: Array(//可去路径{\n" +
            "\t\tname: \"峡谷后部[1]\",\n" +
            "\t\ttext: \"南：峡谷后部 ↓\"\n" +
            "\t})\n" +
            "},\n" +
            "{\n" +
            "\tname: \"清风峡谷当铺\",\n" +
            "\t//地图名称text: Array(\"这是一家中等规模的当铺\",\n" +
            "\t\"北：峡谷后部\"),\n" +
            "\t//描述判定npc: Array(\"马孟\"),\n" +
            "\t//npcdirection: Array(//可去路径{\n" +
            "\t\tname: \"峡谷后部[2]\",\n" +
            "\t\ttext: \"北：峡谷后部 ↑\"\n" +
            "\t})\n" +
            "},\n" +
            "{\n" +
            "\tname: \"清风峡谷药材摊\",\n" +
            "\t//地图名称text: Array(\"这是一家药铺\",\n" +
            "\t\"南：峡谷后部 ↓\"),\n" +
            "\t//描述判定npc: Array(\"马孟\"),\n" +
            "\t//npcdirection: Array(//可去路径{\n" +
            "\t\tname: \"峡谷后部[2]\",\n" +
            "\t\ttext: \"南：峡谷后部 ↓\"\n" +
            "\t})\n" +
            "},\n" +
            "{\n" +
            "\tname: \"玛瑙峰\",\n" +
            "\t//地图名称text: Array(\"由阵阵迷雾包围的山峰，若隐若现\",\n" +
            "\t\"北：峡谷中部\"),\n" +
            "\t//描述判定npc: Array(),\n" +
            "\t//npcdirection: Array(//可去路径{\n" +
            "\t\tname: \"峡谷中部\",\n" +
            "\t\ttext: \"北：峡谷中部 ↑\"\n" +
            "\t},\n" +
            "\t{\n" +
            "\t\tname: \"山径\",\n" +
            "\t\ttext: \"东：山径 →\"\n" +
            "\t},\n" +
            "\t{\n" +
            "\t\tname: \"玛瑙盘路\",\n" +
            "\t\ttext: \"南：玛瑙盘路 ↓\"\n" +
            "\t})\n" +
            "},\n" +
            "{\n" +
            "\tname: \"山径\",\n" +
            "\t//地图名称text: Array(\"一条山道静静的向远方延伸，好象永远没有尽头\",\n" +
            "\t\"西：玛瑙峰\"),\n" +
            "\t//描述判定npc: Array(\"冷风散人弟子\"),\n" +
            "\t//npcdirection: Array(//可去路径{\n" +
            "\t\tname: \"玛瑙峰\",\n" +
            "\t\ttext: \"西：玛瑙峰 ←\"\n" +
            "\t},\n" +
            "\t{\n" +
            "\t\tname: \"观望口\",\n" +
            "\t\ttext: \"东：观望口 →\"\n" +
            "\t})\n" +
            "},\n" +
            "{\n" +
            "\tname: \"观望口\",\n" +
            "\t//地图名称text: Array(\"从这里望去，谷中山水如梦境一般，美极了\",\n" +
            "\t\"西：山径\"),\n" +
            "\t//描述判定npc: Array(),\n" +
            "\t//npcdirection: Array(//可去路径{\n" +
            "\t\tname: \"山径\",\n" +
            "\t\ttext: \"西：山径 ←\"\n" +
            "\t})\n" +
            "},\n" +
            "{\n" +
            "\tname: \"玛瑙盘路\",\n" +
            "\t//地图名称text: Array(\"由玛瑙石组成的山路，淡淡地发出红光\",\n" +
            "\t\"北：玛瑙峰\"),\n" +
            "\t//描述判定npc: Array(\"逸风散人弟子\"),\n" +
            "\t//npcdirection: Array(//可去路径{\n" +
            "\t\tname: \"玛瑙峰\",\n" +
            "\t\ttext: \"北：玛瑙峰 ↑\"\n" +
            "\t},\n" +
            "\t{\n" +
            "\t\tname: \"山径[1]\",\n" +
            "\t\ttext: \"东：山径 →\"\n" +
            "\t},\n" +
            "\t{\n" +
            "\t\tname: \"玛瑙盘路[1]\",\n" +
            "\t\ttext: \"南：玛瑙盘路 ↓\"\n" +
            "\t})\n" +
            "},\n" +
            "{\n" +
            "\tname: \"山径[1]\",\n" +
            "\t//地图名称text: Array(\"一条山道静静的向远方延伸，好象永远没有尽头\",\n" +
            "\t\"西：玛瑙盘路\"),\n" +
            "\t//描述判定npc: Array(\"冷风散人弟子\"),\n" +
            "\t//npcdirection: Array(//可去路径{\n" +
            "\t\tname: \"玛瑙盘路\",\n" +
            "\t\ttext: \"西：玛瑙盘路 ←\"\n" +
            "\t},\n" +
            "\t{\n" +
            "\t\tname: \"小水潭\",\n" +
            "\t\ttext: \"东：小水潭 →\"\n" +
            "\t})\n" +
            "},\n" +
            "{\n" +
            "\tname: \"小水潭\",\n" +
            "\t//地图名称text: Array(\"常年由雨水积聚而成的小水潭，不时有鱼儿嬉戏玩耍\",\n" +
            "\t\"西：山径\"),\n" +
            "\t//描述判定npc: Array(),\n" +
            "\t//npcdirection: Array(//可去路径{\n" +
            "\t\tname: \"山径[1]\",\n" +
            "\t\ttext: \"西：山径 ←\"\n" +
            "\t})\n" +
            "},\n" +
            "{\n" +
            "\tname: \"玛瑙盘路[1]\",\n" +
            "\t//地图名称text: Array(\"由玛瑙石组成的山路，淡淡地发出红光\",\n" +
            "\t\"北：玛瑙盘路\",\n" +
            "\t\"西：山径 ←\"),\n" +
            "\t//描述判定npc: Array(\"逸风散人弟子\"),\n" +
            "\t//npcdirection: Array(//可去路径{\n" +
            "\t\tname: \"玛瑙盘路\",\n" +
            "\t\ttext: \"北：玛瑙盘路 ↑\"\n" +
            "\t},\n" +
            "\t{\n" +
            "\t\tname: \"山径[2]\",\n" +
            "\t\ttext: \"西：山径 ←\"\n" +
            "\t})\n" +
            "},\n" +
            "{\n" +
            "\tname: \"山径[2]\",\n" +
            "\t//地图名称text: Array(\"一条山道静静的向远方延伸，好象永远没有尽头\",\n" +
            "\t\"东：玛瑙盘路\"),\n" +
            "\t//描述判定npc: Array(\"冷风散人弟子\"),\n" +
            "\t//npcdirection: Array(//可去路径{\n" +
            "\t\tname: \"望月亭\",\n" +
            "\t\ttext: \"西：望月亭 ←\"\n" +
            "\t},\n" +
            "\t{\n" +
            "\t\tname: \"玛瑙盘路[1]\",\n" +
            "\t\ttext: \"东：玛瑙盘路 →\"\n" +
            "\t})\n" +
            "},\n" +
            "{\n" +
            "\tname: \"望月亭\",\n" +
            "\t//地图名称text: Array(\"古人观星望月的场所\",\n" +
            "\t\"东：山径\"),\n" +
            "\t//描述判定npc: Array(\"雪凝\"),\n" +
            "\t//npcdirection: Array(//可去路径{\n" +
            "\t\tname: \"山径[2]\",\n" +
            "\t\ttext: \"东：山径 →\"\n" +
            "\t})\n" +
            "},\n" +
            "{\n" +
            "\tname: \"漫步阁\",\n" +
            "\t//地图名称text: Array(\"古人在这里漫步吟诗的地方\",\n" +
            "\t\"东：山径\"),\n" +
            "\t//描述判定npc: Array(\"魏卢奇\"),\n" +
            "\t//npcdirection: Array(//可去路径{\n" +
            "\t\tname: \"山径[2]\",\n" +
            "\t\ttext: \"东：山径 →\"\n" +
            "\t})\n" +
            "},\n" +
            "{\n" +
            "\tname: \"雾恋峰\",\n" +
            "\t//地图名称text: Array(\"山峰的石子都是由玛瑙石组成，远处看整个山峰发出微微的亮光\",\n" +
            "\t\"南：峡谷中部\"),\n" +
            "\t//描述判定npc: Array(\"雾风散人\"),\n" +
            "\t//npcdirection: Array(//可去路径{\n" +
            "\t\tname: \"雾恋幽境\",\n" +
            "\t\ttext: \"北：雾恋幽境 ↑\"\n" +
            "\t},\n" +
            "\t{\n" +
            "\t\tname: \"峡谷中部\",\n" +
            "\t\ttext: \"南：峡谷中部 ↓\"\n" +
            "\t})\n" +
            "},\n" +
            "{\n" +
            "\tname: \"雾恋幽境\",\n" +
            "\t//地图名称text: Array(\"迷雾环绕，偶尔能听见清脆的铃铛声\",\n" +
            "\t\"南：雾恋峰\"),\n" +
            "\t//描述判定npc: Array(\"雾风散人弟子\"),\n" +
            "\t//npcdirection: Array(//可去路径{\n" +
            "\t\tname: \"雾恋幽境[1]\",\n" +
            "\t\ttext: \"北：雾恋幽境 ↑\"\n" +
            "\t},\n" +
            "\t{\n" +
            "\t\tname: \"雾恋峰\",\n" +
            "\t\ttext: \"南：雾恋峰 ↓\"\n" +
            "\t})\n" +
            "},\n" +
            "{\n" +
            "\tname: \"雾恋幽境[1]\",\n" +
            "\t//地图名称text: Array(\"迷雾环绕，偶尔能听见清脆的铃铛声\",\n" +
            "\t\"北：剑圣居入口\"),\n" +
            "\t//描述判定npc: Array(\"雾风散人弟子\"),\n" +
            "\t//npcdirection: Array(//可去路径{\n" +
            "\t\tname: \"剑圣居入口\",\n" +
            "\t\ttext: \"北：剑圣居入口 ↑\"\n" +
            "\t},\n" +
            "\t{\n" +
            "\t\tname: \"雾恋幽境\",\n" +
            "\t\ttext: \"南：雾恋幽境 ↓\"\n" +
            "\t})\n" +
            "},\n" +
            "{\n" +
            "\tname: \"剑圣居入口\",\n" +
            "\t//地图名称text: Array(\"剑圣居的大门\",\n" +
            "\t\"南：雾恋幽境 ↓\"),\n" +
            "\t//描述判定npc: Array(\"笑清风\"),\n" +
            "\t//npcdirection: Array(//可去路径{\n" +
            "\t\tname: \"剑圣居\",\n" +
            "\t\ttext: \"北：剑圣居 ↑\"\n" +
            "\t},\n" +
            "\t{\n" +
            "\t\tname: \"雾恋幽境[1]\",\n" +
            "\t\ttext: \"南：雾恋幽境 ↓\"\n" +
            "\t})\n" +
            "},\n" +
            "{\n" +
            "\tname: \"山峰\",\n" +
            "\t//地图名称text: Array(\"清风谷前部的山峰，锻炼人意志的地方\",\n" +
            "\t\"南：峡谷前部\"),\n" +
            "\t//描述判定npc: Array(\"苦罗高僧\"),\n" +
            "\t//npcdirection: Array(//可去路径{\n" +
            "\t\tname: \"山峰[1]\",\n" +
            "\t\ttext: \"北：山峰 ↑\"\n" +
            "\t},\n" +
            "\t{\n" +
            "\t\tname: \"峡谷前部[1]\",\n" +
            "\t\ttext: \"南：峡谷前部 ↓\"\n" +
            "\t})\n" +
            "},\n" +
            "{\n" +
            "\tname: \"山峰[1]\",\n" +
            "\t//地图名称text: Array(\"清风谷前部的山峰，锻炼人意志的地方\",\n" +
            "\t\"北：山峰\",\n" +
            "\t\"南：山峰\"),\n" +
            "\t//描述判定npc: Array(\"苦罗高僧\"),\n" +
            "\t//npcdirection: Array(//可去路径{\n" +
            "\t\tname: \"山峰[2]\",\n" +
            "\t\ttext: \"北：山峰 ↑\"\n" +
            "\t},\n" +
            "\t{\n" +
            "\t\tname: \"山峰\",\n" +
            "\t\ttext: \"南：山峰 ↓\"\n" +
            "\t})\n" +
            "},\n" +
            "{\n" +
            "\tname: \"山峰[2]\",\n" +
            "\t//地图名称text: Array(\"清风谷前部的山峰，锻炼人意志的地方\",\n" +
            "\t\"南：山峰\"),\n" +
            "\t//描述判定npc: Array(\"苦罗高僧\"),\n" +
            "\t//npcdirection: Array(//可去路径{\n" +
            "\t\tname: \"山峰[1]\",\n" +
            "\t\ttext: \"南：山峰 ↓\"\n" +
            "\t})\n" +
            "},\n" +
            "{\n" +
            "\tname: \"唐门山道\",\n" +
            "\t//地图名称text: Array(\"你走在崎岖的山道小路上，道旁的小草稀稀落落\",\n" +
            "\t\"北：西大街\"),\n" +
            "\t//描述判定npc: Array(),\n" +
            "\t//npcdirection: Array(//可去路径{\n" +
            "\t\tname: \"成都西大街\",\n" +
            "\t\ttext: \"北：西大街 ↑\"\n" +
            "\t},\n" +
            "\t{\n" +
            "\t\tname: \"唐门山道[1]\",\n" +
            "\t\ttext: \"西：山道 ←\"\n" +
            "\t})\n" +
            "},\n" +
            "{\n" +
            "\tname: \"唐门山道[1]\",\n" +
            "\t//地图名称text: Array(\"你走在崎岖的山道小路上，道旁的小草稀稀落落\",\n" +
            "\t\"北：大门 ↑\"),\n" +
            "\t//描述判定npc: Array(),\n" +
            "\t//npcdirection: Array(//可去路径{\n" +
            "\t\tname: \"唐门大门\",\n" +
            "\t\ttext: \"北：大门 ↑\"\n" +
            "\t},\n" +
            "\t{\n" +
            "\t\tname: \"唐门山道\",\n" +
            "\t\ttext: \"东：唐门山道 →\"\n" +
            "\t})\n" +
            "},\n" +
            "{\n" +
            "\tname: \"唐门大门\",\n" +
            "\t//地图名称text: Array(\"这就是著名的蜀中唐门\",\n" +
            "\t\"北：前院 ↑\"),\n" +
            "\t//描述判定npc: Array(),\n" +
            "\t//npcdirection: Array(//可去路径{\n" +
            "\t\tname: \"唐门前院\",\n" +
            "\t\ttext: \"北：前院 ↑\"\n" +
            "\t},\n" +
            "\t{\n" +
            "\t\tname: \"唐门山道[1]\",\n" +
            "\t\ttext: \"南：山道 ↓\"\n" +
            "\t})\n" +
            "},\n" +
            "{\n" +
            "\tname: \"唐门前院\",\n" +
            "\t//地图名称text: Array(\"这是前院，院里栽了几棵大槐树\",\n" +
            "\t\"北：过道 ↑\"),\n" +
            "\t//描述判定npc: Array(),\n" +
            "\t//npcdirection: Array(//可去路径{\n" +
            "\t\tname: \"唐门过道\",\n" +
            "\t\ttext: \"北：过道 ↑\"\n" +
            "\t},\n" +
            "\t{\n" +
            "\t\tname: \"唐门大门\",\n" +
            "\t\ttext: \"南：大门 ↓\"\n" +
            "\t})\n" +
            "},\n" +
            "{\n" +
            "\tname: \"唐门过道\",\n" +
            "\t//地图名称text: Array(\"连接前后院的过道\",\n" +
            "\t\"北：客厅 ↑\",\n" +
            "\t\"南：前院 ↓\"),\n" +
            "\t//描述判定npc: Array(\"唐冰\"),\n" +
            "\t//npcdirection: Array(//可去路径{\n" +
            "\t\tname: \"唐门客厅\",\n" +
            "\t\ttext: \"北：客厅 ↑\"\n" +
            "\t},\n" +
            "\t{\n" +
            "\t\tname: \"唐门西走廊[1]\",\n" +
            "\t\ttext: \"西：西走廊 ←\"\n" +
            "\t},\n" +
            "\t{\n" +
            "\t\tname: \"唐门东走廊[1]\",\n" +
            "\t\ttext: \"东：东走廊 →\"\n" +
            "\t},\n" +
            "\t{\n" +
            "\t\tname: \"唐门前院\",\n" +
            "\t\ttext: \"南：前院 ↓\"\n" +
            "\t})\n" +
            "},\n" +
            "{\n" +
            "\tname: \"唐门客厅\",\n" +
            "\t//地图名称text: Array(\"这里是唐门门主会客的客厅\",\n" +
            "\t\"南：过道 ↓\"),\n" +
            "\t//描述判定npc: Array(\"方柔\"),\n" +
            "\t//npcdirection: Array(//可去路径{\n" +
            "\t\tname: \"唐门过道\",\n" +
            "\t\ttext: \"南：过道 ↓\"\n" +
            "\t})\n" +
            "},\n" +
            "{\n" +
            "\tname: \"唐门西走廊[1]\",\n" +
            "\t//地图名称text: Array(\"这里是西走廊，两边房子里都颇为安静\",\n" +
            "\t\"北：男弟子休息室 ↑\",\n" +
            "\t\"南：女弟子休息室 ↓\"),\n" +
            "\t//描述判定npc: Array(),\n" +
            "\t//npcdirection: Array(//可去路径{\n" +
            "\t\tname: \"唐门男弟子休息室\",\n" +
            "\t\ttext: \"北：男弟子休息室 ↑\"\n" +
            "\t},\n" +
            "\t{\n" +
            "\t\tname: \"唐门西走廊[2]\",\n" +
            "\t\ttext: \"西：西走廊 ←\"\n" +
            "\t},\n" +
            "\t{\n" +
            "\t\tname: \"唐门过道\",\n" +
            "\t\ttext: \"东：过道 →\"\n" +
            "\t},\n" +
            "\t{\n" +
            "\t\tname: \"唐门女弟子休息室\",\n" +
            "\t\ttext: \"南：女弟子休息室 ↓\"\n" +
            "\t})\n" +
            "},\n" +
            "{\n" +
            "\tname: \"唐门男弟子休息室\",\n" +
            "\t//地图名称text: Array(\"这里是唐门男弟子休息的地方\",\n" +
            "\t\"南：西走廊 ↓\"),\n" +
            "\t//描述判定npc: Array(),\n" +
            "\t//npcdirection: Array(//可去路径{\n" +
            "\t\tname: \"唐门西走廊[1]\",\n" +
            "\t\ttext: \"南：西走廊 ↓\"\n" +
            "\t})\n" +
            "},\n" +
            "{\n" +
            "\tname: \"唐门女弟子休息室\",\n" +
            "\t//地图名称text: Array(\"这里是唐门女弟子休息的地方\",\n" +
            "\t\"北：西走廊 ↑\"),\n" +
            "\t//描述判定npc: Array(),\n" +
            "\t//npcdirection: Array(//可去路径{\n" +
            "\t\tname: \"唐门西走廊[1]\",\n" +
            "\t\ttext: \"北：西走廊 ↑\"\n" +
            "\t})\n" +
            "},\n" +
            "{\n" +
            "\tname: \"唐门西走廊[2]\",\n" +
            "\t//地图名称text: Array(\"这里是西走廊，两边是少门主的书房\",\n" +
            "\t\"北：唐剑书房 ↑\",\n" +
            "\t\"南：唐白书房 ↓\"),\n" +
            "\t//描述判定npc: Array(),\n" +
            "\t//npcdirection: Array(//可去路径{\n" +
            "\t\tname: \"唐剑书房\",\n" +
            "\t\ttext: \"北：唐剑书房 ↑\"\n" +
            "\t},\n" +
            "\t{\n" +
            "\t\tname: \"唐门西走廊[3]\",\n" +
            "\t\ttext: \"西：西走廊 ←\"\n" +
            "\t},\n" +
            "\t{\n" +
            "\t\tname: \"唐门西走廊[1]\",\n" +
            "\t\ttext: \"东：西走廊 →\"\n" +
            "\t},\n" +
            "\t{\n" +
            "\t\tname: \"唐白书房\",\n" +
            "\t\ttext: \"南：唐白书房 ↓\"\n" +
            "\t})\n" +
            "},\n" +
            "{\n" +
            "\tname: \"唐剑书房\",\n" +
            "\t//地图名称text: Array(\"这里是少门主唐剑的书房\",\n" +
            "\t\"南：西走廊 ↓\"),\n" +
            "\t//描述判定npc: Array(),\n" +
            "\t//npcdirection: Array(//可去路径{\n" +
            "\t\tname: \"唐门西走廊[2]\",\n" +
            "\t\ttext: \"南：西走廊 ↓\"\n" +
            "\t})\n" +
            "},\n" +
            "{\n" +
            "\tname: \"唐白书房\",\n" +
            "\t//地图名称text: Array(\"这里是少门主唐白的书房\",\n" +
            "\t\"北：西走廊 ↑\"),\n" +
            "\t//描述判定npc: Array(\"唐白\"),\n" +
            "\t//npcdirection: Array(//可去路径{\n" +
            "\t\tname: \"唐门西走廊[2]\",\n" +
            "\t\ttext: \"北：西走廊 ↑\"\n" +
            "\t})\n" +
            "},\n" +
            "{\n" +
            "\tname: \"唐门西走廊[3]\",\n" +
            "\t//地图名称text: Array(\"这里是西走廊，两边是两位小姐闺房\",\n" +
            "\t\"北：唐方闺房 ↑\",\n" +
            "\t\"南：唐圆闺房 ↓\"),\n" +
            "\t//描述判定npc: Array(),\n" +
            "\t//npcdirection: Array(//可去路径{\n" +
            "\t\tname: \"唐方闺房\",\n" +
            "\t\ttext: \"北：唐方闺房 ↑\"\n" +
            "\t},\n" +
            "\t{\n" +
            "\t\tname: \"唐门有为轩\",\n" +
            "\t\ttext: \"西：有为轩 ←\"\n" +
            "\t},\n" +
            "\t{\n" +
            "\t\tname: \"唐门西走廊[2]\",\n" +
            "\t\ttext: \"东：西走廊 →\"\n" +
            "\t},\n" +
            "\t{\n" +
            "\t\tname: \"唐圆闺房\",\n" +
            "\t\ttext: \"南：唐圆闺房 ↓\"\n" +
            "\t})\n" +
            "},\n" +
            "{\n" +
            "\tname: \"唐方闺房\",\n" +
            "\t//地图名称text: Array(\"这里是唐云大女儿唐方的居所\",\n" +
            "\t\"南：西走廊 ↓\"),\n" +
            "\t//描述判定npc: Array(),\n" +
            "\t//npcdirection: Array(//可去路径{\n" +
            "\t\tname: \"唐门西走廊[3]\",\n" +
            "\t\ttext: \"南：西走廊 ↓\"\n" +
            "\t})\n" +
            "},\n" +
            "{\n" +
            "\tname: \"唐门有为轩\",\n" +
            "\t//地图名称text: Array(\"这是唐门门主的书房\",\n" +
            "\t\"东：西走廊 →\"),\n" +
            "\t//描述判定npc: Array(),\n" +
            "\t//npcdirection: Array(//可去路径{\n" +
            "\t\tname: \"唐门西走廊[3]\",\n" +
            "\t\ttext: \"东：西走廊 →\"\n" +
            "\t})\n" +
            "},\n" +
            "{\n" +
            "\tname: \"唐圆闺房\",\n" +
            "\t//地图名称text: Array(\"这里是唐云二女儿唐圆的居所\",\n" +
            "\t\"北：西走廊 ↑\"),\n" +
            "\t//描述判定npc: Array(\"唐圆\"),\n" +
            "\t//npcdirection: Array(//可去路径{\n" +
            "\t\tname: \"唐门西走廊[3]\",\n" +
            "\t\ttext: \"北：西走廊 ↑\"\n" +
            "\t})\n" +
            "},\n" +
            "{\n" +
            "\tname: \"唐门东走廊[1]\",\n" +
            "\t//地图名称text: Array(\"这里是东走廊，南边是厨房\",\n" +
            "\t\"西：过道 ←\",\n" +
            "\t\"南：厨房 ↓\"),\n" +
            "\t//描述判定npc: Array(),\n" +
            "\t//npcdirection: Array(//可去路径{\n" +
            "\t\tname: \"唐门过道\",\n" +
            "\t\ttext: \"西：过道 ←\"\n" +
            "\t},\n" +
            "\t{\n" +
            "\t\tname: \"唐门东走廊[2]\",\n" +
            "\t\ttext: \"东：东走廊 →\"\n" +
            "\t},\n" +
            "\t{\n" +
            "\t\tname: \"唐门厨房\",\n" +
            "\t\ttext: \"南：厨房 ↓\"\n" +
            "\t})\n" +
            "},\n" +
            "{\n" +
            "\tname: \"唐圆厨房\",\n" +
            "\t//地图名称text: Array(\"这里是唐门弟子吃饭的地方\",\n" +
            "\t\"北：东走廊 ↑\"),\n" +
            "\t//描述判定npc: Array(),\n" +
            "\t//npcdirection: Array(//可去路径{\n" +
            "\t\tname: \"唐门东走廊[1]\",\n" +
            "\t\ttext: \"北：东走廊 ↑\"\n" +
            "\t})\n" +
            "},\n" +
            "{\n" +
            "\tname: \"唐门东走廊[2]\",\n" +
            "\t//地图名称text: Array(\"这里是东走廊，东边是练武场\",\n" +
            "\t\"西：东走廊 ←\",\n" +
            "\t\"东：练武场 →\"),\n" +
            "\t//描述判定npc: Array(),\n" +
            "\t//npcdirection: Array(//可去路径{\n" +
            "\t\tname: \"唐门东走廊[1]\",\n" +
            "\t\ttext: \"西：东走廊 ←\"\n" +
            "\t},\n" +
            "\t{\n" +
            "\t\tname: \"唐门练武场\",\n" +
            "\t\ttext: \"东：练武场 →\"\n" +
            "\t})\n" +
            "},\n" +
            "{\n" +
            "\tname: \"唐门练武场\",\n" +
            "\t//地图名称text: Array(\"这是唐门的练武场\",\n" +
            "\t\"北：后花园 ↑\",\n" +
            "\t\"西：东走廊 ←\"),\n" +
            "\t//描述判定npc: Array(\"唐剑\"),\n" +
            "\t//npcdirection: Array(//可去路径{\n" +
            "\t\tname: \"唐门后花园\",\n" +
            "\t\ttext: \"北：后花园 ↑\"\n" +
            "\t},\n" +
            "\t{\n" +
            "\t\tname: \"唐门东走廊[2]\",\n" +
            "\t\ttext: \"西：东走廊 ←\"\n" +
            "\t},\n" +
            "\t{\n" +
            "\t\tname: \"唐门武器库\",\n" +
            "\t\ttext: \"东：武器库 →\"\n" +
            "\t})\n" +
            "},\n" +
            "{\n" +
            "\tname: \"唐门后花园\",\n" +
            "\t//地图名称text: Array(\"这是唐门的后花园\",\n" +
            "\t\"东：藏剑阁 →\",\n" +
            "\t\"南：练武场 ↓\"),\n" +
            "\t//描述判定npc: Array(\"唐梅\",\n" +
            "\t\"唐竹\"),\n" +
            "\t//npcdirection: Array(//可去路径{\n" +
            "\t\tname: \"唐门藏剑阁\",\n" +
            "\t\ttext: \"东：藏剑阁 →\"\n" +
            "\t},\n" +
            "\t{\n" +
            "\t\tname: \"唐门练武场\",\n" +
            "\t\ttext: \"南：练武场 ↓\"\n" +
            "\t})\n" +
            "},\n" +
            "{\n" +
            "\tname: \"唐门藏剑阁\",\n" +
            "\t//地图名称text: Array(\"这里就是藏剑阁了\",\n" +
            "\t\"西：后花园 ←\"),\n" +
            "\t//描述判定npc: Array(\"欧阳敏\"),\n" +
            "\t//npcdirection: Array(//可去路径{\n" +
            "\t\tname: \"唐门后花园\",\n" +
            "\t\ttext: \"西：后花园 ←\"\n" +
            "\t})\n" +
            "},\n" +
            "{\n" +
            "\tname: \"唐门武器库\",\n" +
            "\t//地图名称text: Array(\"这里是武器库\",\n" +
            "\t\"西：练武场 ←\"),\n" +
            "\t//描述判定npc: Array(\"欧阳敏\"),\n" +
            "\t//npcdirection: Array(//可去路径{\n" +
            "\t\tname: \"唐门练武场\",\n" +
            "\t\ttext: \"西：练武场 ←\"\n" +
            "\t})\n" +
            "},\n" +
            "{\n" +
            "\tname: \"死狱\",\n" +
            "\t//地图名称text: Array(\"这里是囚禁恶意PK的玩家的地方\"),\n" +
            "\t//描述判定npc: Array(),\n" +
            "\t//npcdirection: Array(//可去路径{\n" +
            "\t\tname: \"返回首页\",\n" +
            "\t\ttext: \"长安客栈\"\n" +
            "\t})\n" +
            "},\n" +
            "{\n" +
            "\tname: \"死狱[1]\",\n" +
            "\t//地图名称text: Array(\"黑漆漆的房间中闪着点点烛光\",\n" +
            "\t\"铁栏外面的几个狱卒一起在喝着酒赌钱\"),\n" +
            "\t//描述判定npc: Array(),\n" +
            "\t//npcdirection: Array(//可去路径{\n" +
            "\t\tname: \">挖矿\",\n" +
            "\t\ttext: \"返回游戏\"\n" +
            "\t})\n" +
            "},\n" +
            "{\n" +
            "\tname: \"死狱[2]\",\n" +
            "\t//地图名称text: Array(\">开始挖\",\n" +
            "\t\"返回游戏\"),\n" +
            "\t//描述判定npc: Array(),\n" +
            "\t//npcdirection: Array(//可去路径{\n" +
            "\t\tname: \"返回首页\",\n" +
            "\t\ttext: \"开始挖\"\n" +
            "\t})\n" +
            "},\n" +
            "{\n" +
            "\tname: \"死狱[3]\",\n" +
            "\t//地图名称text: Array(\">继续挖\",\n" +
            "\t\"返回游戏\"),\n" +
            "\t//描述判定npc: Array(),\n" +
            "\t//npcdirection: Array(//可去路径{\n" +
            "\t\tname: \"返回首页\",\n" +
            "\t\ttext: \"继续挖\"\n" +
            "\t})\n" +
            "},\n" +
            "{\n" +
            "\tname: \"死狱[4]\",\n" +
            "\t//地图名称text: Array(\"你使出吃奶的劲掰开了铁栏杆\"),\n" +
            "\t//描述判定npc: Array(),\n" +
            "\t//npcdirection: Array(//可去路径{\n" +
            "\t\tname: \"首页\",\n" +
            "\t\ttext: \"返回\"\n" +
            "\t})\n" +
            "}";

       */

    /***
     * 武功的等级设定
     */
  /*  public static final Map<String, String> GAME_GEST_LEVEL_MAP = new HashMap<String, String>(){
        {
            GAME_GEST_LEVEL_MAP.put("1", "e");
        }
    };*/


    public static void main(String[] args) {
        String data = "{\n" +
                "\tname: \"首页\",\n" +
                "\t//地图名称text: Array(\"本页包含你的账号和密码信息\",\n" +
                "\t\"新手村\",\n" +
                "\t\"开始江湖\"),\n" +
                "\t//描述判定npc: Array(),\n" +
                "\t//npcdirection: Array(//可去路径{\n" +
                "\t\tname: this.enx,\n" +
                "\t\ttext: \"开始江湖冒险\"\n" +
                "\t},\n" +
                "\t{\n" +
                "\t\tname: \"江湖大厅论坛\",\n" +
                "\t\ttext: \"论坛\"\n" +
                "\t},\n" +
                "\t{\n" +
                "\t\tname: \"长安客栈\",\n" +
                "\t\ttext: \"长安客栈\"\n" +
                "\t})\n" +
                "}";
        JSONObject mapJson = JSONObject.parseObject(data);
        System.out.println(mapJson.toJSONString());
    }
}
